{
    "compendium": {
        "class": {
            "name": "Barbarian",
            "autolevel": [
                {
                    "feature": {
                        "name": "Path of the Beast (UA): Path of the Beast",
                        "text": [
                            "Barbarians who walk the Path of Beast draw their rage from a bestial spark burning within their souls. That beast howls to be released and bursts forth in the throes of rage.",
                            "Those who tread this path might be inhabited by a primal spirit or descended from shapeshifters. You can choose the origin of your feral might or determine it randomly by rolling on the Origin of the Beast table.",
                            "",
                            "Origin of the Beast",
                            "d4 | Origin",
                            "1 | One of your parents is a lycanthrope, and you've inherited some of the curse.",
                            "2 | You are descended from a legendary druid, a fact manifested by your ability to partially change shape.",
                            "3 | A fey spirit gifted you with the ability to adopt different bestial aspects.",
                            "4 | An ancient animal spirit dwells within you, allowing you to walk this path.",
                            "",
                            "Source: Unearthed Arcana: 2020 Subclasses Pt1 p. 1"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Path of the Beast (UA): Form of the Beast",
                        "text": [
                            "3rd-level Path of the Beast feature",
                            "When you enter your rage, you can transform, revealing the bestial power within you. Until your rage ends, you manifest a natural melee weapon, choosing one of the following options each time you rage:",
                            "",
                            "Bite",
                            "• Your mouth transforms into a bestial snout or great mandibles (your choice). Your bite deals 1d8 piercing damage on a hit. Once on each of your turns when you damage a creature with your bite, you regain a number of hit points equal to your Constitution modifier (minimum of 1 hit point).",
                            "Claws",
                            "• Your hands transform into claws, which deal 1d6 slashing damage on a hit. When you take the Attack action on your turn and make an attack with your claws, you can make one additional attack using your claws as part of the same action.",
                            "Tail",
                            "• You grow a lashing, spiny tail, which deals 1d12 piercing damage on a hit and has the reach property.",
                            "",
                            "",
                            "Source: Unearthed Arcana: 2020 Subclasses Pt1 p. 1"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Path of the Beast (UA): Bestial Soul",
                        "text": [
                            "6th-level Path of the Beast feature",
                            "The feral spirit within you grows in power, causing the natural weapons of your Form of the Beast to count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.",
                            "You can also call on the feral spirit to help you adapt to your surroundings. When you finish a short or long rest, choose one of the following benefits, which lasts until you finish a short or long rest:",
                            "• You gain a swimming speed equal to your walking speed, and you can breathe underwater.",
                            "• You gain a climbing speed equal to your walking speed, and you can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check.",
                            "• When you jump, you can make a Strength (Athletics) check and extend your jump by a number of feet equal to the check's total. You can make this special check only once per turn.",
                            "",
                            "Source: Unearthed Arcana: 2020 Subclasses Pt1 p. 1"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Path of the Beast (UA): Infectious Fury",
                        "text": [
                            "10th-level Path of the Beast feature",
                            "When you hit a creature with your natural weapons while you are raging, the spirit within you can curse your target with rabid fury. The target must succeed on a Wisdom saving throw (DC equal to 8 + your Constitution modifier + your proficiency bonus) or suffer one of the following effects (your choice):",
                            "• The target must use its reaction to make a melee attack against another creature of your choice that you can see.",
                            "• Target takes 2d12 psychic damage.",
                            "You can use this feature a number of times equal to your Constitution modifier (a minimum of once). You regain all expended uses when you finish a long rest.",
                            "",
                            "Source: Unearthed Arcana: 2020 Subclasses Pt1 p. 1"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "10"
                },
                {
                    "feature": {
                        "name": "Path of the Beast (UA): Call the Hunt",
                        "text": [
                            "14th-level Path of the Beast feature",
                            "The beast within grows so powerful that you can spread its ferocity to your allies. When you enter your rage, you can choose a number of willing creatures you can see within 30 feet of you equal to your Constitution modifier (minimum of one creature). Until your rage ends, the chosen creatures gain the Reckless Attack feature and you have advantage on saving throws against being frightened. You also gain 5 temporary hit points for each creature that accepts the benefit. You can use this feature a number of times equal to your Constitution modifier (a minimum of once). You regain all expended uses when you finish a long rest.",
                            "",
                            "Source: Unearthed Arcana: 2020 Subclasses Pt1 p. 1"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "14"
                }
            ]
        },
        "_version": "5",
        "_auto_indent": "NO"
    }
}
