{
    "compendium": {
        "class": {
            "name": "Ranger",
            "autolevel": [
                {
                    "feature": [
                        {
                            "name": "Fighting Style: Close Quarters Shooter",
                            "text": [
                                "When making a ranged attack while you are within 5 feet of a hostile creature, you do not have disadvantage on the attack roll. Your ranged attacks ignore half cover and three-quarters cover against targets within 30 feet of you. You have a +1 bonus to attack rolls on ranged attacks.",
                                "",
                                "Source: Unearthed Arcana: Light Dark Underdark p. 89"
                            ],
                            "_optional": "YES"
                        },
                        {
                            "name": "Fighting Style: Tunnel Fighter",
                            "text": [
                                "As a bonus action, you can enter a defensive stance that lasts until the start of your next turn. While in your defensive stance, you can make opportunity attacks without using your reaction, and you can use your reaction to make a melee attack against a creature that moves more than 5 feet while within your reach.",
                                "",
                                "Source: Unearthed Arcana: Light Dark Underdark p. 89"
                            ],
                            "_optional": "YES"
                        }
                    ],
                    "_level": "2"
                },
                {
                    "feature": {
                        "name": "Deep Stalker (UA): Deep Stalker",
                        "text": [
                            "Many Deep Stalkers are elves, as those folk know all too well the threat posed by the drow. Deep Stalkers scout for new passages into the Underdark, carefully mapping them and working to ensure they remain watched at all times. They venture into the depths on long, dangerous patrols, disappearing for months at a time. Many of them never return. Deep Stalkers master spells useful in navigating the Underdark, and their combat tactics focus on ambush, surprise, and stealth. They fight alone or in small groups in hostile territory, relying on clever tactics to carry the day.",
                            "",
                            "Source: Unearthed Arcana: Light Dark Underdark p. 1"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Deep Stalker (UA): Deep Stalker Magic",
                        "text": [
                            "From 3rd level, you have darkvision with a range of 90 feet. You also gain access to additional spells at 3rd, 5th, 9th, 13th, and 15th level. You are always able to cast these spells, and they do not count against your number of ranger spells known.",
                            "",
                            "Deep Stalker Spells",
                            "Ranger Level | Spells",
                            "3rd | disguise self",
                            "5th | rope trick",
                            "9th | glyph of warding",
                            "13th | greater invisibility",
                            "17th | seeming",
                            "",
                            "Source: Unearthed Arcana: Light Dark Underdark p. 1"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Deep Stalker (UA): Underdark Scout",
                        "text": [
                            "At 3rd level, you master the art of the ambush. On your first turn during combat, you gain a +10 bonus to your speed. If you use the attack action on that turn, you can make one additional attack. You gain an additional benefit on all turns after your first turn. At the end of each such turn, you can attempt to hide as a bonus action if you meet the normal requirements for hiding.",
                            "",
                            "Source: Unearthed Arcana: Light Dark Underdark p. 1"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Deep Stalker (UA): Iron Mind",
                        "text": [
                            "At 7th level, you gain proficiency in Wisdom saving throws.",
                            "",
                            "Source: Unearthed Arcana: Light Dark Underdark p. 1"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "7"
                },
                {
                    "feature": {
                        "name": "Deep Stalker (UA): Stalker's Flurry",
                        "text": [
                            "Starting at 11th level, you have the ability to ensure that your attacks count. If you miss with an attack during your turn, you can immediately make an additional attack. You can gain one additional attack during your turn with this ability.",
                            "",
                            "Source: Unearthed Arcana: Light Dark Underdark p. 1"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "11"
                },
                {
                    "feature": {
                        "name": "Deep Stalker (UA): Stalker's Dodge",
                        "text": [
                            "At 15th level, you master the ability to disrupt an opponent's attacks. If a creature attacks you and does not have advantage on the attack roll, you can use your reaction to grant it disadvantage on the attack roll. You must use this ability before you know the result of the attack.",
                            "",
                            "Source: Unearthed Arcana: Light Dark Underdark p. 1"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "15"
                }
            ]
        },
        "_version": "5",
        "_auto_indent": "NO"
    }
}
