{
    "compendium": {
        "class": {
            "name": "Cleric",
            "hd": "8",
            "proficiency": "Wisdom, Charisma, History, Insight, Medicine, Persuasion, Religion",
            "numSkills": "2",
            "spellAbility": "Wisdom",
            "autolevel": [
                {
                    "feature": {
                        "name": "Starting Cleric",
                        "text": [
                            "As a 1st-level Cleric, you begin play with 8+your Constitution modifier hit points.",
                            "",
                            "You are proficient with the following items, in addition to any proficiencies provided by your race or background.",
                            "• Armor: light, medium, shields",
                            "• Weapons: simple",
                            "• Tools: none",
                            "• Skills: Choose 2 from History, Insight, Medicine, Persuasion, Religion",
                            "",
                            "You begin play with the following equipment, in addition to any equipment provided by your background.",
                            "• (a) a mace or (b) a warhammer (if proficient)",
                            "• (a) scale mail, (b) leather armor, or (c) chain mail (if proficient)",
                            "• (a) a light crossbow and Crossbow Bolts (20) or (b) any simple weapon",
                            "• (a) a priest's pack or (b) an explorer's pack",
                            "• A shield and a holy symbol",
                            "",
                            "Alternatively, you may start with 5d4 x 10 gp and choose your own equipment.",
                            "",
                            "Source: Player's Handbook p. 36"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Multiclass Cleric",
                        "text": [
                            "To multiclass as a Cleric, you must meet the following prerequisites:",
                            "• Wisdom 13",
                            "",
                            "You gain the following proficiencies:",
                            "• Armor: light, medium, shields",
                            "• Weapons: none",
                            "• Tools: none",
                            "",
                            "Source: Player's Handbook p. 36"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "slots": "3, 2",
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Spellcasting",
                        "text": [
                            "As a conduit for divine power, you can cast cleric spells. See chapter 10 for the general rules of spellcasting and chapter 11 for a selection of cleric spells.",
                            "",
                            "Cantrips:",
                            "At 1st level, you know three cantrips of your choice from the cleric spell list. You learn additional cleric cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Cleric table.",
                            "",
                            "Preparing and Casting Spells:",
                            "The Cleric table shows how many spell slots you have to cast your cleric spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
                            "You prepare the list of cleric spells that are available for you to cast, choosing from the cleric spell list. When you do so, choose a number of cleric spells equal to your Wisdom modifier + your cleric level (minimum of one spell). The spells must be of a level for which you have spell slots.",
                            "For example, if you are a 3rd-level cleric, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell cure wounds, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.",
                            "You can change your list of prepared spells when you finish a long rest. Preparing a new list of cleric spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list.",
                            "",
                            "Spellcasting Ability:",
                            "Wisdom is your spellcasting ability for your cleric spells. The power of your spells comes from your devotion to your deity. You use your Wisdom whenever a cleric spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a cleric spell you cast and when making an attack roll with one.",
                            "",
                            "Ritual Casting:",
                            "You can cast a cleric spell as a ritual if that spell has the ritual tag and you have the spell prepared.",
                            "",
                            "Spellcasting Focus:",
                            "You can use a holy symbol as a spellcasting focus for your cleric spells.",
                            "",
                            "Source: Player's Handbook p. 36"
                        ]
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Divine Domain",
                        "text": [
                            "Choose one domain related to your deity from the list of available domains. Each domain is detailed in their own feature, and each one provides examples of gods associated with it. Your choice grants you domain spells and other features when you choose it at 1st level. It also grants you additional ways to use Channel Divinity when you gain that feature at 2nd level, and additional benefits at 6th, 8th, and 17th levels.",
                            "",
                            "Domain Spells:",
                            "Each domain has a list of spells—its domain spells—that you gain at the cleric levels noted in the domain description. Once you gain a domain spell, you always have it prepared, and it doesn't count against the number of spells you can prepare each day.",
                            "If you have a domain spell that doesn't appear on the cleric spell list, the spell is nonetheless a cleric spell for you.",
                            "",
                            "Source: Player's Handbook p. 36"
                        ]
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Divine Domain: Knowledge Domain",
                        "text": [
                            "The gods of knowledge—including Oghma, Boccob, Gilean, Aureon, and Thoth—value learning and understanding above all. Some teach that knowledge is to be gathered and shared in libraries and universities, or promote the practical knowledge of craft and invention. Some deities hoard knowledge and keep its secrets to themselves. And some promise their followers that they will gain tremendous power if they unlock the secrets of the multiverse. Followers of these gods study esoteric lore, collect old tomes, delve into the secret places of the earth, and learn all they can. Some gods of knowledge promote the practical knowledge of craft and invention, including smith deities like Gond, Reorx, Onatar, Moradin, Hephaestus, and Goibhniu.",
                            "At each indicated cleric level, you add the listed spells to your spells prepared.",
                            "",
                            "Knowledge Domain Spells",
                            "Cleric Level | Spells",
                            "1st | command, identify",
                            "3rd | augury, suggestion",
                            "5th | nondetection, speak with dead",
                            "7th | arcane eye, confusion",
                            "9th | legend lore, scrying",
                            "",
                            "Source: Player's Handbook p. 59"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Knowledge Domain: Blessings of Knowledge",
                        "text": [
                            "At 1st level, you learn two languages of your choice. You also become proficient in your choice of two of the following skills: Arcana, History, Nature, or Religion.",
                            "Your proficiency bonus is doubled for any ability check you make that uses either of those skills.",
                            "",
                            "Source: Player's Handbook p. 59"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Divine Domain: Life Domain",
                        "text": [
                            "The Life domain focuses on the vibrant positive energy—one of the fundamental forces of the universe—that sustains all life. The gods of life promote vitality and health through healing the sick and wounded, caring for those in need, and driving away the forces of death and undeath. Almost any non-evil deity can claim influence over this domain, particularly agricultural deities (such as Chauntea, Arawai, and Demeter), sun gods (such as Lathander, Pelor, and Re-Horakhty), gods of healing or endurance (such as Ilmater, Mishakal, Apollo, and Diancecht), and gods of home and community (such as Hestia, Hathor, and Boldrei).",
                            "At each indicated cleric level, you add the listed spells to your spells prepared.",
                            "",
                            "Life Domain Spells",
                            "Cleric Level | Spells",
                            "1st | bless, cure wounds",
                            "3rd | lesser restoration, spiritual weapon",
                            "5th | beacon of hope, revivify",
                            "7th | death ward, guardian of faith",
                            "9th | mass cure wounds, raise dead",
                            "",
                            "Source: Player's Handbook p. 60"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Life Domain: Bonus Proficiency",
                        "text": [
                            "When you choose this domain at 1st level, you gain proficiency with heavy armor.",
                            "",
                            "Source: Player's Handbook p. 60"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Life Domain: Disciple of Life",
                        "text": [
                            "Also starting at 1st level, your healing spells are more effective. Whenever you use a spell of 1st level or higher to restore hit points to a creature, the creature regains additional hit points equal to 2 + the spell's level.",
                            "",
                            "Source: Player's Handbook p. 60"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Divine Domain: Light Domain",
                        "text": [
                            "Gods of light—including Helm, Lathander, Pholtus, Branchala, the Silver Flame, Belenus, Apollo, and Re-Horakhty—promote the ideals of rebirth and renewal, truth, vigilance, and beauty, often using the symbol of the sun. Some of these gods are portrayed as the sun itself or as a charioteer who guides the sun across the sky. Others are tireless sentinels whose eyes pierce every shadow and see through every deception. Some are deities of beauty and artistry, who teach that art is a vehicle for the soul's improvement. Clerics of a god of light are enlightened souls infused with radiance and the power of their gods' discerning vision, charged with chasing away lies and burning away darkness.",
                            "At each indicated cleric level, you add the listed spells to your spells prepared.",
                            "",
                            "Light Domain Spells",
                            "Cleric Level | Spells",
                            "1st | burning hands, faerie fire",
                            "3rd | flaming sphere, scorching ray",
                            "5th | daylight, fireball",
                            "7th | guardian of faith, wall of fire",
                            "9th | flame strike, scrying",
                            "",
                            "Source: Player's Handbook p. 60"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Light Domain: Bonus Cantrip",
                        "text": [
                            "When you choose this domain at 1st level, you gain the light cantrip if you don't already know it.",
                            "",
                            "Source: Player's Handbook p. 60"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Light Domain: Warding Flare",
                        "text": [
                            "Also at 1st level, you can interpose divine light between yourself and an attacking enemy. When you are attacked by a creature within 30 feet of you that you can see, you can use your reaction to impose disadvantage on the attack roll, causing light to flare before the attacker before it hits or misses. An attacker that can't be blinded is immune to this feature.",
                            "You can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest.",
                            "",
                            "Source: Player's Handbook p. 60"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Divine Domain: Nature Domain",
                        "text": [
                            "Gods of nature are as varied as the natural world itself, from inscrutable gods of the deep forests (such as Silvanus, Obad-Hai, Chislev, Balinor, and Pan) to friendly deities associated with particular springs and groves (such as Eldath). Druids revere nature as a whole and might serve one of these deities, practicing mysterious rites and reciting all-but-forgotten prayers in their own secret tongue. But many of these gods have clerics as well, champions who take a more active role in advancing the interests of a particular nature god. These clerics might hunt the evil monstrosities that despoil the woodlands, bless the harvest of the faithful, or wither the crops of those who anger their gods.",
                            "At each indicated cleric level, you add the listed spells to your spells prepared.",
                            "",
                            "Nature Domain Spells",
                            "Cleric Level | Spells",
                            "1st | animal friendship, speak with animals",
                            "3rd | barkskin, spike growth",
                            "5th | plant growth, wind wall",
                            "7th | dominate beast, grasping vine",
                            "9th | insect plague, tree stride",
                            "",
                            "Source: Player's Handbook p. 61"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Nature Domain: Acolyte of Nature",
                        "text": [
                            "At 1st level, you learn one druid cantrip of your choice. You also gain proficiency in one of the following skills of your choice: Animal Handling, Nature, or Survival.",
                            "",
                            "Source: Player's Handbook p. 61"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Nature Domain: Bonus Proficiency",
                        "text": [
                            "Also at 1st level, you gain proficiency with heavy armor.",
                            "",
                            "Source: Player's Handbook p. 61"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Divine Domain: Tempest Domain",
                        "text": [
                            "Gods whose portfolios include the Tempest domain—including Talos, Umberlee, Kord, Zeboim, the Devourer, Zeus, and Thor—govern storms, sea, and sky. They include gods of lightning and thunder, gods of earthquakes, some fire gods, and certain gods of violence, physical strength, and courage. In some pantheons, a god of this domain rules over other deities and is known for swift justice delivered by thunderbolts. In the pantheons of seafaring people, gods of this domain are ocean deities and the patrons of sailors. Tempest gods send their clerics to inspire fear in the common folk, either to keep those folk on the path of righteousness or to encourage them to offer sacrifices of propitiation to ward off divine wrath.",
                            "At each indicated cleric level, you add the listed spells to your spells prepared.",
                            "",
                            "Tempest Domain Spells",
                            "Cleric Level | Spells",
                            "1st | fog cloud, thunderwave",
                            "3rd | gust of wind, shatter",
                            "5th | call lightning, sleet storm",
                            "7th | control water, ice storm",
                            "9th | destructive wave, insect plague",
                            "",
                            "Source: Player's Handbook p. 62"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Tempest Domain: Bonus Proficiencies",
                        "text": [
                            "At 1st level, you gain proficiency with martial weapons and heavy armor.",
                            "",
                            "Source: Player's Handbook p. 62"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Tempest Domain: Wrath of the Storm",
                        "text": [
                            "Also at 1st level, you can thunderously rebuke attackers. When a creature within 5 feet of you that you can see hits you with an attack, you can use your reaction to cause the creature to make a Dexterity saving throw. The creature takes 2d8 lightning or thunder damage (your choice) on a failed saving throw, and half as much damage on a successful one.",
                            "You can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest.",
                            "",
                            "Source: Player's Handbook p. 62"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Divine Domain: Trickery Domain",
                        "text": [
                            "Gods of trickery—such as Tymora, Beshaba, Olidammara, the Traveler, Garl Glittergold, and Loki—are mischief-makers and instigators who stand as a constant challenge to the accepted order among both gods and mortals. They're patrons of thieves, scoundrels, gamblers, rebels, and liberators. Their clerics are a disruptive force in the world, puncturing pride, mocking tyrants, stealing from the rich, freeing captives, and flouting hollow traditions. They prefer subterfuge, pranks, deception, and theft rather than direct confrontation.",
                            "At each indicated cleric level, you add the listed spells to your spells prepared.",
                            "",
                            "Trickery Domain Spells",
                            "Cleric Level | Spells",
                            "1st | charm person, disguise self",
                            "3rd | mirror image, pass without trace",
                            "5th | blink, dispel magic",
                            "7th | dimension door, polymorph",
                            "9th | dominate person, modify memory",
                            "",
                            "Source: Player's Handbook p. 62"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Trickery Domain: Blessing of the Trickster",
                        "text": [
                            "Starting when you choose this domain at 1st level, you can use your action to touch a willing creature other than yourself to give it advantage on Dexterity (Stealth) checks. This blessing lasts for 1 hour or until you use this feature again.",
                            "",
                            "Source: Player's Handbook p. 62"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Divine Domain: War Domain",
                        "text": [
                            "War has many manifestations. It can make heroes of ordinary people. It can be desperate and horrific, with acts of cruelty and cowardice eclipsing instances of excellence and courage. In either case, the gods of war watch over warriors and reward them for their great deeds. The clerics of such gods excel in battle, inspiring others to fight the good fight or offering acts of violence as prayers. Gods of war include champions of honor and chivalry (such as Torm, Heironeous, and Kiri-Jolith) as well as gods of destruction and pillage (such as Erythnul, the Fury, Gruumsh, and Ares) and gods of conquest and domination (such as Bane, Hextor, and Maglubiyet). Other war gods (such as Tempus, Nike, and Nuada) take a more neutral stance, promoting war in all its manifestations and supporting warriors in any circumstance.",
                            "At each indicated cleric level, add the listed spells to your spells prepared.",
                            "",
                            "War Domain Spells",
                            "Cleric Level | Spells",
                            "1st | divine favor, shield of faith",
                            "3rd | magic weapon, spiritual weapon",
                            "5th | crusader's mantle, spirit guardians",
                            "7th | freedom of movement, stoneskin",
                            "9th | flame strike, hold monster",
                            "",
                            "Source: Player's Handbook p. 63"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "War Domain: Bonus Proficiencies",
                        "text": [
                            "At 1st level, you gain proficiency with martial weapons and heavy armor.",
                            "",
                            "Source: Player's Handbook p. 63"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "War Domain: War Priest",
                        "text": [
                            "From 1st level, your god delivers bolts of inspiration to you while you are engaged in battle. When you use the Attack action, you can make one weapon attack as a bonus action. You can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest.",
                            "",
                            "Source: Player's Handbook p. 63"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "slots": "3, 3",
                    "_level": "2"
                },
                {
                    "feature": {
                        "name": "Channel Divinity (1/rest)",
                        "text": [
                            "At 2nd level, you gain the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description.",
                            "When you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again.",
                            "Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC.",
                            "Beginning at 6th level, you can use your Channel Divinity twice between rests, and beginning at 18th level, you can use it three times between rests. When you finish a short or long rest, you regain your expended uses.",
                            "",
                            "Source: Player's Handbook p. 36"
                        ]
                    },
                    "_level": "2"
                },
                {
                    "feature": {
                        "name": "Divine Domain feature",
                        "text": [
                            "At 2nd level, you gain a feature from your Divine Domain.",
                            "",
                            "Source: Player's Handbook p. 36"
                        ]
                    },
                    "_level": "2"
                },
                {
                    "feature": {
                        "name": "Knowledge Domain: Channel Divinity: Knowledge of the Ages",
                        "text": [
                            "Starting at 2nd level, you can use your Channel Divinity to tap into a divine well of knowledge. As an action, you choose one skill or tool. For 10 minutes, you have proficiency with the chosen skill or tool.",
                            "",
                            "Source: Player's Handbook p. 59"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "2"
                },
                {
                    "feature": {
                        "name": "Life Domain: Channel Divinity: Preserve Life",
                        "text": [
                            "Starting at 2nd level, you can use your Channel Divinity to heal the badly injured.",
                            "As an action, you present your holy symbol and evoke healing energy that can restore a number of hit points equal to five times your cleric level. Choose any creatures within 30 feet of you, and divide those hit points among them. This feature can restore a creature to no more than half of its hit point maximum. You can't use this feature on an undead or a construct.",
                            "",
                            "Source: Player's Handbook p. 60"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "2"
                },
                {
                    "feature": {
                        "name": "Light Domain: Channel Divinity: Radiance of the Dawn",
                        "text": [
                            "Starting at 2nd level, you can use your Channel Divinity to harness sunlight, banishing darkness and dealing radiant damage to your foes.",
                            "As an action, you present your holy symbol, and any magical darkness within 30 feet of you is dispelled. Additionally, each hostile creature within 30 feet of you must make a Constitution saving throw. A creature takes radiant damage equal to 2d10 + your cleric level on a failed saving throw, and half as much damage on a successful one. A creature that has total cover from you is not affected.",
                            "",
                            "Source: Player's Handbook p. 60"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "2"
                },
                {
                    "feature": {
                        "name": "Nature Domain: Channel Divinity: Charm Animals and Plants",
                        "text": [
                            "Starting at 2nd level, you can use your Channel Divinity to charm animals and plants.",
                            "As an action, you present your holy symbol and invoke the name of your deity. Each beast or plant creature that can see you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is charmed by you for 1 minute or until it takes damage. While it is charmed by you, it is friendly to you and other creatures you designate.",
                            "",
                            "Source: Player's Handbook p. 61"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "2"
                },
                {
                    "feature": {
                        "name": "Tempest Domain: Channel Divinity: Destructive Wrath",
                        "text": [
                            "Starting at 2nd level, you can use your Channel Divinity to wield the power of the storm with unchecked ferocity.",
                            "When you roll lightning or thunder damage, you can use your Channel Divinity to deal maximum damage, instead of rolling.",
                            "",
                            "Source: Player's Handbook p. 62"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "2"
                },
                {
                    "feature": {
                        "name": "Trickery Domain: Channel Divinity: Invoke Duplicity",
                        "text": [
                            "Starting at 2nd level, you can use your Channel Divinity to create an illusory duplicate of yourself.",
                            "As an action, you create a perfect illusion of yourself that lasts for 1 minute, or until you lose your concentration (as if you were concentrating on a spell). The illusion appears in an unoccupied space that you can see within 30 feet of you. As a bonus action on your turn, you can move the illusion up to 30 feet to a space you can see, but it must remain within 120 feet of you.",
                            "For the duration, you can cast spells as though you were in the illusion's space, but you must use your own senses. Additionally, when both you and your illusion are within 5 feet of a creature that can see the illusion, you have advantage on attack rolls against that creature, given how distracting the illusion is to the target.",
                            "",
                            "Source: Player's Handbook p. 62"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "2"
                },
                {
                    "feature": {
                        "name": "War Domain: Channel Divinity: Guided Strike",
                        "text": [
                            "Starting at 2nd level, you can use your Channel Divinity to strike with supernatural accuracy. When you make an attack roll, you can use your Channel Divinity to gain a +10 bonus to the roll. You make this choice after you see the roll, but before the DM says whether the attack hits or misses.",
                            "",
                            "Source: Player's Handbook p. 63"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "2"
                },
                {
                    "slots": "3, 4, 2",
                    "_level": "3"
                },
                {
                    "slots": "4, 4, 3",
                    "_level": "4"
                },
                {
                    "feature": {
                        "name": "Ability Score Improvement",
                        "text": [
                            "When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
                            "If your DM allows the use of feats, you may instead take a feat.",
                            "",
                            "Source: Player's Handbook p. 36"
                        ]
                    },
                    "_level": "4",
                    "_scoreImprovement": "YES"
                },
                {
                    "slots": "4, 4, 3, 2",
                    "_level": "5"
                },
                {
                    "feature": {
                        "name": "Destroy Undead (CR 1/2)",
                        "text": [
                            "Starting at 5th level, when an undead of CR 1/2 or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed.",
                            "",
                            "Source: Player's Handbook p. 36"
                        ]
                    },
                    "_level": "5"
                },
                {
                    "slots": "4, 4, 3, 3",
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Channel Divinity (2/rest)",
                        "text": [
                            "Beginning at 6th level, you can use your Channel Divinity twice between rests.",
                            "",
                            "Source: Player's Handbook p. 36"
                        ]
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Divine Domain feature",
                        "text": [
                            "At 6th level, you gain a feature from your Divine Domain.",
                            "",
                            "Source: Player's Handbook p. 36"
                        ]
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Knowledge Domain: Channel Divinity: Read Thoughts",
                        "text": [
                            "At 6th level, you can use your Channel Divinity to read a creature's thoughts. You can then use your access to the creature's mind to command it.",
                            "As an action, choose one creature that you can see within 60 feet of you. That creature must make a Wisdom saving throw. If the creature succeeds on the saving throw, you can't use this feature on it again until you finish a long rest.",
                            "If the creature fails its save, you can read its surface thoughts (those foremost in its mind, reflecting its current emotions and what it is actively thinking about) when it is within 60 feet of you. This effect lasts for 1 minute.",
                            "During that time, you can use your action to end this effect and cast the suggestion spell on the creature without expending a spell slot. The target automatically fails its saving throw against the spell.",
                            "",
                            "Source: Player's Handbook p. 59"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Life Domain: Blessed Healer",
                        "text": [
                            "Beginning at 6th level, the healing spells you cast on others heal you as well. When you cast a spell of 1st level or higher that restores hit points to a creature other than you, you regain hit points equal to 2 + the spell's level.",
                            "",
                            "Source: Player's Handbook p. 60"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Light Domain: Improved Flare",
                        "text": [
                            "Starting at 6th level, you can also use your Warding Flare feature when a creature that you can see within 30 feet of you attacks a creature other than you.",
                            "",
                            "Source: Player's Handbook p. 60"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Nature Domain: Dampen Elements",
                        "text": [
                            "Starting at 6th level, when you or a creature within 30 feet of you takes acid, cold, fire, lightning, or thunder damage, you can use your reaction to grant resistance to the creature against that instance of the damage.",
                            "",
                            "Source: Player's Handbook p. 61"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Tempest Domain: Thunderbolt Strike",
                        "text": [
                            "At 6th level, when you deal lightning damage to a Large or smaller creature, you can also push it up to 10 feet away from you.",
                            "",
                            "Source: Player's Handbook p. 62"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Trickery Domain: Channel Divinity: Cloak of Shadows",
                        "text": [
                            "Starting at 6th level, you can use your Channel Divinity to vanish.",
                            "As an action, you become invisible until the end of your next turn. You become visible if you attack or cast a spell.",
                            "",
                            "Source: Player's Handbook p. 62"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "War Domain: Channel Divinity: War God's Blessing",
                        "text": [
                            "At 6th level, when a creature within 30 feet of you makes an attack roll, you can use your reaction to grant that creature a +10 bonus to the roll, using your Channel Divinity. You make this choice after you see the roll, but before the DM says whether the attack hits or misses.",
                            "",
                            "Source: Player's Handbook p. 63"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "6"
                },
                {
                    "slots": "4, 4, 3, 3, 1",
                    "_level": "7"
                },
                {
                    "slots": "4, 4, 3, 3, 2",
                    "_level": "8"
                },
                {
                    "feature": {
                        "name": "Ability Score Improvement",
                        "text": [
                            "When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
                            "If your DM allows the use of feats, you may instead take a feat.",
                            "",
                            "Source: Player's Handbook p. 36"
                        ]
                    },
                    "_level": "8",
                    "_scoreImprovement": "YES"
                },
                {
                    "feature": {
                        "name": "Destroy Undead (CR 1)",
                        "text": [
                            "Starting at 8th level, when an undead of CR 1 or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed.",
                            "",
                            "Source: Player's Handbook p. 36"
                        ]
                    },
                    "_level": "8"
                },
                {
                    "feature": {
                        "name": "Divine Domain feature",
                        "text": [
                            "At 8th level, you gain a feature from your Divine Domain.",
                            "",
                            "Source: Player's Handbook p. 36"
                        ]
                    },
                    "_level": "8"
                },
                {
                    "feature": {
                        "name": "Knowledge Domain: Potent Spellcasting",
                        "text": [
                            "Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip.",
                            "",
                            "Source: Player's Handbook p. 59"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "8"
                },
                {
                    "feature": {
                        "name": "Life Domain: Divine Strike",
                        "text": [
                            "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 radiant damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
                            "",
                            "Source: Player's Handbook p. 60"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "8"
                },
                {
                    "feature": {
                        "name": "Light Domain: Potent Spellcasting",
                        "text": [
                            "Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip.",
                            "",
                            "Source: Player's Handbook p. 60"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "8"
                },
                {
                    "feature": {
                        "name": "Nature Domain: Divine Strike",
                        "text": [
                            "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 cold, fire, or lightning damage (your choice) to the target. When you reach 14th level, the extra damage increases to 2d8.",
                            "",
                            "Source: Player's Handbook p. 61"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "8"
                },
                {
                    "feature": {
                        "name": "Tempest Domain: Divine Strike",
                        "text": [
                            "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 thunder damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
                            "",
                            "Source: Player's Handbook p. 62"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "8"
                },
                {
                    "feature": {
                        "name": "Trickery Domain: Divine Strike",
                        "text": [
                            "At 8th level, you gain the ability to infuse your weapon strikes with poison—a gift from your deity. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 poison damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
                            "",
                            "Source: Player's Handbook p. 62"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "8"
                },
                {
                    "feature": {
                        "name": "War Domain: Divine Strike",
                        "text": [
                            "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 damage of the same type dealt by the weapon to the target. When you reach 14th level, the extra damage increases to 2d8.",
                            "",
                            "Source: Player's Handbook p. 63"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "8"
                },
                {
                    "slots": "4, 4, 3, 3, 3, 1",
                    "_level": "9"
                },
                {
                    "slots": "5, 4, 3, 3, 3, 2",
                    "_level": "10"
                },
                {
                    "feature": {
                        "name": "Divine Intervention",
                        "text": [
                            "Beginning at 10th level, you can call on your deity to intervene on your behalf when your need is great.",
                            "Imploring your deity's aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. The DM chooses the nature of the intervention; the effect of any cleric spell or cleric domain spell would be appropriate. If your deity intervenes, you can't use this feature again for 7 days. Otherwise, you can use it again after you finish a long rest.",
                            "At 20th level, your call for intervention succeeds automatically, no roll required.",
                            "",
                            "Source: Player's Handbook p. 36"
                        ]
                    },
                    "_level": "10"
                },
                {
                    "slots": "5, 4, 3, 3, 3, 2, 1",
                    "_level": "11"
                },
                {
                    "feature": {
                        "name": "Destroy Undead (CR 2)",
                        "text": [
                            "Starting at 11th level, when an undead of CR 2 or lower or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed.",
                            "",
                            "Source: Player's Handbook p. 36"
                        ]
                    },
                    "_level": "11"
                },
                {
                    "slots": "5, 4, 3, 3, 3, 2, 1",
                    "_level": "12"
                },
                {
                    "feature": {
                        "name": "Ability Score Improvement",
                        "text": [
                            "When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
                            "If your DM allows the use of feats, you may instead take a feat.",
                            "",
                            "Source: Player's Handbook p. 36"
                        ]
                    },
                    "_level": "12",
                    "_scoreImprovement": "YES"
                },
                {
                    "slots": "5, 4, 3, 3, 3, 2, 1, 1",
                    "_level": "13"
                },
                {
                    "slots": "5, 4, 3, 3, 3, 2, 1, 1",
                    "_level": "14"
                },
                {
                    "feature": {
                        "name": "Destroy Undead (CR 3)",
                        "text": [
                            "Starting at 14th level, when an undead of CR 3 or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed.",
                            "",
                            "Source: Player's Handbook p. 36"
                        ]
                    },
                    "_level": "14"
                },
                {
                    "slots": "5, 4, 3, 3, 3, 2, 1, 1, 1",
                    "_level": "15"
                },
                {
                    "slots": "5, 4, 3, 3, 3, 2, 1, 1, 1",
                    "_level": "16"
                },
                {
                    "feature": {
                        "name": "Ability Score Improvement",
                        "text": [
                            "When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
                            "If your DM allows the use of feats, you may instead take a feat.",
                            "",
                            "Source: Player's Handbook p. 36"
                        ]
                    },
                    "_level": "16",
                    "_scoreImprovement": "YES"
                },
                {
                    "slots": "5, 4, 3, 3, 3, 2, 1, 1, 1, 1",
                    "_level": "17"
                },
                {
                    "feature": {
                        "name": "Destroy Undead (CR 4)",
                        "text": [
                            "Starting at 17th level, when an undead of CR 4 or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed.",
                            "",
                            "Source: Player's Handbook p. 36"
                        ]
                    },
                    "_level": "17"
                },
                {
                    "feature": {
                        "name": "Divine Domain feature",
                        "text": [
                            "At 17th level, you gain a feature from your Divine Domain.",
                            "",
                            "Source: Player's Handbook p. 36"
                        ]
                    },
                    "_level": "17"
                },
                {
                    "feature": {
                        "name": [
                            "Knowledge Domain: Visions of the Past",
                            "Knowledge Domain: Object Reading",
                            "Knowledge Domain: Area Reading"
                        ],
                        "text": [
                            "Starting at 17th level, you can call up visions of the past that relate to an object you hold or your immediate surroundings. You spend at least 1 minute in meditation and prayer, then receive dreamlike, shadowy glimpses of recent events. You can meditate in this way for a number of minutes equal to your Wisdom score and must maintain concentration during that time, as if you were casting a spell.",
                            "Once you use this feature, you can't use it again until you finish a short or long rest.",
                            "Holding an object as you meditate, you can see visions of the object's previous owner. After meditating for 1 minute, you learn how the owner acquired and lost the object, as well as the most recent significant event involving the object and that owner. If the object was owned by another creature in the recent past (within a number of days equal to your Wisdom score), you can spend 1 additional minute for each owner to learn the same information about that creature.",
                            "As you meditate, you see visions of recent events in your immediate vicinity (a room, street, tunnel, clearing, or the like, up to a 50-foot cube), going back a number of days equal to your Wisdom score. For each minute you meditate, you learn about one significant event, beginning with the most recent. Significant events typically involve powerful emotions, such as battles and betrayals, marriages and murders, births and funerals. However, they might also include more mundane events that are nevertheless important in your current situation.",
                            "",
                            "Source: Player's Handbook p. 59"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "17"
                },
                {
                    "feature": {
                        "name": "Life Domain: Supreme Healing",
                        "text": [
                            "Starting at 17th level, when you would normally roll one or more dice to restore hit points with a spell, you instead use the highest number possible for each die. For example, instead of restoring 2d6 hit points to a creature, you restore 12.",
                            "",
                            "Source: Player's Handbook p. 60"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "17"
                },
                {
                    "feature": {
                        "name": "Light Domain: Corona of Light",
                        "text": [
                            "Starting at 17th level, you can use your action to activate an aura of sunlight that lasts for 1 minute or until you dismiss it using another action. You emit bright light in a 60-foot radius and dim light 30 feet beyond that. Your enemies in the bright light have disadvantage on saving throws against any spell that deals fire or radiant damage.",
                            "",
                            "Source: Player's Handbook p. 60"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "17"
                },
                {
                    "feature": {
                        "name": "Nature Domain: Master of Nature",
                        "text": [
                            "At 17th level, you gain the ability to command animals and plant creatures. While creatures are charmed by your Charm Animals and Plants feature, you can take a bonus action on your turn to verbally command what each of those creatures will do on its next turn.",
                            "",
                            "Source: Player's Handbook p. 61"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "17"
                },
                {
                    "feature": {
                        "name": "Tempest Domain: Stormborn",
                        "text": [
                            "At 17th level, you have a flying speed equal to your current walking speed whenever you are not underground or indoors.",
                            "",
                            "Source: Player's Handbook p. 62"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "17"
                },
                {
                    "feature": {
                        "name": "Trickery Domain: Improved Duplicity",
                        "text": [
                            "At 17th level, you can create up to four duplicates of yourself, instead of one, when you use Invoke Duplicity. As a bonus action on your turn, you can move any number of them up to 30 feet, to a maximum range of 120 feet.",
                            "",
                            "Source: Player's Handbook p. 62"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "17"
                },
                {
                    "feature": {
                        "name": "War Domain: Avatar of Battle",
                        "text": [
                            "At 17th level, you gain resistance to bludgeoning, piercing, and slashing damage from nonmagical weapons.",
                            "",
                            "Source: Player's Handbook p. 63"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "17"
                },
                {
                    "slots": "5, 4, 3, 3, 3, 3, 1, 1, 1, 1",
                    "_level": "18"
                },
                {
                    "feature": {
                        "name": "Channel Divinity (3/rest)",
                        "text": [
                            "Beginning at 18th level, you can use your Channel Divinity three times between rests.",
                            "",
                            "Source: Player's Handbook p. 36"
                        ]
                    },
                    "_level": "18"
                },
                {
                    "slots": "5, 4, 3, 3, 3, 3, 2, 1, 1, 1",
                    "_level": "19"
                },
                {
                    "feature": {
                        "name": "Ability Score Improvement",
                        "text": [
                            "When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
                            "If your DM allows the use of feats, you may instead take a feat.",
                            "",
                            "Source: Player's Handbook p. 36"
                        ]
                    },
                    "_level": "19",
                    "_scoreImprovement": "YES"
                },
                {
                    "slots": "5, 4, 3, 3, 3, 3, 2, 2, 1, 1",
                    "_level": "20"
                },
                {
                    "feature": {
                        "name": "Divine Intervention Improvement",
                        "text": [
                            "At 20th level, your call for intervention succeeds automatically, no roll required.",
                            "",
                            "Source: Player's Handbook p. 36"
                        ]
                    },
                    "_level": "20"
                }
            ],
            "armor": "light, medium, shields",
            "weapons": "simple",
            "tools": "none",
            "wealth": "5d4x10"
        },
        "_version": "5",
        "_auto_indent": "NO"
    }
}
