{
    "compendium": {
        "class": {
            "name": "Barbarian",
            "hd": "12",
            "proficiency": "Strength, Constitution, Animal Handling, Athletics, Intimidation, Nature, Perception, Survival",
            "numSkills": "2",
            "autolevel": [
                {
                    "feature": {
                        "name": "Starting Barbarian",
                        "text": [
                            "As a 1st-level Barbarian, you begin play with 12+your Constitution modifier hit points.",
                            "",
                            "You are proficient with the following items, in addition to any proficiencies provided by your race or background.",
                            "• Armor: light, medium, shields",
                            "• Weapons: simple, martial",
                            "• Tools: none",
                            "• Skills: Choose 2 from Animal Handling, Athletics, Intimidation, Nature, Perception, Survival",
                            "",
                            "You begin play with the following equipment, in addition to any equipment provided by your background.",
                            "• (a) a greataxe or (b) any martial melee weapon",
                            "• (a) two handaxe or (b) any simple weapon",
                            "• An explorer's pack, and four javelin",
                            "",
                            "Alternatively, you may start with 2d4 x 10 gp and choose your own equipment.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Multiclass Barbarian",
                        "text": [
                            "To multiclass as a Barbarian, you must meet the following prerequisites:",
                            "• Strength 13",
                            "",
                            "You gain the following proficiencies:",
                            "• Armor: shields",
                            "",
                            "• Tools: none",
                            "",
                            "Source: Player's Handbook p. 46"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Rage",
                        "text": [
                            "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action.",
                            "While raging, you gain the following benefits if you aren't wearing heavy armor:",
                            "• You have advantage on Strength checks and Strength saving throws.",
                            "• When you make a melee weapon attack using Strength, you gain a +2 bonus to the damage roll. This bonus increases as you level.",
                            "• You have resistance to bludgeoning, piercing, and slashing damage.",
                            "If you are able to cast spells, you can't cast them or concentrate on them while raging.",
                            "Your rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven't attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action.",
                            "Once you have raged the maximum number of times for your barbarian level, you must finish a long rest before you can rage again. You may rage 2 times at 1st level, 3 at 3rd, 4 at 6th, 5 at 12th, and 6 at 17th.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Unarmored Defense",
                        "text": [
                            "While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Danger Sense",
                        "text": [
                            "At 2nd level, you gain an uncanny sense of when things nearby aren't as they should be, giving you an edge when you dodge away from danger. You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can't be blinded, deafened, or incapacitated.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "2"
                },
                {
                    "feature": {
                        "name": "Reckless Attack",
                        "text": [
                            "Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "2"
                },
                {
                    "feature": {
                        "name": "Primal Path",
                        "text": [
                            "At 3rd level, you choose a path that shapes the nature of your rage from the list of available paths. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Primal Path: Path of the Berserker",
                        "text": [
                            "For some barbarians, rage is a means to an end—that end being violence. The Path of the Berserker is a path of untrammeled fury, slick with blood. As you enter the berserker's rage, you thrill in the chaos of battle, heedless of your own health or well-being.",
                            "",
                            "Source: Player's Handbook p. 49"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Path of the Berserker: Frenzy",
                        "text": [
                            "Starting when you choose this path at 3rd level, you can go into a frenzy when you rage. If you do so, for the duration of your rage you can make a single melee weapon attack as a bonus action on each of your turns after this one. When your rage ends, you suffer one level of exhaustion.",
                            "",
                            "Source: Player's Handbook p. 49"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Path of the Totem Warrior: Bear",
                        "text": [
                            "While raging, you have resistance to all damage except psychic damage. The spirit of the bear makes you tough enough to stand up to any punishment.",
                            "",
                            "Source: Player's Handbook p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Path of the Totem Warrior: Eagle",
                        "text": [
                            "While you're raging and aren't wearing heavy armor, other creatures have disadvantage on opportunity attack rolls against you, and you can use the Dash action as a bonus action on your turn. The spirit of the eagle makes you into a predator who can weave through the fray with ease.",
                            "",
                            "Source: Player's Handbook p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Primal Path: Path of the Totem Warrior",
                        "text": [
                            "The Path of the Totem Warrior is a spiritual journey, as the barbarian accepts a spirit animal as guide, protector, and inspiration. In battle, your totem spirit fills you with supernatural might, adding magical fuel to your barbarian rage.",
                            "Most barbarian tribes consider a totem animal to be kin to a particular clan. In such cases, it is unusual for an individual to have more than one totem animal spirit, though exceptions exist.",
                            "",
                            "Source: Player's Handbook p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Path of the Totem Warrior: Wolf",
                        "text": [
                            "While you're raging, your friends have advantage on melee attack rolls against any creature within 5 feet of you that is hostile to you. The spirit of the wolf makes you a leader of hunters.",
                            "",
                            "Source: Player's Handbook p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Path of the Totem Warrior: Spirit Seeker",
                        "text": [
                            "Yours is a path that seeks attunement with the natural world, giving you a kinship with beasts. At 3rd level when you adopt this path, you gain the ability to cast the beast sense and speak with animals spells, but only as rituals, as described in chapter 10.",
                            "",
                            "Source: Player's Handbook p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Path of the Totem Warrior: Totem Spirit",
                        "text": [
                            "At 3rd level, when you adopt this path, you choose a totem spirit and gain its feature. You must make or acquire a physical totem object—an amulet or similar adornment—that incorporates fur or feathers, claws, teeth, or bones of the totem animal. At your option, you also gain minor physical attributes that are reminiscent of your totem spirit. For example, if you have a bear totem spirit, you might be unusually hairy and thick-skinned, or if your totem is the eagle, your eyes turn bright yellow.",
                            "Your totem animal might be an animal related to those listed here but more appropriate to your homeland. For example, you could choose a hawk or vulture in place of an eagle.",
                            "",
                            "Source: Player's Handbook p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Path of the Totem Warrior: Elk",
                        "text": [
                            "While you're raging and aren't wearing heavy armor, your walking speed increases by 15 feet. The spirit of the elk makes you extraordinarily swift.",
                            "",
                            "Source: Player's Handbook p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Path of the Totem Warrior: Tiger",
                        "text": [
                            "While raging, you can add 10 feet to your long jump distance and 3 feet to your high jump distance. The spirit of the tiger empowers your leaps.",
                            "",
                            "Source: Player's Handbook p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Ability Score Improvement",
                        "text": [
                            "When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
                            "If your DM allows the use of feats, you may instead take a feat.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "4",
                    "_scoreImprovement": "YES"
                },
                {
                    "feature": {
                        "name": "Extra Attack",
                        "text": [
                            "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "5"
                },
                {
                    "feature": {
                        "name": "Fast Movement",
                        "text": [
                            "Starting at 5th level, your speed increases by 10 feet while you aren't wearing heavy armor.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "5"
                },
                {
                    "feature": {
                        "name": "Path Feature",
                        "text": [
                            "At 6th level, you gain a feature from your Primal Path.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Path of the Berserker: Mindless Rage",
                        "text": [
                            "Beginning at 6th level, you can't be charmed or frightened while raging. If you are charmed or frightened when you enter your rage, the effect is suspended for the duration of the rage.",
                            "",
                            "Source: Player's Handbook p. 49"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Path of the Totem Warrior: Bear",
                        "text": [
                            "You gain the might of a bear. Your carrying capacity (including maximum load and maximum lift) is doubled, and you have advantage on Strength checks made to push, pull, lift, or break objects.",
                            "",
                            "Source: Player's Handbook p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Path of the Totem Warrior: Eagle",
                        "text": [
                            "You gain the eyesight of an eagle. You can see up to 1 mile away with no difficulty, able to discern even fine details as though looking at something no more than 100 feet away from you. Additionally, dim light doesn't impose disadvantage on your Wisdom (Perception) checks.",
                            "",
                            "Source: Player's Handbook p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Path of the Totem Warrior: Wolf",
                        "text": [
                            "You gain the hunting sensibilities of a wolf. You can track other creatures while traveling at a fast pace, and you can move stealthily while traveling at a normal pace.",
                            "",
                            "Source: Player's Handbook p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Path of the Totem Warrior: Aspect of the Beast",
                        "text": [
                            "At 6th level, you gain a magical benefit based on the totem animal of your choice. You can choose the same animal you selected at 3rd level or a different one.",
                            "",
                            "Source: Player's Handbook p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Path of the Totem Warrior: Elk",
                        "text": [
                            "Whether mounted or on foot, your travel pace is doubled, as is the travel pace of up to ten companions while they're within 60 feet of you and you're not incapacitated. The elk spirit helps you roam far and fast.",
                            "",
                            "Source: Player's Handbook p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Path of the Totem Warrior: Tiger",
                        "text": [
                            "You gain proficiency in two skills from the following list: Athletics, Acrobatics, Stealth, and Survival. The cat spirit hones your survival instincts.",
                            "",
                            "Source: Player's Handbook p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Feral Instinct",
                        "text": [
                            "By 7th level, your instincts are so honed that you have advantage on initiative rolls.",
                            "Additionally, if you are surprised at the beginning of combat and aren't incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "7"
                },
                {
                    "feature": {
                        "name": "Ability Score Improvement",
                        "text": [
                            "When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
                            "If your DM uses the optional Feats, you can instead take a feat.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "8",
                    "_scoreImprovement": "YES"
                },
                {
                    "feature": {
                        "name": "Brutal Critical (1 die)",
                        "text": [
                            "Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack.",
                            "This increases to two additional dice at 13th level and three additional dice at 17th level.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "9"
                },
                {
                    "feature": {
                        "name": "Path feature",
                        "text": [
                            "At 10th level, you gain a feature from your Primal Path.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "10"
                },
                {
                    "feature": {
                        "name": "Path of the Berserker: Intimidating Presence",
                        "text": [
                            "Beginning at 10th level, you can use your action to frighten someone with your menacing presence. When you do so, choose one creature that you can see within 30 feet of you. If the creature can see or hear you, it must succeed on a Wisdom saving throw (DC equal to 8 + your proficiency bonus + your Charisma modifier) or be frightened of you until the end of your next turn. On subsequent turns, you can use your action to extend the duration of this effect on the frightened creature until the end of your next turn. This effect ends if the creature ends its turn out of line of sight or more than 60 feet away from you.",
                            "If the creature succeeds on its saving throw, you can't use this feature on that creature again for 24 hours.",
                            "",
                            "Source: Player's Handbook p. 49"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "10"
                },
                {
                    "feature": {
                        "name": "Path of the Totem Warrior: Spirit Walker",
                        "text": [
                            "At 10th level, you can cast the commune with nature spell, but only as a ritual. When you do so, a spiritual version of one of the animals you chose for Totem Spirit or Aspect of the Beast appears to you to convey the information you seek.",
                            "",
                            "Source: Player's Handbook p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "10"
                },
                {
                    "feature": {
                        "name": "Relentless Rage",
                        "text": [
                            "Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you're raging and don't die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead.",
                            "Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "11"
                },
                {
                    "feature": {
                        "name": "Ability Score Improvement",
                        "text": [
                            "When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
                            "If your DM uses the optional Feats, you can instead take a feat.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "12",
                    "_scoreImprovement": "YES"
                },
                {
                    "feature": {
                        "name": "Brutal Critical (2 dice)",
                        "text": [
                            "At 13th level, you can roll two additional weapon damage dice when determining the extra damage for a critical hit with a melee attack.",
                            "This increases to three additional dice at 17th level.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "13"
                },
                {
                    "feature": {
                        "name": "Path feature",
                        "text": [
                            "At 14th level, you gain a feature from your Primal Path.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "14"
                },
                {
                    "feature": {
                        "name": "Path of the Berserker: Retaliation",
                        "text": [
                            "Starting at 14th level, when you take damage from a creature that is within 5 feet of you, you can use your reaction to make a melee weapon attack against that creature.",
                            "",
                            "Source: Player's Handbook p. 49"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "14"
                },
                {
                    "feature": {
                        "name": "Path of the Totem Warrior: Bear",
                        "text": [
                            "While you're raging, any creature within 5 feet of you that's hostile to you has disadvantage on attack rolls against targets other than you or another character with this feature. An enemy is immune to this effect if it can't see or hear you or if it can't be frightened.",
                            "",
                            "Source: Player's Handbook p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "14"
                },
                {
                    "feature": {
                        "name": "Path of the Totem Warrior: Eagle",
                        "text": [
                            "While raging, you have a flying speed equal to your current walking speed. This benefit works only in short bursts; you fall if you end your turn in the air and nothing else is holding you aloft.",
                            "",
                            "Source: Player's Handbook p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "14"
                },
                {
                    "feature": {
                        "name": "Path of the Totem Warrior: Wolf",
                        "text": [
                            "While you're raging, you can use a bonus action on your turn to knock a Large or smaller creature prone when you hit it with melee weapon attack.",
                            "",
                            "Source: Player's Handbook p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "14"
                },
                {
                    "feature": {
                        "name": "Path of the Totem Warrior: Totemic Attunement",
                        "text": [
                            "At 14th level, you gain a magical benefit based on a totem animal of your choice. You can choose the same animal you selected previously or a different one.",
                            "",
                            "Source: Player's Handbook p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "14"
                },
                {
                    "feature": {
                        "name": "Path of the Totem Warrior: Elk",
                        "text": [
                            "While raging, you can use a bonus action during your move to pass through the space of a Large or smaller creature. That creature must succeed on a Strength saving throw (DC 8 + your Strength bonus + your proficiency bonus) or be knocked prone and take bludgeoning damage equal to 1d12 + your Strength modifier.",
                            "",
                            "Source: Player's Handbook p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "14"
                },
                {
                    "feature": {
                        "name": "Path of the Totem Warrior: Tiger",
                        "text": [
                            "While you're raging, if you move at least 20 feet in a straight line toward a Large or smaller target right before making a melee weapon attack against it, you can use a bonus action to make an additional melee weapon attack against it.",
                            "",
                            "Source: Player's Handbook p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "14"
                },
                {
                    "feature": {
                        "name": "Persistent Rage",
                        "text": [
                            "Beginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "15"
                },
                {
                    "feature": {
                        "name": "Ability Score Improvement",
                        "text": [
                            "When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
                            "If your DM uses the optional Feats, you can instead take a feat.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "16",
                    "_scoreImprovement": "YES"
                },
                {
                    "feature": {
                        "name": "Brutal Critical (3 dice)",
                        "text": [
                            "At 17th level, you can roll three additional weapon damage dice when determining the extra damage for a critical hit with a melee attack.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "17"
                },
                {
                    "feature": {
                        "name": "Indomitable Might",
                        "text": [
                            "Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "18"
                },
                {
                    "feature": {
                        "name": "Ability Score Improvement",
                        "text": [
                            "When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
                            "If your DM uses the optional Feats, you can instead take a feat.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "19",
                    "_scoreImprovement": "YES"
                },
                {
                    "feature": {
                        "name": "Primal Champion",
                        "text": [
                            "At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24.",
                            "",
                            "Source: Player's Handbook p. 46"
                        ]
                    },
                    "_level": "20"
                }
            ],
            "armor": "light, medium, shields",
            "weapons": "simple, martial",
            "tools": "none",
            "wealth": "2d4x10"
        },
        "_version": "5",
        "_auto_indent": "NO"
    }
}
