{
    "compendium": {
        "class": {
            "name": "Monk",
            "hd": "8",
            "proficiency": "Strength, Dexterity, Acrobatics, Athletics, History, Insight, Religion, Stealth",
            "numSkills": "2",
            "autolevel": [
                {
                    "feature": {
                        "name": "Starting Monk",
                        "text": [
                            "As a 1st-level Monk, you begin play with 8+your Constitution modifier hit points.",
                            "",
                            "You are proficient with the following items, in addition to any proficiencies provided by your race or background.",
                            "• Armor: none",
                            "• Weapons: simple, shortswords",
                            "• Tools: any one type of artisan's tools or any one musical instrument of your choice",
                            "• Skills: Choose 2 from Acrobatics, Athletics, History, Insight, Religion, Stealth",
                            "",
                            "You begin play with the following equipment, in addition to any equipment provided by your background.",
                            "• (a) a shortsword or (b) any simple weapon",
                            "• (a) a dungeoneer's pack or (b) an explorer's pack",
                            "• 10 dart",
                            "",
                            "Alternatively, you may start with 5d4 gp and choose your own equipment.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Multiclass Monk",
                        "text": [
                            "To multiclass as a Monk, you must meet the following prerequisites:",
                            "• Wisdom 13",
                            "",
                            "You gain the following proficiencies:",
                            "• Armor: none",
                            "",
                            "• Tools: none",
                            "",
                            "Source: Player's Handbook p. 76"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Unarmored Defense",
                        "text": [
                            "Beginning at 1st level, while you are wearing no armor and not wielding a shield, your AC equals 10 + your Dexterity modifier + your Wisdom modifier.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Martial Arts",
                        "text": [
                            "Your practice of martial arts gives you mastery of combat styles that use unarmed strikes and monk weapons, which are shortswords and any simple melee weapons that don't have the two-handed or heavy property.",
                            "You gain the following benefits while you are unarmed or wielding only monk weapons and you aren't wearing armor or wielding a shield.",
                            "• You can use Dexterity instead of Strength for the attack and damage rolls of your unarmed strikes and monk weapons.",
                            "• You can roll a d4 in place of the normal damage of your unarmed strike or monk weapon. This die changes as you gain monk levels, as shown in the Martial Arts column of the Monk table.",
                            "• When you use the Attack action with an unarmed strike or a monk weapon on your turn, you can make one unarmed strike as a bonus action. For example, if you take the Attack action and attack with a quarterstaff, you can also make an unarmed strike as a bonus action, assuming you haven't already taken a bonus action this turn.",
                            "Certain monasteries use specialized forms of the monk weapons. For example, you might use a club that is two lengths of wood connected by a short chain (called a nunchaku) or a sickle with a shorter, straighter blade (called a kama).",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Ki",
                        "text": [
                            "Starting at 2nd level, your training allows you to harness the mystic energy of ki. Your access to this energy is represented by a number of ki points. Your monk level determines the number of points you have, as shown in the Ki Points column of the Monk table.",
                            "You can spend these points to fuel various ki features. You start knowing three such features: Flurry of Blows, Patient Defense, and Step of the Wind. You learn more ki features as you gain levels in this class.",
                            "When you spend a ki point, it is unavailable until you finish a short or long rest, at the end of which you draw all of your expended ki back into yourself. You must spend at least 30 minutes of the rest meditating to regain your ki points.",
                            "Some of your ki features require your target to make a saving throw to resist the feature's effects. The saving throw DC is calculated as follows:",
                            "",
                            "Flurry of Blows:",
                            "Immediately after you take the Attack action on your turn, you can spend 1 ki point to make two unarmed strikes as a bonus action.",
                            "",
                            "Patient Defense:",
                            "You can spend 1 ki point to take the Dodge action as a bonus action on your turn.",
                            "",
                            "Step of the Wind:",
                            "You can spend 1 ki point to take the Disengage or Dash action as a bonus action on your turn, and your jump distance is doubled for the turn.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "2"
                },
                {
                    "feature": {
                        "name": "Unarmored Movement",
                        "text": [
                            "Starting at 2nd level, your speed increases by 10 feet while you are not wearing armor or wielding a shield. This bonus increases when you reach certain monk levels, as shown in the Monk table.",
                            "At 9th level, you gain the ability to move along vertical surfaces and across liquids on your turn without falling during the move.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "2"
                },
                {
                    "feature": {
                        "name": "Deflect Missiles",
                        "text": [
                            "Starting at 3rd level, you can use your reaction to deflect or catch the missile when you are hit by a ranged weapon attack. When you do so, the damage you take from the attack is reduced by 1d10 + your Dexterity modifier + your monk level.",
                            "If you reduce the damage to 0, you can catch the missile if it is small enough for you to hold in one hand and you have at least one hand free. If you catch a missile in this way, you can spend 1 ki point to make a ranged attack (range 20/60 feet) with the weapon or piece of ammunition you just caught, as part of the same reaction. You make this attack with proficiency, regardless of your weapon proficiencies, and the missile counts as a monk weapon for the attack.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Monastic Tradition",
                        "text": [
                            "When you reach 3rd level, you commit yourself to a monastic tradition, chosen from the list of available traditions. Your tradition grants you features at 3rd level and again at 6th, 11th, and 17th level.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Monastic Tradition: Way of Shadow",
                        "text": [
                            "Monks of the Way of Shadow follow a tradition that values stealth and subterfuge. These monks might be called ninjas or shadowdancers, and they serve as spies and assassins. Sometimes the members of a ninja monastery are family members, forming a clan sworn to secrecy about their arts and missions. Other monasteries are more like thieves' guilds, hiring out their services to nobles, rich merchants, or anyone else who can pay their fees. Regardless of their methods, the heads of these monasteries expect the unquestioning obedience of their students.",
                            "",
                            "Source: Player's Handbook p. 80"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Way of Shadow: Shadow Arts",
                        "text": [
                            "You can use your ki to duplicate the effects of certain spells. As an action, you can spend 2 ki points to cast darkness, darkvision, pass without trace, or silence, without providing material components. Additionally, you gain the minor illusion cantrip if you don't already know it.",
                            "",
                            "Source: Player's Handbook p. 80"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Monastic Tradition: Way of the Four Elements",
                        "text": [
                            "You follow a monastic tradition that teaches you to harness the elements. When you focus your ki, you can align yourself with the forces of creation and bend the four elements to your will, using them as an extension of your body. Some members of this tradition dedicate themselves to a single element, but others weave the elements together.",
                            "Many monks of this tradition tattoo their bodies with representations of their ki powers, commonly imagined as coiling dragons, but also as phoenixes, fish, plants, mountains, and cresting waves.",
                            "",
                            "Source: Player's Handbook p. 80"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": [
                            "Way of the Four Elements: Disciple of the Elements",
                            "Way of the Four Elements: Casting Elemental Spells"
                        ],
                        "text": [
                            "You learn magical disciplines that harness the power of the four elements. A discipline requires you to spend ki points each time you use it.",
                            "You know the Elemental Attunement discipline and one other elemental discipline of your choice. You learn one additional elemental discipline of your choice at 6th, 11th, and 17th level.",
                            "Whenever you learn a new elemental discipline, you can also replace one elemental discipline that you already know with a different discipline.",
                            "Some elemental disciplines allow you to cast spells. See chapter 10 of the Player's Handbook for the general rules of spellcasting. To cast one of these spells, you use its casting time and other rules, but you don't need to provide material components for it.",
                            "Once you reach 5th level in this class, you can spend additional ki points to increase the level of an elemental discipline spell that you cast, provided that the spell has an enhanced effect at a higher level, as burning hands does. The spell's level increases by 1 for each additional ki point you spend. For example, if you are a 5th-level monk and use Sweeping Cinder Strike to cast burning hands, you can spend 3 ki points to cast it as a 2nd-level spell (the discipline's base cost of 2 ki points plus 1).",
                            "The maximum number of ki points you can spend to cast a spell in this way (including its base ki point cost and any additional ki points you spend to increase its level) is determined by your monk level, as shown in the Spells and Ki Points table. At 5th level, you may spend up to 3 ki points; this increases to 4 ki points at 9th level, 5 at 13th level, and 6 at 17th level.",
                            "",
                            "Spells and Ki Points",
                            "Monk Levels | Maximum Ki Points for a Spell",
                            "5th-8th | 3",
                            "9th-12th | 4",
                            "13th-16th | 5",
                            "17th-20th | 6",
                            "",
                            "Source: Player's Handbook p. 80"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": [
                            "Way of the Four Elements: Elemental Disciplines",
                            "Way of the Four Elements: Breath of Winter (17th Level Required)",
                            "Way of the Four Elements: Clench of the North Wind (6th Level Required)",
                            "Way of the Four Elements: Eternal Mountain Defense (17th Level Required)",
                            "Way of the Four Elements: Flames of the Phoenix (11th Level Required)",
                            "Way of the Four Elements: Gong of the Summit (6th Level Required)",
                            "Way of the Four Elements: Mist Stance (11th Level Required)",
                            "Way of the Four Elements: Ride the Wind (11th Level Required)",
                            "Way of the Four Elements: River of Hungry Flame (17th Level Required)",
                            "Way of the Four Elements: Wave of Rolling Earth (17th Level Required)"
                        ],
                        "text": [
                            "The elemental disciplines are presented in alphabetical order. If a discipline requires a level, you must be the level in this class to learn the discipline.",
                            "",
                            "Source: Player's Handbook p. 80"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Monastic Tradition: Way of the Open Hand",
                        "text": [
                            "Monks of the Way of the Open Hand are the ultimate masters of martial arts combat, whether armed or unarmed. They learn techniques to push and trip their opponents, manipulate ki to heal damage to their bodies, and practice advanced meditation that can protect them from harm.",
                            "",
                            "Source: Player's Handbook p. 79"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Way of the Open Hand: Open Hand Technique",
                        "text": [
                            "You can manipulate your enemy's ki when you harness your own. Whenever you hit a creature with one of the attacks granted by your Flurry of Blows, you can impose one of the following effects on that target.",
                            "• It must succeed on a Dexterity saving throw or be knocked prone.",
                            "• It must make a Strength saving throw. If it fails, you can push it up to 15 feet away from you.",
                            "• It can't take reactions until the end of your next turn.",
                            "",
                            "Source: Player's Handbook p. 79"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Ability Score Improvement",
                        "text": [
                            "When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
                            "If your DM allows the use of feats, you may instead take a feat.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "4",
                    "_scoreImprovement": "YES"
                },
                {
                    "feature": {
                        "name": "Slow Fall",
                        "text": [
                            "Beginning at 4th level, you can use your reaction when you fall to reduce any falling damage you take by an amount equal to five times your monk level.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "4"
                },
                {
                    "feature": {
                        "name": "Extra Attack",
                        "text": [
                            "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "5"
                },
                {
                    "feature": {
                        "name": "Stunning Strike",
                        "text": [
                            "Starting at 5th level, you can interfere with the flow of ki in an opponent's body. When you hit another creature with a melee weapon attack, you can spend 1 ki point to attempt a stunning strike. The target must succeed on a Constitution saving throw or be stunned until the end of your next turn.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "5"
                },
                {
                    "feature": {
                        "name": "Ki-Empowered Strikes",
                        "text": [
                            "Starting at 6th level, your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Monastic Tradition feature",
                        "text": [
                            "At 6th level, you gain one feature granted by your Monastic Tradition.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Way of Shadow: Shadow Step",
                        "text": [
                            "You gain the ability to step from one shadow into another. When you are in dim light or darkness, as a bonus action you can teleport up to 60 feet to an unoccupied space you can see that is also in dim light or darkness. You then have advantage on the first melee attack you make before the end of the turn.",
                            "",
                            "Source: Player's Handbook p. 80"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Way of the Four Elements: Extra Elemental Discipline",
                        "text": [
                            "You learn one additional elemental discipline of your choice. You should know 2 elemental disciplines, as well as Elemental Attunement.",
                            "Whenever you learn a new elemental discipline, you can also replace one elemental discipline that you already know with a different discipline.",
                            "",
                            "Source: Player's Handbook p. 80"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Way of the Open Hand: Wholeness of Body",
                        "text": [
                            "You gain the ability to heal yourself. As an action, you can regain hit points equal to three times your monk level. You must finish a long rest before you can use this feature again.",
                            "",
                            "Source: Player's Handbook p. 79"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Evasion",
                        "text": [
                            "At 7th level, your instinctive agility lets you dodge out of the way of certain area effects, such as a blue dragon's lightning breath or a fireball spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "7"
                },
                {
                    "feature": {
                        "name": "Stillness of Mind",
                        "text": [
                            "Starting at 7th level, you can use your action to end one effect on yourself that is causing you to be charmed or frightened.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "7"
                },
                {
                    "feature": {
                        "name": "Ability Score Improvement",
                        "text": [
                            "When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
                            "If your DM allows the use of feats, you may instead take a feat.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "8",
                    "_scoreImprovement": "YES"
                },
                {
                    "feature": {
                        "name": "Unarmored Movement improvement",
                        "text": [
                            "At 9th level, you gain the ability to move along vertical surfaces and across liquids on your turn without falling during the move.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "9"
                },
                {
                    "feature": {
                        "name": "Purity of Body",
                        "text": [
                            "At 10th level, your mastery of the ki flowing through you makes you immune to disease and poison.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "10"
                },
                {
                    "feature": {
                        "name": "Monastic Tradition feature",
                        "text": [
                            "At 11th level, you gain one feature granted by your Monastic Tradition.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "11"
                },
                {
                    "feature": {
                        "name": "Way of Shadow: Cloak of Shadows",
                        "text": [
                            "By 11th level, you have learned to become one with the shadows. When you are in an area of dim light or darkness, you can use your action to become invisible. You remain invisible until you make an attack, cast a spell, or are in an area of bright light.",
                            "",
                            "Source: Player's Handbook p. 80"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "11"
                },
                {
                    "feature": {
                        "name": "Way of the Four Elements: Extra Elemental Discipline",
                        "text": [
                            "You learn one additional elemental discipline of your choice. You should know 3 elemental disciplines, as well as Elemental Attunement.",
                            "Whenever you learn a new elemental discipline, you can also replace one elemental discipline that you already know with a different discipline.",
                            "",
                            "Source: Player's Handbook p. 80"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "11"
                },
                {
                    "feature": {
                        "name": "Way of the Open Hand: Tranquility",
                        "text": [
                            "Beginning at 11th level, you can enter a special meditation that surrounds you with an aura of peace. At the end of a long rest, you gain the effect of a sanctuary spell that lasts until the start of your next long rest (the spell can end early as normal). The saving throw DC for the spell equals 8 + your Wisdom modifier + your proficiency bonus.",
                            "",
                            "Source: Player's Handbook p. 79"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "11"
                },
                {
                    "feature": {
                        "name": "Ability Score Improvement",
                        "text": [
                            "When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
                            "If your DM allows the use of feats, you may instead take a feat.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "12",
                    "_scoreImprovement": "YES"
                },
                {
                    "feature": {
                        "name": "Tongue of the Sun and Moon",
                        "text": [
                            "Starting at 13th level, you learn to touch the ki of other minds so that you understand all spoken languages. Moreover, any creature that can understand a language can understand what you say.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "13"
                },
                {
                    "feature": {
                        "name": "Diamond Soul",
                        "text": [
                            "Beginning at 14th level, your mastery of ki grants you proficiency in all saving throws.",
                            "Additionally, whenever you make a saving throw and fail, you can spend 1 ki point to reroll it and take the second result.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "14"
                },
                {
                    "feature": {
                        "name": "Timeless Body",
                        "text": [
                            "At 15th level, your ki sustains you so that you suffer none of the frailty of old age, and you can't be aged magically. You can still die of old age, however. In addition, you no longer need food or water.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "15"
                },
                {
                    "feature": {
                        "name": "Ability Score Improvement",
                        "text": [
                            "When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
                            "If your DM allows the use of feats, you may instead take a feat.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "16",
                    "_scoreImprovement": "YES"
                },
                {
                    "feature": {
                        "name": "Monastic Tradition feature",
                        "text": [
                            "At 17th level, you gain one feature granted by your Monastic Tradition.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "17"
                },
                {
                    "feature": {
                        "name": "Way of Shadow: Opportunist",
                        "text": [
                            "At 17th level, you can exploit a creature's momentary distraction when it is hit by an attack. Whenever a creature within 5 feet of you is hit by an attack made by a creature other than you, you can use your reaction to make a melee attack against that creature.",
                            "",
                            "Source: Player's Handbook p. 80"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "17"
                },
                {
                    "feature": {
                        "name": "Way of the Four Elements: Extra Elemental Discipline",
                        "text": [
                            "You learn one additional elemental discipline of your choice. You should know 4 elemental disciplines, as well as Elemental Attunement.",
                            "Whenever you learn a new elemental discipline, you can also replace one elemental discipline that you already know with a different discipline.",
                            "",
                            "Source: Player's Handbook p. 80"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "17"
                },
                {
                    "feature": {
                        "name": "Way of the Open Hand: Quivering Palm",
                        "text": [
                            "You gain the ability to set up lethal vibrations in someone's body. When you hit a creature with an unarmed strike, you can spend 3 ki points to start these imperceptible vibrations, which last for a number of days equal to your monk level. The vibrations are harmless unless you use your action to end them. To do so, you and the target must be on the same plane of existence. When you use this action, the creature must make a Constitution saving throw. If it fails, it is reduced to 0 hit points. If it succeeds, it takes 10d10 necrotic damage.",
                            "You can have only one creature under the effect of this feature at a time. You can choose to end the vibrations harmlessly without using an action.",
                            "",
                            "Source: Player's Handbook p. 79"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "17"
                },
                {
                    "feature": {
                        "name": "Empty Body",
                        "text": [
                            "Beginning at 18th level, you can use your action to spend 4 ki points to become invisible for 1 minute. During that time, you also have resistance to all damage but force damage.",
                            "Additionally, you can spend 8 ki points to cast the astral projection spell, without needing material components. When you do so, you can't take any other creatures with you.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "18"
                },
                {
                    "feature": {
                        "name": "Ability Score Improvement",
                        "text": [
                            "When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
                            "If your DM allows the use of feats, you may instead take a feat.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "19",
                    "_scoreImprovement": "YES"
                },
                {
                    "feature": {
                        "name": "Perfect Self",
                        "text": [
                            "At 20th level, when you roll for initiative and have no ki points remaining, you regain 4 ki points.",
                            "",
                            "Source: Player's Handbook p. 76"
                        ]
                    },
                    "_level": "20"
                }
            ],
            "armor": "none",
            "weapons": "simple, shortswords",
            "tools": "any one type of artisan's tools or any one musical instrument of your choice",
            "wealth": "5d4"
        },
        "_version": "5",
        "_auto_indent": "NO"
    }
}
