{
    "compendium": {
        "background": [
            {
                "name": "Azorius Functionary",
                "proficiency": "Insight, Intimidation",
                "trait": [
                    {
                        "name": "Description",
                        "text": "The brutes are at the gate, chaos is looming, and the only thing standing in the way of disaster is the foundation of law and order—as embodied in the Azorius Senate. You're a proud member of the Azorius guild, which both enacts and enforces the laws that make Ravnican society function smoothly and safely.\n• Skill Proficiencies: Insight, Intimidation\n• Languages: Two of your choice\n• Equipment: An Azorius insignia, a scroll containing the text of a law important to you, a Ink (1-ounce bottle), a ink pen, a set of fine clothes, and a belt pouch containing 10 gp (Azorius-minted 1-zino coins)\nSource: Guildmasters' Guide to Ravnica p. 33"
                    },
                    {
                        "name": "Feature: Legal Authority",
                        "text": "You have the authority to enforce the laws of Ravnica, and that status inspires a certain amount of respect and even fear in the populace. People mind their manners in your presence and avoid drawing your attention; they assume you have the right to be wherever you are. Showing your Azorius insignia gets you an audience with anyone you want to talk to (though it might cause more problems than it solves when you're dealing with incorrigible lawbreakers). If you abuse this privilege, though, you can get in serious trouble with your superiors and even be stripped of your position."
                    },
                    {
                        "name": "Azorius Guild Spells",
                        "text": "Prerequisite: Spellcasting or Pact Magic class feature\nFor you, the spells on the Azorius Guild Spells table are added to the spell list of your spellcasting class. (If you are a multiclass character with multiple spell lists, these spells are added to all of them.)\nAzorius Guild Spells\nSpell Level | Spells\nCantrip | friends, message\n1st | command, ensnaring strike\n2nd | arcane lock, calm emotions, hold person\n3rd | clairvoyance, counterspell\n4th | compulsion, divination\n5th | dominate person\n\nYour magic often takes the form of blue or golden runes floating and glowing in the air in circular patterns or of shimmering azure barriers of magical energy. If you cast ensnaring strike, for example, the vines created by the spell might appear as rune-inscribed glowing bands that wrap around the target and hold it in place."
                    },
                    {
                        "name": "Suggested Characteristics",
                        "text": "Members of the Azorius Senate tend toward a demeanor of cold dignity and a pragmatic, orderly nature. Steeped in the law as they are, their ideals and priorities revolve around legal issues.\nPersonality Traits\nd8 | Trait\n1 | I try never to let my judgment become clouded by emotion.\n2 | I have infinite patience with the dolts and boors I'm forced to deal with every day.\n3 | When I give an order, I expect it to be obeyed.\n4 | I just want things the way I like them: neat, orderly, and clean.\n5 | No wrongdoing can escape my watchful gaze.\n6 | I always say exactly what I mean, no matter how many words it takes to communicate the particular nuance I am attempting to convey.\n7 | I'm very literal and don't appreciate metaphor or sarcasm.\n8 | I never change my mind once it's made up.\n\nIdeals\nd6 | Ideal\n1 | Guild. My guild is all that really matters. (Any)\n2 | Order. The law is meant to ensure that the gears of society turn smoothly and quietly. (Lawful)\n3 | Peace. The ultimate object of the law is to remove violence from society. (Good)\n4 | Compliance. Coercion is a fine way of ensuring that the laws are obeyed. (Lawful)\n5 | Legislation. The law embodies excellence in its precision and detail. (Lawful)\n6 | Punishment. A public display of consequences is an excellent deterrent for other criminals. (Evil)\n\nBonds\nd6 | Bond\n1 | I am beholden to an Azorius arrester who captured the criminal who killed my parents, saving me from the same fate.\n2 | I hope one day to write the laws, not just enforce them.\n3 | I tried and failed to prevent a murder, and I have sworn to find and arrest the perpetrator.\n4 | I successfully prevented a murder, and the would-be perpetrator wants me dead.\n5 | One of my parents was prominent in the guild, and I resent constantly being compared to that standard.\n6 | I've modeled my career after a highly respected lawmage or arrester, but I fear that my role model might be involved in something illegal.\n\nFlaws\nd6 | Flaw\n1 | I'm unable to distinguish between the letter and the spirit of the law.\n2 | I seem like a harsh judge to others, but I judge myself most harshly of all.\n3 | I have a secret, illegal vice.\n4 | I was traumatized by witnessing a crime as a child.\n5 | I'm incapable of deception.\n6 | I wish I had joined the Boros, but I fear they'd never accept me."
                    },
                    {
                        "name": "Contacts",
                        "text": "The Azorius Senate is a sprawling bureaucracy, and people in a variety of positions throughout the guild can pull strings to make things happen. Because of the guild's role in making and enforcing laws for the entire city, your place in the Azorius can easily bring you into contact with members of other guilds, for good or ill.\nRoll twice on the Azorius Contacts table (for an ally and a rival) and once on the Non-Azorius Contacts table.\nAzorius Contacts\nd8 | Contact\n1 | As a teenager, I was a page for a prominent judge.\n2 | One of my childhood friends is now a precognitive mage in service of the guild.\n3 | I joined the Azorius hoping to impress an arrester whom I admire.\n4 | My former mentor is now a warden at Udzec, the new Azorius prison.\n5 | I was second best at everything in my legal training, and now I work with the person who was always just a little bit better.\n6 | A good friend was promoted into work they can't tell me about.\n7 | I know a homunculus in the halls of New Prahv who can get things done behind the scenes.\n8 | I was once summoned to the presence of Supreme Judge Isperia, the guildmaster of the Azorius, who complimented me on my work.\n\nNon-Azorius Contacts\nd10 | Contact\n1 | Roll an additional Azorius contact; you can decide if the contact is an ally or a rival.\n2 | The person who recruited me into the Azorius left and joined the Boros.\n3 | I have a friendship with a Dimir agent who sometimes funnels me secrets about Azorius activities.\n4 | A Golgari spore druid would love to see me slip up and break the law.\n5 | A lesser Gruul chieftain seems to think I could be useful.\n6 | The black sheep of my family is putting their maniacal genius to use in the Izzet.\n7 | I'm friends with an Orzhov advokist; we compare notes on different forms of law magic.\n8 | I was ridiculed once in a Rakdos performance; the performer was impressed with my good humor about it and now does me occasional favors.\n9 | I have a fanatical Selesnya cousin who keeps trying to recruit me and everyone else in the family.\n10 | While growing up, I was bullied by a brat who's now a hybrid in the Simic Combine."
                    },
                    {
                        "name": "How Do I Fit In?",
                        "text": "As a member of the Azorius Senate, you are probably engaged in the work of law enforcement (even if your background involved the legislative or judicial aspects of the senate's activities). Legislative aides and judges' clerks find little reason to venture beyond the Azorius guildhalls, but soldiers and lawmages patrol the streets daily.\nAn Azorius soldier or lawmage is a force for order, charged with fighting crime on the streets—and in the halls of power. You might spend your time foiling thefts, putting a stop to Orzhov extortion, rooting out Dimir spies, or hunting down Golgari assassins. Perhaps you take your orders from a precognitive mage (or you are one yourself) who receives unpredictable and cryptic visions of future crimes that you and your allies must try to prevent."
                    }
                ]
            },
            {
                "name": "Boros Legionnaire",
                "proficiency": "Athletics, Intimidation",
                "trait": [
                    {
                        "name": "Description",
                        "text": "As a member of the Boros Legion, your life is devoted to the service of angels and consecrated to the work of establishing justice and peace on the streets of Ravnica. You might be a true believer, inspired by the example of the angels, moved by the plight of the downtrodden, and devoted to the cause of justice. Or you could be a cynic in the ranks, perhaps because you reluctantly followed in the footsteps of a Boros parent, succumbed to the persuasion of a charismatic recruiter's lofty promises, or were drawn in by the prospect of a life of action.\n• Skill Proficiencies: Athletics, Intimidation\n• Tool Proficiencies: One type of gaming set\n• Languages: Choose one of Celestial, Draconic, Goblin, or Minotaur\n• Equipment: A Boros insignia, a feather from an angel's wing, a tattered piece of a Boros banner (a souvenir from a famous battle), a set of common clothes, and a belt pouch containing 2 gp (Boros-minted 1-zino coins)\nSource: Guildmasters' Guide to Ravnica p. 40"
                    },
                    {
                        "name": "Feature: Legion Station",
                        "text": "You have an established place in the hierarchy of the Boros Legion. You can requisition simple equipment for temporary use, and you can gain access to any Boros garrison in Ravnica, where you can rest in safety and receive the attention of medics. You are also paid a salary of 1 gp (a Boros-minted 1-zino coin) per week, which (combined with free lodging in your garrison) enables you to maintain a poor lifestyle between adventures."
                    },
                    {
                        "name": "Boros Guild Spells",
                        "text": "Prerequisite: Spellcasting or Pact Magic class feature\nFor you, the spells on the Boros Guild Spells table are added to the spell list of your spellcasting class. (If you are a multiclass character with multiple spell lists, these spells are added to all of them.)\nBoros Guild Spells\nSpell Level | Spells\nCantrip | fire bolt, sacred flame\n1st | guiding bolt, heroism\n2nd | aid, scorching ray\n3rd | beacon of hope, blinding smite\n4th | death ward, wall of fire\n5th | flame strike\n\nYour magic often features dramatic bursts of flame or radiance. When you cast beneficial spells on your allies, they appear momentarily surrounded with halos of bright fire."
                    },
                    {
                        "name": "Suggested Characteristics",
                        "text": "The Boros Legion is a zealous army, full of righteous energy tempered with military discipline. Its members share its leadership's devotion to the ideals of justice, or they find satisfaction in the more warfare-oriented aspects of the legion's work.\nPersonality Traits\nd8 | Personality Trait\n1 | I approach every task with the same high degree of military precision.\n2 | I am always the first into the fray.\n3 | I bear any injury or indignity with stoic discipline.\n4 | My righteous wrath is easily inflamed by the slightest iniquity.\n5 | My honor is more important to me than my life.\n6 | Dangerous work is best accomplished by an orderly group working with common purpose.\n7 | I treat my weapons, uniform, and insignia with reverence, for they are gifts of the angels.\n8 | I pace when standing and fidget incessantly when forced to sit.\n\nIdeals\nd6 | Ideal\n1 | Guild. My guild is all that really matters. (Any)\n2 | Justice. Achieving justice requires establishing fair, equitable, and compassionate relationships within a community. (Good)\n3 | Protection. It isn't right for innocents to suffer because of the arrogance of the powerful. (Good)\n4 | Solidarity. It is most crucial to act with a single will, marching side by side in perfect accord. (Lawful)\n5 | Order. Society functions only if people do their duty and respect the chain of command. (Lawful)\n6 | Conviction. Anything worth doing is worth doing with your whole heart. (Lawful)\n\nBonds\nd6 | Bond\n1 | I would lay down my life for Aurelia and the angels.\n2 | I owe my life to the Boros captain who took me in when I was living on the streets.\n3 | My fellow legionnaires are my family.\n4 | I wield the same Boros weapon my grandparent did, for the honor of our family.\n5 | I ran with the Rakdos in my youth, and I'm striving to atone for my past misdeeds.\n6 | I do what I can to help out the spouse of a comrade who died in battle.\n\nFlaws\nd6 | Flaw\n1 | I act bravely when I'm in a group, but I'm a coward when I'm alone.\n2 | I see everything in clear-cut black and white.\n3 | I'm just a little fascinated by the ways of the Gruul.\n4 | I trust the chain of command more than anything—more even than my closest friends.\n5 | I'm slow to trust members of other guilds.\n6 | I've been known to turn a blind eye to injustice, with the help of a modest bribe."
                    },
                    {
                        "name": "Contacts",
                        "text": "The ordered structure of the Boros Legion offers abundant opportunities to make friends—and rivals—in higher places. You might have close friends in other guilds that share the Boros emphasis on order and community, or bitter enemies among the guilds that represent chaos and destruction.\nRoll twice on the Boros Contacts table (for an ally and a rival) and once on the Non-Boros Contacts table.\nBoros Contacts\nd8 | Contact\n1 | A former comrade in arms was promoted into the prestigious Sunhome Guard.\n2 | One of my parents is a ranking Boros officer.\n3 | A close friend serves aboard the Parhelion II, a flying fortress.\n4 | I had a tangled affair with a Boros garrison captain.\n5 | I have maintained a relationship with one of my instructors at Horizon Military Academy.\n6 | I competed with a fellow student for the attention of a mentor at Horizon Military Academy.\n7 | The person who recruited me into the legion changed the course of my life.\n8 | A Boros angel knows my name.\n\nNon-Boros Contacts\nd10 | Contact\n1 | One of my siblings is an Azorius arrester.\n2 | Roll an additional Boros contact; you can decide if the contact is an ally or a rival.\n3 | I showed mercy to an injured, now-grateful Dimir spy.\n4 | I suspect someone I know is a Golgari assassin, but I can't prove it.\n5 | An adolescent relative ran off to join the Gruul in an act of rebellion and has not yet returned.\n6 | I once befriended an Izzet scientist, and we're still cordial though the relationship ended messily.\n7 | I owe a monetary debt to an Orzhov syndic.\n8 | A Rakdos blood witch seems to enjoy harassing me.\n9 | I tried to recruit a friend who ended up joining the Selesnya.\n10 | I keep running into a particular Simic biomancer, and I enjoy the arguments that inevitably result."
                    },
                    {
                        "name": "How Do I Fit In?",
                        "text": "As a member of the Boros Legion, you are subject to the orders of your superior officers. You go where the angels tell you to go, and you do what they command you to do, to the best of your ability. If you enjoy some measure of independence, it's either because you have proven yourself capable of working without close supervision or because you're a rebellious sort who is willing to disobey orders now and face the consequences later.\nAs a soldier on the street, you are tasked with bringing dangerous threats like the Rakdos and the Gruul in line. You might contend with Rakdos performances gone horribly out of control, Gruul raids on outlying neighborhoods, shipments of rot-infested vegetation from the Golgari undercity, and violent uprisings among the guildless. At the same time, you might have to worry about Dimir spies infiltrating your leadership, overzealous or corrupt Azorius senators abusing the law at the expense of justice, Izzet experiments leveling city blocks, and Simic creations that break out of laboratories and wreak havoc through the Tenth District."
                    }
                ]
            },
            {
                "name": "Dimir Operative",
                "proficiency": "Deception, Stealth",
                "trait": [
                    {
                        "name": "Description",
                        "text": "You're a spy. Secrets and misinformation are your stock in trade. You skulk in the shadows, infiltrate other guilds, and steal the most precious secrets, whether they're written in locked journals or hidden away in someone's mind. Even you might not be aware of all the reasons behind the missions you carry out. Sometimes a mission's sole purpose is to conceal the motivation behind another strike performed in a different part of the city, or simply to spread fear.\nAs part of your covert work for House Dimir, you maintain a false identity as a member of another guild. You can choose your secondary guild or roll to determine it randomly. This secondary guild membership determines a portion of your starting equipment and is also where most of your contacts come from. You infiltrate your secondary guild to learn its secrets, keep tabs on its activities, or perhaps undermine it from within.\n• Skill Proficiencies: Deception, Stealth\n• Tool Proficiencies: Disguise kit\n• Languages: One of your choice\n• Equipment: A Dimir insignia, three small knives, a set of dark-colored common clothes, and the starting equipment of the background described in this chapter for your secondary guild\nSource: Guildmasters' Guide to Ravnica p. 46"
                    },
                    {
                        "name": "Feature: False Identity",
                        "text": "You have more than one identity. The one you wear most of the time makes you appear to be a member of a guild other than House Dimir. You have documentation, established acquaintances, and disguises that allow you to assume that persona and fit into the secondary guild.\nWhenever you choose, you can drop this identity and blend into the guildless masses of the city.\nConsider why you're embedded in the secondary guild. Create a story with your DM, inspired by rolling on the following table or choosing a reason that suits you.\nd8 | Reason for Infiltration\n1 | My parents belong to this guild, and I let them think I'm following in their footsteps.\n2 | I've been assigned to track this guild's activities.\n3 | I've been assigned to get close to an individual in this guild and learn their secrets.\n4 | I've been assigned to recruit a new Dimir spy from the ranks of this guild.\n5 | I was a member of this guild before the Dimir recruited me.\n6 | I don't like what this guild stands for and want to destroy it from within.\n7 | I secretly wish I could leave the Dimir and join this guild, but there is no escaping the Dimir.\n8 | I chose this guild at random or on a lark."
                    },
                    {
                        "name": "Dimir Guild Spells",
                        "text": "Prerequisite: Spellcasting or Pact Magic class feature\nFor you, the spells on the Dimir Guild Spells table are added to the spell list of your spellcasting class. (If you are a multiclass character with multiple spell lists, these spells are added to all of them.)\nDimir Guild Spells\nSpell Level | Spells\nCantrip | encode thoughts, mage hand\n1st | disguise self, sleep\n2nd | detect thoughts, pass without trace\n3rd | gaseous form, meld into stone, nondetection\n4th | arcane eye, freedom of movement\n5th | modify memory\n\nYour magic is meant to be subtle and undetectable, but it might pull shadows or clouds of mist around you as you cast your spells. Using the encode thoughts cantrip described below, you can turn a creature's thoughts (including your own) into a thought strand that others can potentially read, share, or steal. These thought strands are treated as valuable currency among the Dimir."
                    },
                    {
                        "name": "Suggested Characteristics",
                        "text": "Skilled at infiltration, disguise, and deception, members of House Dimir appear inscrutable. Your true personality and ideals might never manifest, or they might mark you as a quirky member of your secondary guild.\nPersonality Traits\nd8 | Personality Trait\n1 | I'm good at hiding my true thoughts and feelings.\n2 | When I'm in doubt about revealing something, I assume it's a secret, and I don't share it.\n3 | I like to sound mysterious, because wisdom hidden grows deeper with time.\n4 | I have no patience with people who get in my way.\n5 | I love hearing about other people's nightmares.\n6 | Combat is meant to be quick, clean, and one-sided.\n7 | I like to stick to the shadows.\n8 | I never show my anger. I just plot my revenge.\n\nIdeals\nd6 | Ideal\n1 | Guild. My true guild is all that really matters. (Any)\n2 | Control. I like pulling the strings. (Lawful)\n3 | Secrets. I collect secrets and never reveal them. (Any)\n4 | Knowledge. I want to know as much as I can about this city and how it works. (Any)\n5 | Independence. I value the freedom to pursue my own goals without interference. (Chaotic)\n6 | Nihilism. I don't believe in anything, and anyone who does is a fool. (Neutral)\n\nBonds\nd6 | Bond\n1 | I discovered a secret I can't let anyone else uncover—including my guild superiors.\n2 | I formed a close friendship or romance with someone in the guild I'm infiltrating.\n3 | The Dimir agent who recruited me was unmasked and killed. My revenge on the killers will be thorough and painful.\n4 | I spend as much time as I can in the Ismeri Library because I'm certain an information hub operates behind its facade. I want its secrets!\n5 | I'm utterly loyal to my superior in the guild, more than to the guild or its guildmaster.\n6 | Someone has discovered my true identity.\n\nFlaws\nd6 | Flaw\n1 | I like secrets so much that I'm reluctant to share details of a plan even with those who need to know.\n2 | I would let my friends die rather than reveal my true identity.\n3 | I have trouble trusting anyone but myself.\n4 | I have a particular vice that puts all my secrets at risk if I'm not careful.\n5 | I'm pretty sure I've done something horrible that I can't remember because of the guild's mind magic.\n6 | I put too much trust in the people who give me orders."
                    },
                    {
                        "name": "Contacts",
                        "text": "As an agent of House Dimir working undercover, you have limited contacts within your guild. Your relationships within your secondary guild, in the guise of your false identity, are usually more extensive.\nRoll once on the Dimir Contacts table, giving you an ally who serves as your contact in Dimir. Then roll twice on the table for your secondary guild. The first roll gives you an ally there, and the second roll gives you a rival.\nDimir Contacts\nd8 | Contact\n1 | I know a Dimir courier who relays messages to me from someone higher up the chain of command.\n2 | I get orders from a shapeshifter I recognize only through a series of code phrases we exchange.\n3 | An ostentatiously wealthy vampire is my secret guild superior, summoning me to a luxurious estate by means of coded messages.\n4 | I have never met my guild contact, but I receive telepathic messages, usually in my dreams.\n5 | I've never met my guild contact, but I get coded messages from a pattern of street lights and graffiti.\n6 | I didn't discover the identity of my guild contact until after we had begun a romantic relationship.\n7 | My superior maintains an elaborate identity as a young street urchin... unless it's all a lie, and I'm being sent on ridiculous missions by a twisted child.\n8 | My sibling and I both get telepathic orders from a mysterious contact, and I'm starting to question the authenticity of my sibling's orders."
                    },
                    {
                        "name": "How Do I Fit In?",
                        "text": "As a Dimir adventurer, you are a member of the guild's network of spies, thieves, assassins, and mind mages that lurks behind the facade of the public guild. On the surface, House Dimir presents the appearance of a network of couriers, investigators, media reporters, and archivists, dealing in information and spreading news. But you and your peers trade in secrets. You use secret symbols, runes, and signals to surreptitiously communicate with other Dimir agents, often in plain sight.\nLike any good spy, you have multiple identities: your true face as an agent of House Dimir; a guildless identity; and a role as a member of another guild. Within that secondary guild, you might already be on a mission for House Dimir, assigned to spy on the guild, collect information about a person, or recruit another spy from the ranks of the guild. Or that guild could be a launching point for your real mission. Perhaps, for example, you were ordered to infiltrate the Azorius in hopes of gaining access to a notorious inmate in an Azorius prison."
                    }
                ]
            },
            {
                "name": "Golgari Agent",
                "proficiency": "Nature, Survival",
                "trait": [
                    {
                        "name": "Description",
                        "text": "You are a member of a teeming horde—one small part of a sprawling organism. Just as you are part of the swarm, the swarm is part of a larger ecosystem, a never-ending cycle of life, death, rot, and rebirth. You have spent your life in the slow churn of that ecosystem, in the dark places of the city where the messy parts of existence are on display. There is little squeamishness among the Golgari, no fear of death or taboo about the dead, just a fierce affirmation of the cycle.\n• Skill Proficiencies: Nature, Survival\n• Tool Proficiencies: Poisoner's kit\n• Languages: Choose one of Elvish, Giant, or Kraul\n• Equipment: A Golgari insignia, a poisoner's kit, a pet beetle or spider, a set of common clothes, and a belt pouch containing 10 gp worth of mixed coins\nSource: Guildmasters' Guide to Ravnica p. 53"
                    },
                    {
                        "name": "Feature: Undercity Paths",
                        "text": "You know hidden, underground pathways that you can use to bypass crowds, obstacles, and observation as you move through the city. When you aren't in combat, you and companions you lead can travel between any two locations in the city twice as fast as your speed would normally allow. The paths of the undercity are haunted by dangers that rarely brave the light of the surface world, so your journey isn't guaranteed to be safe."
                    },
                    {
                        "name": "Golgari Guild Spells",
                        "text": "Prerequisite: Spellcasting or Pact Magic class feature\nFor you, the spells on the Golgari Guild Spells table are added to the spell list of your spellcasting class. (If you are a multiclass character with multiple spell lists, these spells are added to all of them.)\nGolgari Guild Spells\nSpell Level | Spells\nCantrip | dancing lights, spare the dying\n1st | entangle, ray of sickness\n2nd | protection from poison, ray of enfeeblement, spider climb\n3rd | animate dead, plant growth\n4th | giant insect, grasping vine\n5th | cloudkill, insect plague\n\nGolgari magic is often accompanied by a sickly green glow and a rotting stench."
                    },
                    {
                        "name": "Suggested Characteristics",
                        "text": "Members of the Golgari Swarm are unmistakably products of the undercity, ill at ease amid the comforts of civilization. They bring about the same discomfort in others by reminding them of death's inevitable approach.\nPersonality Traits\nd8 | Personality Trait\n1 | Remember, I could kill you in your sleep. Or put centipedes in your bedroll.\n2 | I like to remind people of their inevitable demise.\n3 | Sometimes I give voice to the whispers of the rot, which I hear but no one else does.\n4 | I do my best to discourage anyone from approaching or talking to me.\n5 | I have accepted my death. Hence, I don't fear it.\n6 | Like roots growing through stone, I am relentless and determined in my action.\n7 | I put my knowledge of anatomy to use by narrating the injuries my enemies suffer in grisly detail.\n8 | Like a wild animal, I lash out viciously when I'm provoked—and I'm easily provoked.\n\nIdeals\nd6 | Ideal\n1 | Guild. My guild is all that really matters. (Any)\n2 | Stoicism. All of us are part of the cyclical march of nature, which will continue with or without us. (Neutral)\n3 | Nature. The natural world is more important than the edifices of the city and civilization. (Neutral)\n4 | Interdependence. We are all part of nature's web. (Lawful)\n5 | Ambition. The time of Golgari ascendance is at hand, and I intend to have a prominent place in the new world order. (Evil)\n6 | Live and Let Live. Meddling in the affairs of other guilds is a great way to get squashed like a bug. (Neutral)\n\nBonds\nd6 | Bond\n1 | I cherish the finger of a family member who was petrified by a medusa.\n2 | I have an identical twin who is as different from me as any person could be.\n3 | I want to lead one faction of the guild to a new position of dominance.\n4 | I love spending time in the moss-covered building where I took part in my first reclamation mission.\n5 | I found something in the sewer that must never come to light.\n6 | I am forever grateful to the reclaimer who found me floating facedown in the sewer, moments from death.\n\nFlaws\nd6 | Flaw\n1 | Death comes for us all, so you can't expect me to take care of someone who can't fight it off.\n2 | I assume that anyone outside the Golgari looks down on me.\n3 | I feel a need for revenge against those who enjoy the privilege of living above ground.\n4 | I don't bother to couch my opinions in flattering words.\n5 | I can't help but pocket any trinket or coin I come across, no matter how worthless.\n6 | I'm convinced that I'm better and stronger than members of other guilds, isolated as they are from the realities of life and death."
                    },
                    {
                        "name": "Contacts",
                        "text": "To the extent that the Golgari Swarm acts like a single organism, you are connected to every other member in some way or another. Convinced that the rest of the world is out to get you, you find it easy to form close bonds with your guild mates, and harder to make meaningful connections with others.\nRoll twice on the Golgari Contacts table (for an ally and a rival) and once on the Non-Golgari Contacts table.\nGolgari Contacts\nd8 | Contact\n1 | One of my parents is an elite assassin, a member of the Ochran.\n2 | I learned combat from a kraul.\n3 | I know a medusa who is stationed in the guildhall.\n4 | I had a torrid romance with a spore druid responsible for a large rot farm.\n5 | There's a troll in a remote area of the undercity who seems to find me interesting—and who knows more than you'd think.\n6 | An elf lich is determined to see me become a lich someday, too.\n7 | A medusa decided it would be more fun to recruit me into the guild than to kill me.\n8 | I know a findbroker who can locate just about anything, for the right price.\n\nNon-Golgari Contacts\nd10 | Contact\n1 | An Azorius arrester I literally pulled out of the gutter will do anything for me.\n2 | Someone joined the Gruul in a battle against the Boros once, and the sergeant of that Boros squad would love to prove that it was me.\n3 | I had a romance with a Dimir agent whom I still feed secrets to.\n4 | Roll an additional Golgari contact; you can decide if the contact is an ally or a rival.\n5 | I joined the Gruul in a battle against the Boros once, and the chief of that small clan thanks me for turning the tide.\n6 | An Izzet scientist resents that I sold a scrapped invention I found in the sewer.\n7 | My undercity explorations led me into an Orzhov vault, and a spirit thinks I stole something valuable.\n8 | I found a baby beast and sold it to a Rakdos wrangler who remains grateful to me.\n9 | A Selesnya druid and I share an interest in the same garden, and we have enjoyable arguments there.\n10 | I regularly pick up refuse from beneath a Simic laboratory, and sometimes I talk to the researcher who dumps it there."
                    },
                    {
                        "name": "How Do I Fit In?",
                        "text": "As part of the Golgari Swarm, you are a specialized instrument of the greater body. Your orders, when you have such, come from the guildmaster by way of his chancellors, who carry his messages throughout the guild. The swarm relies on you to advance the greater good by protecting some part, however small, of its teeming existence. That responsibility doesn't mean you're indispensable; your eventual death is part of your purpose and function, too, and you'll be replaced even as your body provides nutrients to further the swarm's growth.\nA classic adventuring role for a member of the Golgari involves crawling through dungeon-like environments—the sewers and ancient vaults of the undercity—in search of treasures left behind by the dead. Sometimes you might be sent to find a specific item believed lost in a dangerous part of the undercity. At other times, you could be asked to collect samples of a specific fungus, retrieve a body floating in the muck of the sewers, or bring back whatever booty you can to help fill the swarm's coffers.\nYou might gain enough renown to become a member of the Ochran, assigned to a variety of tasks concerning thievery, assassination, or the protection of important figures in your guild. You might steal something because the guild needs it, or because its loss will bring harm to another guild, hastening that group's decline. You could be assigned to kill an outspoken and active enemy of the Golgari, such as an overzealous Boros captain whose raids into the undercity have approached dangerously close to the swarm's inner sanctum. Or you could serve as a bodyguard to one of Guildmaster Jarad's high chancellors, escorting this figure through the undercity while being ready to intervene at a moment's notice if things go wrong.\nThe shamans of the Golgari use their magic to accelerate the cycle of decay and regrowth. You might be sent to spread spores throughout an area that the Golgari want to claim as their territory or to convince the inhabitants of such a territory to abandon it. You might also contend with the ever-present threat of hostile monsters encroaching into Golgari-controlled regions."
                    }
                ]
            },
            {
                "name": "Gruul Anarch",
                "proficiency": "Animal Handling, Athletics",
                "trait": [
                    {
                        "name": "Description",
                        "text": "The entire world of Ravnica is a sprawling metropolis, but you are a native of the wild areas that still exist—the abandoned districts, the rubblebelts, the overgrown parks, and the crumbling ruins. You are part of a savage society that clings desperately to the Old Ways—attuned to nature, full of primal rage, and given short shrift by a world consumed with continuing civilization's march of progress.\n• Skill Proficiencies: Animal Handling, Athletics\n• Tool Proficiencies: Herbalism kit\n• Languages: Choose one of Draconic, Giant, Goblin, or Sylvan\n• Equipment: A Gruul insignia, a hunting trap, an herbalism kit, the skull of a boar, a beast-hide cloak, a set of traveler's clothes, and a belt pouch containing 10 gp (Azorius 1-zino coins)\nSource: Guildmasters' Guide to Ravnica p. 60"
                    },
                    {
                        "name": "Feature: Rubblebelt Refuge",
                        "text": "You are intimately familiar with areas of the city that most people shun: ruined neighborhoods where wurms rampaged, overgrown parks that no hand has tended in decades, and the vast, sprawling rubblebelts of broken terrain that civilized folk have long abandoned. You can find a suitable place for you and your allies to hide or rest in these areas. In addition, you can find food and fresh water in these areas for yourself and up to five other people each day."
                    },
                    {
                        "name": "Gruul Guild Spells",
                        "text": "Prerequisite: Spellcasting or Pact Magic class feature\nFor you, the spells on the Gruul Guild Spells table are added to the spell list of your spellcasting class. (If you are a multiclass character with multiple spell lists, these spells are added to all of them.)\nGruul Guild Spells\nSpell Level | Spells\nCantrip | fire bolt, produce flame\n1st | compelled duel, speak with animals, thunderwave\n2nd | beast sense, shatter\n3rd | conjure animals, conjure barrage\n4th | dominate beast, stoneskin\n5th | destructive wave\n\nFueled by the fire of rage burning in your heart, your magic is almost always accompanied by fiery effects, such as flames smoldering behind your eyes or dancing over your hands."
                    },
                    {
                        "name": "Suggested Characteristics",
                        "text": "Gruul ways aren't the ways of civilized folk, and the Gruul have little patience for social niceties. But they do have cherished traditions and values, just as important to them as the different values held by the urban, cosmopolitan culture of Ravnica.\nPersonality Traits\nd8 | Personality Trait\n1 | Unlike people, the beasts of the wild are friends who won't stab me in the back.\n2 | Go ahead and insult me—I dare you.\n3 | I scorn those who can't survive away from the comforts of the city.\n4 | Don't tell me I'm not allowed to do something.\n5 | Laws are for people who are afraid to face their inner beasts.\n6 | I smear the blood of my enemies over my skin.\n7 | I was, in fact, raised by maaka.\n8 | HarrRRAAGGHH! [I rarely form a coherent sentence and prefer to express myself by breaking things.]\n\nIdeals\nd6 | Ideal\n1 | Clan. My clan is all that really matters. (Any)\n2 | Anarchy. No person or law or custom can tell another what to do. (Chaotic)\n3 | Nature. We weren't born tame or domesticated, so we shouldn't have to live that way. (Neutral)\n4 | Might. The strongest are meant to dominate the weak. (Evil)\n5 | Rage. AAAAAARRRRggggh! [To live is to feel and express the rage burning in your belly.] (Chaotic)\n6 | Tradition. The Old Ways must be preserved and upheld. (Any)\n\nBonds\nd6 | Bond\n1 | I am determined that one day I will lead my clan—or a new one.\n2 | I would give my life for my clan chieftain.\n3 | The chieftain of another clan has a grudge against me.\n4 | I am devoted to a sacred site in the midst of the rubblebelt.\n5 | My weapon is made from the first raktusk I ever hunted.\n6 | GrrrRRAAAAGGHH! [I will do anything to prove myself greater than my siblings or ancestors.]\n\nFlaws\nd6 | Flaw\n1 | If you question my courage, I will never back down.\n2 | HrrrGGGAAAARRuuuh! [My anger in battle led to the death of a loved one.]\n3 | I'm as stubborn as a batterboar.\n4 | I'm so convinced of my superiority over soft, civilized people that I'll take great risks to prove it.\n5 | I'm easily manipulated by people I find attractive.\n6 | I'm not actually all that angry."
                    },
                    {
                        "name": "Contacts",
                        "text": "The members of the Gruul Clans rely on each other even as they vie for territory and glory. Their encounters with members of other guilds are more often violent than friendly, but occasional bonds do form.\nRoll twice on the Gruul Contacts table (for an ally and a rival) and once on the Non-Gruul Contacts table.\nGruul Contacts\nd8 | Contact\n1 | One of my parents is a renowned warrior in my clan.\n2 | My sibling has the ear of the clan chief.\n3 | I have cousins in a different clan.\n4 | When we were younger, I was romantically involved with a prominent warrior in my clan.\n5 | A druid in my clan believes I have a destiny to fulfill.\n6 | The warrior who trained me remembers me for my exceptional potential.\n7 | My clan chief killed one of my parents, who had challenged the chief for leadership of the clan. Some combination of resentment and remorse stirs the clan chief to help me sometimes.\n8 | I made a strong impression on Borborygmos.\n\nNon-Gruul Contacts\nd10 | Contact\n1 | An Azorius arrester thinks I can be reformed.\n2 | A Boros soldier gives me gifts in exchange for information about other clans' movements.\n3 | I once caught and released a Dimir spy.\n4 | I consult with a Golgari shaman for spiritual guidance at times.\n5 | Roll an additional Gruul contact; you can decide if the contact is an ally or a rival.\n6 | An Izzet scientist blames the Gruul for the destruction of his life's work in a raid, but seems to think that I'm not like other Gruul.\n7 | I foolishly borrowed money from an Orzhov syndic to indulge a shameful vice.\n8 | A close friend left our clan and joined the Cult of Rakdos.\n9 | A distant relative is trying to recruit me into the Selesnya Conclave.\n10 | I stopped a Simic biomancer from trapping wild beasts to perform vile experiments on them."
                    },
                    {
                        "name": "How Do I Fit In?",
                        "text": "In service of a simple goal, you have a simple part to play: Fight. Unleash your rage. Flatten buildings and defeat those who stand in your way. Be Gruul, in your own way.\nYou will frequently be summoned to participate in a raid your clan is launching against the city or against a group of its defenders. Your clan leader might also send you on a special mission, though it would almost certainly still qualify as a raid. You might join a small group of Gruul warriors on a dangerous charge deep into the settled streets to plunder a certain location, retrieve an item stolen from your clan, or assault a Boros garrison.\nSometimes your objective might be more esoteric. With prophecies of the return of Ilharg the Raze-Boar spreading like wildfire among the Gruul druids, you might be asked to carry out some task that the druids believe will speed his coming. Such a task might involve collecting a sacred relic held in an Orzhov vault or collecting sacrifices for a grand ceremony in the Raze-Boar's honor."
                    }
                ]
            },
            {
                "name": "Izzet Engineer",
                "proficiency": "Arcana, Investigation",
                "trait": [
                    {
                        "name": "Description",
                        "text": "Armed with an inventive intellect, a love of magical technology, and an unquenchable energy, you are an enthusiastic participant in the research work of the Izzet League. Though you're likely to begin your career as a mere attendant, you can aspire to become a skilled mage or alchemist, a laboratory supervisor, or even a flamethrower-wielding scorchbringer tasked with defending Izzet laboratories. The Izzet are obsessive, brilliant, inspired, and an unpredictable force of chaos in Ravnica, and you epitomize all of those qualities.\n• Skill Proficiencies: Arcana, Investigation\n• Tool Proficiencies: One type of artisan's tools\n• Languages: Choose one of Draconic, Goblin, or Vedalken\n• Equipment: An Izzet insignia, one set of artisan's tools, the charred and twisted remains of a failed experiment, a hammer, a block and tackle, a set of common clothes, and a belt pouch containing 5 gp (Azorius 1-zino coins)\nSource: Guildmasters' Guide to Ravnica p. 66"
                    },
                    {
                        "name": "Feature: Urban Infrastructure",
                        "text": "The popular conception of the Izzet League is based on mad inventions, dangerous experiments, and explosive blasts. Much of that perception is accurate, but the league is also involved with mundane tasks of construction and architecture—primarily in crafting the infrastructure that allows Ravnicans to enjoy running water, levitating platforms, and other magical and technological wonders.\nYou have a basic knowledge of the structure of buildings, including the stuff behind the walls. You can also find blueprints of a specific building in order to learn the details of its construction. Such blueprints might provide knowledge of entry points, structural weaknesses, or secret spaces. Your access to such information isn't unlimited. If obtaining or using the information gets you in trouble with the law, the guild can't shield you from the repercussions."
                    },
                    {
                        "name": "Izzet Guild Spells",
                        "text": "Prerequisite: Spellcasting or Pact Magic class feature\nFor you, the spells on the Izzet Guild Spells table are added to the spell list of your spellcasting class. (If you are a multiclass character with multiple spell lists, these spells are added to all of them.)\nIzzet Guild Spells\nSpell Level | Spells\nCantrip | produce flame, shocking grasp\n1st | chaos bolt, create or destroy water, unseen servant\n2nd | heat metal, rope trick\n3rd | call lightning, elemental weapon, glyph of warding\n4th | conjure minor elementals, divination, Otiluke's resilient sphere\n5th | animate objects, conjure elemental\n\nYour spells tend to be loud, flashy, or explosive, even when the effect is unremarkable. For example, when you open the portal of a rope trick spell, the portal might be outlined by harmless, showy sparkles.\nIf you use an arcane focus, it probably takes the form of an intricate device that could include metal gauntlets, glass canisters, copper tubing, and leather straps attaching it to your body. The mizzium apparatus described in chapter 5 is a magical version of this gear.\nThe chaos bolt spell is a favorite of Izzet spellcasters because of its unpredictable nature."
                    },
                    {
                        "name": "Suggested Characteristics",
                        "text": "Members of the Izzet League embody some combination of chaotic, frenetic energy with intellectual curiosity, in varying proportions. Some are committed to academic pursuits, and others just like explosions.\nPersonality Traits\nd8 | Personality Trait\n1 | I have a hard time staying focused on... oh, and my brain tends to jump from one... did I mention focus?\n2 | I get really excited about my ideas and I can't wait to talk about them and start putting them into practice and tinkering with them and I want to tell you about how exciting it all is!\n3 | It's not magic—or anything, really—if you do it only halfway. Whatever I do, I give it all I've got.\n4 | I do what my gut tells me.\n5 | Life's an experiment, and I can't wait to see what happens.\n6 | I pepper my speech with the incomprehensible jargon of my trade, like mizzium droplets inserted into a weird-field suspension.\n7 | Great ideas are fine, but great results are what counts.\n8 | If you can guess what I'm about to do, that means I've run out of imagination.\n\nIdeals\nd6 | Ideal\n1 | Guild. My guild is all that really matters. (Any)\n2 | Creativity. Half the world's troubles come from stodgy thinking, stuck in the past. We need innovative solutions. (Chaotic)\n3 | Discovery. Every experiment has the potential to reveal more secrets of the multiverse. (Any)\n4 | Science. A rigorous application of logical principles and protocols will lead us toward progress more surely than any belief system. (Lawful)\n5 | Fun. I love my job! Despite the dangerous working conditions, there's nothing I'd rather do. (Chaotic)\n6 | Power. Someday I'll find or create the magic that will make me the most powerful being in Ravnica. (Evil)\n\nBonds\nd6 | Bond\n1 | I have dedicated my life to finding a solution to a scientific problem.\n2 | I'll never forget the laboratory where I learned my skills, or the other attendants who learned alongside me.\n3 | I'm convinced it was sabotage that destroyed my first laboratory and killed many of my friends, and I seek revenge against whoever did it.\n4 | I have the schematics for an invention that I hope to build one day, once I have the necessary resources.\n5 | A fellow student and I are racing to solve the same scientific puzzle.\n6 | I would do anything the guildmaster told me to do.\n\nFlaws\nd6 | Flaw\n1 | If there's a plan, I'll probably forget it. If I don't forget it, I'll probably ignore it.\n2 | I get bored easily, and if nothing is happening I'll make something happen.\n3 | Nothing is ever simple, and if it seems simple, I'll find a way to make it complicated.\n4 | I tend to ignore sleep for days when I'm conducting research, often at the expense of my own health and safety.\n5 | I'm convinced there's not a soul in Ravnica, except maybe the great Niv-Mizzet, who can match my boundless intellect.\n6 | I'm incapable of admitting a flaw in my logic."
                    },
                    {
                        "name": "Contacts",
                        "text": "The laboratories of the Izzet League are constantly starting up new projects and dissolving old ones, so it's easy for even the lowliest attendant to make friends (and enemies) in laboratories across Ravnica.\nRoll twice on the Izzet Contacts table (for an ally and a rival) and once on the Non-Izzet Contacts table.\nIzzet Contacts\nd8 | Contact\n1 | An older relative is a member of the guild's board of directors.\n2 | I know a sprite who carries important messages among the guild's laboratories.\n3 | A sibling is the head of a laboratory doing exotic research.\n4 | A former colleague is now an attendant in a laboratory in the central guildhall.\n5 | I'm in regular communication with an instructor who set me on the course of my life and research.\n6 | I had a romance with a chemister working in the Blistercoils.\n7 | As an attendant, I had a fierce rivalry with another attendant for our supervisor's attention.\n8 | The guildmaster, Niv-Mizzet, took note of one of my experiments!\n\nNon-Izzet Contacts\nd10 | Contact\n1 | An Azorius inspector seems interested in my work.\n2 | I was ready to join the Boros before I decided on Izzet, and I sometimes still hear from the sergeant who tried to recruit me.\n3 | One of my former assistants turned out to be a Dimir spy. We're not on friendly terms anymore, but we have a habit of running into each other.\n4 | A Golgari assassin killed a bitter rival of mine, leaving me with conflicted feelings.\n5 | I helped a minor Gruul chieftain acquire an Izzet weapon.\n6 | Roll an additional Izzet contact; you can decide if the contact is an ally or a rival.\n7 | An Orzhov banker financed my laboratory's current work and expects great returns.\n8 | I have a cousin in the Cult of Rakdos, and we get along quite well.\n9 | A former attendant from the same laboratory ran off to join the Selesnya, and we get into a big argument every time we run into each other.\n10 | I compare notes and techniques with a Simic scientist over lunch sometimes."
                    },
                    {
                        "name": "How Do I Fit In?",
                        "text": "Whatever your role in the Izzet League, you are expected to contribute to its research in some way. That contribution might involve participating in tests, whether as an assistant, a researcher, or a subject. You might be one of the soldiers who protects a laboratory, or a laborer responsible for lifting heavy pieces of equipment into place. Everyone's contribution matters, even if the Izzet know that some matter more than others."
                    }
                ]
            },
            {
                "name": "Orzhov Representative",
                "proficiency": "Intimidation, Religion",
                "trait": [
                    {
                        "name": "Description",
                        "text": "The prospect of immense wealth is the promise of membership in the Orzhov Syndicate. All of the guild's endeavors channel wealth from Ravnican society into the ranks of the Orzhov—and concentrates the spoils at the top of the hierarchy. As a functionary in that system, your best hope is to claim as much as possible of the money that passes through your hands on its way up, so that you can work your way into a more prominent position.\nRegardless of your past and the wealth of your family, your initial status with the guild is near the bottom, until you have proven your value.\n• Skill Proficiencies: Intimidation, Religion\n• Languages: Two of your choice\n• Equipment: An Orzhov insignia, a foot-long chain made of ten gold coins, vestments, a set of fine clothes, and a belt pouch containing 1 pp (an Orzhov-minted 10-zino coin)\nSource: Guildmasters' Guide to Ravnica p. 72"
                    },
                    {
                        "name": "Feature: Leverage",
                        "text": "You can exert leverage over one or more individuals below you in the guild's hierarchy and demand their help as needs warrant. For example, you can have a message carried across a neighborhood, procure a short carriage ride without paying, or have others clean up a bloody mess you left in an alley. The DM decides if your demands are reasonable and if there are subordinates available to fulfill them. As your status in the guild improves, you gain influence over more people, including ones in greater positions of power."
                    },
                    {
                        "name": "Orzhov Guild Spells",
                        "text": "Prerequisite: Spellcasting or Pact Magic class feature\nFor you, the spells on the Orzhov Guild Spells table are added to the spell list of your spellcasting class. (If you are a multiclass character with multiple spell lists, these spells are added to all of them.)\nOrzhov Guild Spells\nSpell Level | Spells\nCantrip | friends, guidance\n1st | command, illusory script\n2nd | enthrall, ray of enfeeblement, zone of truth\n3rd | bestow curse, speak with dead, spirit guardians\n4th | blight, death ward, Leomund's secret chest\n5th | geas\n\nYour magic tends to manifest as swirling shadows, brilliant light, or sometimes the momentary appearance of shadowy spirit forms. Your spells might draw the blood of your enemies, or even directly touch their souls."
                    },
                    {
                        "name": "Suggested Characteristics",
                        "text": "Members of the Orzhov Syndicate range from the decadent nobility at the top of the oligarchy to the debt-ridden wretches at the bottom. You fall somewhere between those extremes, so you might behave with the arrogance of the very rich or the humility of the impoverished.\nPersonality Traits\nd8 | Personality Trait\n1 | I am always willing to act in accordance with the financial incentive offered.\n2 | Debts are never meant to be forgiven.\n3 | I am accustomed to enjoying the finest pleasures money can buy.\n4 | No one could doubt that I am a cut above the masses of pitiful peasants that infest the city.\n5 | I can't stand to spend a zib more than necessary to purchase what I need.\n6 | I hate it when people try to make light of a serious situation.\n7 | I want to make sure everyone is aware of how wealthy, powerful, and important I am.\n8 | I can't think of anything to look forward to.\n\nIdeals\nd6 | Ideal\n1 | Guild. My guild is all that really matters. (Any)\n2 | Wealth. I will do whatever it takes to become as rich as the oligarchs. (Evil)\n3 | Power. One day, I will be the one giving orders. (Evil)\n4 | Prestige. I want to be admired, respected, feared, or even hated for my position and wealth. (Evil)\n5 | Stability. The economy functions best when chaos is kept under control and everyone knows their place. (Lawful)\n6 | Eternity. I want to live forever—in the flesh as long as possible, and as a spirit afterward. (Any)\n\nBonds\nd6 | Bond\n1 | The unbearable weight of my debt has driven me to desperation.\n2 | I'm duty-bound to obey the dictates of an ancestor on the Ghost Council.\n3 | I value my worldly goods more highly than my mortal life.\n4 | An oligarch publicly humiliated me, and I will exact revenge on that whole family.\n5 | My faith in the Obzedat never wavers.\n6 | I want to prove myself more worthy than an older sibling and thereby ensure that I inherit a greater share of my parents' wealth.\n\nFlaws\nd6 | Flaw\n1 | I hold a scandalous secret that could ruin my family forever—but could also earn me the favor of the Ghost Council.\n2 | I'm convinced that everyone I know is plotting against me.\n3 | I'll brave any risk if the monetary reward is great enough.\n4 | I am convinced that I am far more important than anyone else is willing to acknowledge.\n5 | I have little respect for anyone who isn't wealthy.\n6 | I'll take any opportunity to steal from wealthier people, even for worthless trinkets."
                    },
                    {
                        "name": "Contacts",
                        "text": "The Orzhov Syndicate operates according to a strict hierarchy built on a network of connections among old, wealthy families. Your family might provide important contacts, while your family's activities in crime, banking, or debt collection could tie you to members of other guilds.\nRoll twice on the Orzhov Contacts table (for an ally and a rival) and once on the Non-Orzhov Contacts table.\nOrzhov Contacts\nd8 | Contact\n1 | The spirit of an ancestor has taken an interest in me.\n2 | An older cousin has the ear of a powerful oligarch.\n3 | I know a knight who is responsible for collecting debts from powerful people.\n4 | A vampire pontiff tried to use me as a pawn in past schemes.\n5 | A silent spirit follows me around.\n6 | A sibling has keys to parts of Vizkopa Bank.\n7 | A giant thinks I'm adorable.\n8 | I regularly offer tribute to an angel, and the angel has been kind to me in turn.\n\nNon-Orzhov Contacts\nd10 | Contact\n1 | An Azorius arrester is always snooping into my family's business transactions.\n2 | A Boros paladin saved my life, to my everlasting shame.\n3 | I know a shopkeeper who is secretly a Dimir agent and tries to make sure that I keep that secret hidden.\n4 | I'm fascinated by the culture of the Golgari kraul, and I have formed a friendship with one of their death priests.\n5 | A Gruul druid hates me but would never dare to touch me.\n6 | I know an Izzet engineer who is desperate to pay off a debt accrued by a deceased relative.\n7 | Roll an additional Orzhov contact; you can decide if the contact is an ally or a rival.\n8 | My childhood friend is now a Rakdos torturer. We still meet for drinks occasionally.\n9 | I have the key to a vault where a Selesnya druid is hiding an item of secret shame.\n10 | I was married to a Simic bioengineer."
                    },
                    {
                        "name": "How Do I Fit In?",
                        "text": "The structure of the Orzhov Syndicate means that you are always doing the bidding of someone higher up the ladder than you are. Ultimately, your role in the guild is defined by whatever the people (and spirits) above you decide for you.\nFor most of your career, you can expect to engage in some aspect of the day-to-day criminal operations of the guild. That can mean throwing your weight around to enforce the will of the guild or using religious authority to extort offerings from the people. But it can also mean doing various errands for your superiors, from bearing messages to carrying out assassinations."
                    }
                ]
            },
            {
                "name": "Rakdos Cultist",
                "proficiency": "Acrobatics, Performance",
                "trait": [
                    {
                        "name": "Description",
                        "text": "You're an entertainer at heart, a performer with a flair for the dramatic and a love of the spotlight. You've spent years honing your craft, mastering a demanding set of skills so you can perform them with panache and make them look easy. The wild applause, the screams of the crowds, the mayhem and terror spreading into the streets—this is what you live for.\nYou're also a member of a cult devoted to an ancient demon who delights in violence and chaos. It just so happens that Rakdos loves a good show, and your highest aspiration is to please the Defiler, the Lord of Riots, with your own performance.\n• Skill Proficiencies: Acrobatics, Performance\n• Tool Proficiencies: One type of musical instrument\n• Languages: Choose either Abyssal or Giant\n• Equipment: A Rakdos insignia, a musical instrument (one of your choice), a costume clothes, a hooded lantern made of wrought iron, a 10-foot length of chain with sharply spiked links, a tinderbox, 10 torch, a set of common clothes, a belt pouch containing 10 gp (a mix of Azorius and Boros 1-zino coins), and a bottle of sweet, red juice\nSource: Guildmasters' Guide to Ravnica p. 79"
                    },
                    {
                        "name": "A Flair for the Dramatic",
                        "text": "Rakdos performance styles typically fuse standard circus-style acrobatics with fire, wrought-iron spikes and hooks, and monsters. You can roll a d8 or choose from the options in the Performance Options table to determine your preferred style of performance.\nPerformance Options\nd8 | Type of Performer\n1 | Spikewheel acrobat\n2 | Lampooning satirist\n3 | Fire juggler\n4 | Marionette puppeteer\n5 | Pain artist\n6 | Noise musician\n7 | Nightmare clown\n8 | Master of ceremonies"
                    },
                    {
                        "name": "Feature: Fearsome Reputation",
                        "text": "People recognize you as a member of the Cult of Rakdos, and they're careful not to draw your anger or ridicule. You can get away with minor criminal offenses, such as refusing to pay for food at a restaurant or breaking down a door at a local shop, if no legal authorities witness the crime. Most people are too daunted by you to report your wrongdoing to the Azorius."
                    },
                    {
                        "name": "Rakdos Guild Spells",
                        "text": "Prerequisite: Spellcasting or Pact Magic class feature\nFor you, the spells on the Rakdos Guild Spells table are added to the spell list of your spellcasting class. (If you are a multiclass character with multiple spell lists, these spells are added to all of them.)\nRakdos Guild Spells\nSpell Level | Spells\nCantrip | fire bolt, vicious mockery\n1st | burning hands, dissonant whispers, hellish rebuke\n2nd | crown of madness, enthrall, flaming sphere\n3rd | fear, haste\n4th | confusion, wall of fire\n5th | dominate person\n\nYour magic often produces a flashy spectacle, wreathing you or your targets in a mixture of harmless flame and shadowy shapes. When you manipulate an opponent's mind, a flaming symbol of Rakdos might momentarily appear like a mask over the target's face."
                    },
                    {
                        "name": "Suggested Characteristics",
                        "text": "Members of demonic cults aren't generally known as the kindest or most mentally stable individuals, so you're likely to have something in your nature that distinguishes you from the law-abiding citizens of Ravnica.\nPersonality Traits\nd8 | Personality Trait\n1 | I revel in mayhem, the more destructive the better.\n2 | When violence breaks out, I lose myself in rage, and it's sometimes hard to stop.\n3 | Everything is funny to me, and the most hilarious and bloodiest things leave me cackling with sadistic glee.\n4 | I derive genuine pleasure from the pain of others.\n5 | I enjoy testing other people's patience.\n6 | I can't stand it when things are predictable, so I like to add a little chaos to every situation.\n7 | I throw my weight around to make sure I get my way.\n8 | I enjoy breaking delicate works of art. And fingers, which are sort of the same.\n\nIdeals\nd6 | Ideal\n1 | Guild. My guild is all that really matters. (Any)\n2 | Hedonism. Death comes for everyone, so take as much pleasure as you can from every moment of life. (Neutral)\n3 | Creativity. I strive to find more ways to express my art through pain—my own as well as others'. (Chaotic)\n4 | Freedom. No one tells me what to do. (Chaotic)\n5 | Equality. I want to see Ravnica remade, with no guilds and no hierarchies. (Chaotic)\n6 | Spectacle. People are inspired by the greatness they see in art. (Any)\n\nBonds\nd6 | Bond\n1 | I have belonged to the same performance troupe for years, and these people mean everything to me.\n2 | A blood witch told me I have a special destiny to fulfill, and I'm trying to figure out what it is.\n3 | I'm secretly hoping that I can change the cult from the inside, using my influence to help rein in the wanton violence.\n4 | I own something that Rakdos once touched (it's seared black at the spot), and I cherish it.\n5 | I want to be better at my chosen form of performance than any other member of my troupe.\n6 | I am devoted to Rakdos and live to impress him.\n\nFlaws\nd6 | Flaw\n1 | My family is prominent in another guild. I enjoy my wild life, but I don't want to embarrass them.\n2 | I couldn't hide my emotions and opinions even if I wanted to.\n3 | I throw caution to the wind.\n4 | I resent the rich and powerful.\n5 | When I'm angry, I lash out in violence.\n6 | There's no such thing as too much pleasure."
                    },
                    {
                        "name": "Contacts",
                        "text": "The Cult of Rakdos is anything but organized. Individuals frequently move from one performance troupe to another. Almost all members of the cult know former castmates now in different troupes, which allows for the possibility of a widespread network of contacts.\nRoll twice on the Rakdos Contacts table (for an ally and a rival) and once on the Non-Rakdos Contacts table.\nRakdos Contacts\nd8 | Contact\n1 | I was part of a two-person act until my former partner moved to a different troupe.\n2 | My sibling and I ran away from home and joined the Cult of Rakdos together. We're very close.\n3 | A childhood friend of mine is an attendant in Rix Maadi, the Rakdos guildhall.\n4 | My parents brought me into the guild and taught me my trade.\n5 | There's a lesser demon in the cult who thinks he owes me a favor, and who am I to argue?\n6 | The master of ceremonies in my troupe is well connected with other troupes.\n7 | I had a romance with a pain artist in another troupe.\n8 | Rakdos himself has witnessed me perform.\n\nNon-Rakdos Contacts\nd10 | Contact\n1 | I know an Azorius elocutor who has a very amusing dark side.\n2 | A Boros captain really wants to \"redeem\" me.\n3 | I think a member of my troupe is a Dimir agent.\n4 | I once convinced a Golgari medusa to participate in a show. We've been on good terms ever since.\n5 | I came from the Gruul and still have relatives there.\n6 | An Izzet technician provides pyrotechnics for my performances.\n7 | An Orzhov oligarch has taken an interest in my career, like a patron of the arts.\n8 | Roll an additional Rakdos contact; you can decide if the contact is an ally or a rival.\n9 | A Selesnya healer attends my performances regularly.\n10 | A Simic biomancer provides mutant monsters to add a taste of the bizarre to our shows."
                    },
                    {
                        "name": "How Do I Fit In?",
                        "text": "The Cult of Rakdos encourages independent action on the part of its members. Its goal is fomenting chaos, and it firmly believes in putting its own house in disorder before carrying that mission into the larger city. So your role is to execute your vision of grand satire and disruptive performance art, as you aspire to outdo your guild mates and attract the attention of Rakdos himself.\nYou work as part of a troupe, with your artistic talents used in service to a ringmaster's vision. But your performance is your own, and no one expects you to follow a script. In fact, if you go through a performance without doing something you haven't done before, you're clearly not trying hard enough."
                    }
                ]
            },
            {
                "name": "Selesnya Initiate",
                "proficiency": "Nature, Persuasion",
                "trait": [
                    {
                        "name": "Description",
                        "text": "You are a member of a blessed community, built on the ideals of harmony. Here, nature and civilization coexist peacefully, living and growing in accordance with the will of the Worldsoul, Mat'Selesnya. As a member of the Selesnya Conclave, you are surrounded by people and other creatures who share your worldview and your longing for deeper spiritual communion with the world, and you have a fervent desire to share the joy you have experienced with Ravnica. Along with the rest of the conclave, you are committed to resisting the ambitions of the other guilds—with military force if necessary.\n• Skill Proficiencies: Nature, Persuasion\n• Tool Proficiencies: One type of artisan's tools or one musical instrument\n• Languages: Choose one of Elvish, Loxodon, or Sylvan\n• Equipment: A Selesnya insignia, a healer's kit, robes, a set of common clothes, and a belt pouch containing 5 gp (Azorius 1-zino coins)\nSource: Guildmasters' Guide to Ravnica p. 86"
                    },
                    {
                        "name": "Feature: Conclave's Shelter",
                        "text": "As a member of the Selesnya Conclave, you can count on your guild mates to provide shelter and aid. You and your companions can find a place to hide or rest in any Selesnya enclave in the city, unless you have proven to be a danger to them. The members of the enclave will shield you from the law or anyone else searching for you, though they will not risk their lives in this effort.\nIn addition, as a guild member you can receive free healing and care at a Selesnya enclave, though you must provide any material components needed for spells."
                    },
                    {
                        "name": "Selesnya Guild Spells",
                        "text": "Prerequisite: Spellcasting or Pact Magic class feature\nFor you, the spells on the Selesnya Guild Spells table are added to the spell list of your spellcasting class. (If you are a multiclass character with multiple spell lists, these spells are added to all of them.)\nSelesnya Guild Spells\nSpell Level | Spells\nCantrip | druidcraft, friends\n1st | animal friendship, charm person\n2nd | aid, animal messenger, calm emotions, warding bond\n3rd | plant growth, speak with plants\n4th | aura of life, conjure minor elementals\n5th | awaken, commune with nature\n\nMembers of the Selesnya Conclave refer to their magic as \"doruvati,\" a Sylvan word meaning \"gift.\" When you use these gifts of Mat'Selesnya, graceful swirls of green and silver light dance in the air around you, and phantasmal green leaves might waft through the air. A sensation of gentle warmth and the smell of spring flowers or autumn leaves might accompany your spells."
                    },
                    {
                        "name": "Suggested Characteristics",
                        "text": "Most members of the Selesnya Conclave are true believers—the tight-knit community allows little room for the cynical or disillusioned. They are spiritual, empathetic, and generally peaceful—unless roused to action. Their flaws and bonds alike grow naturally from their close ties to the community.\nPersonality Traits\nd8 | Personality Trait\n1 | I never raise my voice or lose my temper.\n2 | I feel the pains and joys of everyone around me, friend or foe.\n3 | I would rather make a friend than thwart an enemy.\n4 | I'm always straining to peer into another reality that seems to be just beyond my senses.\n5 | I'm uneasy if I can't see plants growing or feel soil beneath my feet.\n6 | Seeing illness or injury in any creature saddens me.\n7 | I have much to be proud of, but I am still just one strand in the grand, interwoven tapestry of life.\n8 | Nature offers rich and abundant metaphors for understanding the complexities of life.\n\nIdeals\nd6 | Ideal\n1 | Guild. My guild is all that really matters. (Any)\n2 | Harmony. Nothing is more beautiful than voices and actions aligned in common purpose. (Good)\n3 | Order. Like a well-pruned tree, society thrives when everything is kept in good order. (Lawful)\n4 | Life. Preserving life and nature is always a worthwhile endeavor. (Good)\n5 | Humility. Ambition and pride are the roots of strife. (Good)\n6 | Evangelism. When all have joined the Selesnya Conclave, Ravnica will finally know peace. (Any)\n\nBonds\nd6 | Bond\n1 | I would give my life in the defense of the small enclave where I first encountered Mat'Selesnya.\n2 | I love beasts and plants of all kinds, and am loath to harm them.\n3 | A healer nursed me to recovery from a mortal illness.\n4 | I'll sing the invitation of Mat'Selesnya with my dying breath.\n5 | I cherish a leaf from Vitu-Ghazi that changes color with the seasons, even though it is no longer attached to the tree.\n6 | Every member of the conclave is my kin, and I would fight for any one of them.\n\nFlaws\nd6 | Flaw\n1 | I'm terrified of getting into a fight where my side is outnumbered.\n2 | I assume that people mean well until they prove otherwise.\n3 | I enjoy comfort and quiet, and prefer to avoid extra effort.\n4 | I have a fierce temper that doesn't reflect the inner calm I seek.\n5 | I'm convinced that everyone else in the conclave has a deeper connection to the Worldsoul than I do.\n6 | I'm trying to atone for the life of crime I led before I joined the Selesnya, but I find it hard to give up my bad habits."
                    },
                    {
                        "name": "Contacts",
                        "text": "The Selesnya Conclave is all about connections, so its members cultivate contacts throughout the guild. The guild also engages in energetic recruitment to draw converts from other guilds, and often these new guild members maintain friendships with former guild mates.\nRoll twice on the Selesnya Contacts table (for an ally and a rival) and once on the Non-Selesnya Contacts table.\nSelesnya Contacts\nd8 | Contact\n1 | A wise centaur trainer believed in me even though I was a terrible student.\n2 | A good friend has risen to become a Ledev guardian.\n3 | I left my former guild and joined the Selesnya along with a close friend.\n4 | The dryad at the head of my enclave has taken an interest in my activities.\n5 | A sibling is an instructor at the guild's training grounds.\n6 | One of my parents is a votary, tasked with protecting the temple gardens at the Vitu-Ghazi guildhall.\n7 | I had a romance with a well-known Selesnya healer.\n8 | Trostani, the head of the guild and the voice of Mat'Selesnya, once welcomed me into her presence.\n\nNon-Selesnya Contacts\nd10 | Contact\n1 | I left the Azorius, and a former colleague still resents me for that act.\n2 | A good friend, eager for action, left the Selesnya and joined the Boros.\n3 | I had a relationship with a guild mate who turned out to be a Dimir agent.\n4 | I know a disgruntled Golgari assassin who is ripe for recruitment.\n5 | I'm friendly with a Gruul centaur who almost joined us a few years back.\n6 | I once had a heated public argument with an Izzet chemister, and neither of us is allowed back into that restaurant.\n7 | I paid off my debt to the Orzhov Syndicate, but my good friend was not so lucky and remains indebted to that guild.\n8 | At a time of terrible grief in my life, a Rakdos performer made a mockery of my pain, leaving me with mixed feelings of sadness and humor.\n9 | Roll an additional Selesnya contact; you can decide if the contact is an ally or a rival.\n10 | I have a sibling in the Simic Combine, and we argue every time we see each other."
                    },
                    {
                        "name": "How Do I Fit In?",
                        "text": "Although the guild teaches the importance of subjugating the individual will to the good of the conclave, it also celebrates the diversity of individuals, in the same sense that a field that produces different crops is healthier than one that yields a single crop. That principle applies to your skills as an adventurer. As long as your efforts are directed toward advancing the goals of the guild rather than your private agenda, you're allowed to put your talents to work in your unique way.\nThat said, you must never lose sight of the fact that you are part of a larger community. That includes the whole guild, of course, but your ties to community start with your vernadi (enclave) and its voda (dryad leader). The dryads want to know what you're doing and what purpose it serves, and they act to curtail your actions—or even expel you from the guild—if they determine that you aren't serving Selesnya's best interests."
                    }
                ]
            },
            {
                "name": "Simic Scientist",
                "proficiency": "Arcana, Medicine",
                "trait": [
                    {
                        "name": "Description",
                        "text": "Imagine a perfect world: one in which nature and civilization exist in harmony, adapted to each other; one in which life is shaped to match its environment and the environment is shaped to match life. That's the world you have been trying to grow in the laboratories of the Simic Combine. Nature is all about adaptation, evolution, and balance—but for it to keep up with the pace of advancing civilization, nature needs some help from biomancers and terraformers. If, along the way, you happen to create super-soldiers and mutant monsters that can bolster the combine's defenses against the schemes and ambitions of the other guilds, so much the better.\n• Skill Proficiencies: Arcana, Medicine\n• Languages: Two of your choice\n• Equipment: A Simic insignia, a set of common clothes, a book of research notes, an ink pen, a Ink (1-ounce bottle), a oil (flask) (made from blubber), a acid (vial) (derived from digestive juices), a vial of fish scales, a vial of seaweed, a vial of jellyfish stingers, a glass bottle of unidentified slime, and a belt pouch containing 10 gp (Azorius 1-zino coins)\nSource: Guildmasters' Guide to Ravnica p. 93"
                    },
                    {
                        "name": "Clades and Projects",
                        "text": "As a Simic researcher, you are part of a clade—a diverse group of individuals combining disparate talents in pursuit of a common goal—or a researcher on a specialized, short-term project focused on addressing an immediate need. You can roll a d6 or choose from the options in the Research Options table to determine your area of research.\nResearch Options\nd6 | Clade/Project\n1 | Hull Clade, focused on protection and durability\n2 | Fin Clade, focused on movement\n3 | Gyre Clade, focused on cyclical patterns and metamagic\n4 | Guardian Project, focused on creating guard monsters and super soldiers\n5 | Crypsis Project, focused on intelligence and counterintelligence\n6 | Independent research in a new area"
                    },
                    {
                        "name": "Feature: Researcher",
                        "text": "When you attempt to learn or recall a magical or scientific fact, if you don't know that information, you know where and from whom you can obtain it. Usually, this information comes from a Simic laboratory, or sometimes from an Izzet facility, a library, a university, or an independent scholar or other learned person or creature. Knowing where the information can be found doesn't automatically enable you to learn it; you might need to offer bribes, favors, or other incentives to induce people to reveal their secrets.\nYour DM might rule that the knowledge you seek is secreted away in an inaccessible place, or that it simply can't be found. Unearthing the deepest secrets of the multiverse can require an adventure or even a whole campaign."
                    },
                    {
                        "name": "Simic Guild Spells",
                        "text": "Prerequisite: Spellcasting or Pact Magic class feature\nFor you, the spells on the Simic Guild Spells table are added to the spell list of your spellcasting class. (If you are a multiclass character with multiple spell lists, these spells are added to all of them.)\nSimic Guild Spells\nSpell Level | Spells\nCantrip | acid splash, druidcraft\n1st | detect poison and disease, expeditious retreat, jump\n2nd | alter self, enhance ability, enlarge/reduce\n3rd | gaseous form, water breathing, wind wall\n4th | freedom of movement, polymorph\n5th | creation\n\nWhen your magic causes physical alterations in yourself or others, the result often displays the characteristics of fish, amphibians, or other water-dwelling creatures. Blue-green eddies of magical energy sometimes accompany your spellcasting, forming spirals that reflect the mathematical perfection of nature."
                    },
                    {
                        "name": "Suggested Characteristics",
                        "text": "The bizarre science of the Simic Combine attracts a certain type of personality and encompasses a set of beliefs about the nature of life. Simic members' bonds and flaws derive from their scientific research—including their creation of new life forms, which they can become very attached to.\nPersonality Traits\nd8 | Personality Trait\n1 | I can't wait to see what I become next!\n2 | I am convinced that everything inclines toward constant improvement.\n3 | I'm eager to explain every detail of my most intricate experiments and theories to anyone who shows the least bit of interest.\n4 | I assume that everyone needs even the most basic concepts explained to them.\n5 | I describe everything that happens as if it were going into my research notes (and it often is).\n6 | I am insatiably curious about the seemingly infinite forms and adaptations of life.\n7 | I can't resist prying into anything forbidden, since it must be terribly interesting.\n8 | I employ a highly technical vocabulary to avoid imprecision and ambiguity in my communication.\n\nIdeals\nd6 | Ideal\n1 | Guild. My guild is all that really matters. (Any)\n2 | Change. All life is meant to progress toward perfection, and our work is to hurry it along—no matter what must be upended along the way. (Chaotic)\n3 | Knowledge. Understanding the world is more important than what you do with your knowledge. (Neutral)\n4 | Greater Good. I want to reshape the world into higher forms of life so that all can enjoy evolution. (Good)\n5 | Logic. It's foolish to let emotions and principles interfere with the conclusions of logic. (Lawful)\n6 | Superiority. My vast intellect and strength are directed toward increasing my sway over others. (Evil)\n\nBonds\nd6 | Bond\n1 | I helped create a krasis that I love like a pet and would carry with me everywhere... except it's the size of a building, and it might eat me.\n2 | In my laboratory, I discovered something that I think could eliminate half the life on Ravnica.\n3 | The other researchers in my clade are my family—a big, eccentric family including members and parts of many species.\n4 | The laboratory where I did my research contains everything that is precious to me.\n5 | I will get revenge on the shortsighted fool who killed my precious krasis creation.\n6 | Everything I do is an attempt to impress someone I love.\n\nFlaws\nd6 | Flaw\n1 | I have a rather embarrassing mutation that I do everything I can to keep hidden.\n2 | I'm more interested in taking notes on monstrous anatomy than in fighting monsters.\n3 | Every social situation I'm in seems to lead to my asking rude personal questions.\n4 | I'm supremely confident in my ability to adapt to any situation and handle any danger.\n5 | I'll take any risk to earn recognition for my scientific brilliance.\n6 | I have a tendency to take shortcuts in my research and any other tasks I have to complete."
                    },
                    {
                        "name": "Contacts",
                        "text": "The fluid nature of clades, whose rosters span different laboratories and change as researchers discover new interests, creates abundant connections among the Simic. The guild members live in watery sinkholes called zonots, and their isolation shelters them from much contact with outsiders. Nonetheless, a fair number of Simic members are former members of other guilds.\nRoll twice on the Simic Contacts table (for an ally and a rival) and once on the Non-Simic Contacts table.\nSimic Contacts\nd8 | Contact\n1 | My research builds on my parents' work and takes it in interesting new directions.\n2 | If a serious problem confounds me, I can count on my mentor to provide clarity of thought.\n3 | A former laboratory colleague went on to work on the Guardian Project.\n4 | A former colleague has ventured into fields of research that are possibly immoral and almost certainly illegal.\n5 | A former lover is now the supervisor of a prominent clade.\n6 | My sibling has become an almost unrecognizable mutant.\n7 | An old friend has retreated into a secluded life as an ascetic deepsage, devoted to contemplating philosophical principles.\n8 | My former clade supervisor is now engaged in field research studying some of the largest beasts and monsters on Ravnica.\n\nNon-Simic Contacts\nd10 | Contact\n1 | My older sibling is upset that I didn't follow them into the Azorius.\n2 | A Boros sergeant is always asking questions about my work, but I suspect they're genuinely curious.\n3 | A friend in my clade thinks I don't know they're a Dimir agent.\n4 | I helped a Golgari spore druid with the fertilization and growth of their fungus field.\n5 | I can't fathom what could have made my childhood friend run off and join the Gruul.\n6 | I love comparing notes with my friend in the Izzet, though our fields of research are very different.\n7 | I borrowed a lot of money from an Orzhov syndic to help finance my research.\n8 | A Rakdos ringmaster has taken an interest in my research which, come to think of it, might make a nice sideshow act.\n9 | I left the Selesnya—and a lover—behind when I joined the Simic.\n10 | Roll an additional Simic contact; you can decide if the contact is an ally or a rival."
                    },
                    {
                        "name": "How Do I Fit In?",
                        "text": "As a Simic adventurer, your mission likely aligns with the Adaptationist philosophy; the disagreements and tensions among the guilds will soon erupt into open conflict, and your guild needs your help to ensure that the Simic survive. That help might come in the form of defending against Golgari incursions into Simic zonots or shielding Simic research from Azorius intrusion. It could also involve more subtle, diplomatic work to maintain balance among the guilds, or subterfuge aimed at undermining another guild's grab for power.\nSelf-improvement is also an important part of your mission. Anything you can do to make yourself more capable—whether learning a new spell or adopting a new hybridizing mutation—gives the Simic a stronger weapon in its arsenal. The combine must change to survive, and that means individual members of the guild must grow and adapt as well."
                    }
                ]
            }
        ],
        "_version": "5",
        "_auto_indent": "NO"
    }
}
