{
    "compendium": {
        "monster": [
            {
                "name": "Decapus",
                "size": "L",
                "type": "monstrosity",
                "alignment": "Unaligned",
                "ac": "14 (natural armor)",
                "hp": "75 (10d10+20)",
                "speed": "walk 15 ft., climb 30 ft.",
                "str": "15",
                "dex": "14",
                "con": "14",
                "int": "4",
                "wis": "10",
                "cha": "7",
                "save": "",
                "skill": "Athletics +4, Perception +2, Stealth +4",
                "passive": "12",
                "languages": "",
                "cr": "4",
                "resist": "",
                "immune": "",
                "vulnerable": "",
                "conditionImmune": "",
                "senses": "darkvision 60 ft.",
                "action": [
                    {
                        "name": "Multiattack",
                        "text": "The decapus makes two attacks: one with its bite and one with its tentacles."
                    },
                    {
                        "name": "Bite",
                        "text": "Melee Weapon Attack: +4 to hit, reach 5 ft., one creature grappled by the decapus. 7 (2d4 + 2) piercing damage.",
                        "attack": "Bite|+4|2d4+2"
                    },
                    {
                        "name": "Tentacles",
                        "text": "Melee Weapon Attack: +4 to hit, reach 10 ft., one target. 24 (9d4 + 2) bludgeoning damage or 14 (5d4 + 2) bludgeoning damage if the decapus is grappling a creature other than the target or if the decapus is on the ground or floor. The target is also grappled (escape DC 14) unless the decapus is already grappling a creature. Until this grapple ends, the target is restrained.",
                        "attack": "Tentacles|+4|9d4+2"
                    }
                ],
                "description": "Decapuses are carnivorous, solitary hunters that swing through trees, scooping up prey with their 10-foot-long, suckered tentacles. Decapuses also use their tentacles to climb walls and ceilings.\nAfter securing a high vantage point, a decapus hangs by one tentacle and attacks with the other nine. On the ground, a decapus is slower and less dangerous. It must use half of its tentacles to support its weight upright, leaving five tentacles with which it can attack and defend itself.\nMarine Decapus. A marine decapus is similar to its land-dwelling cousin, except that it gains a swimming speed of 30 feet and can breathe only underwater.\nSource: The Tortle Package p. 21",
                "environment": ""
            },
            {
                "name": "Geonid",
                "size": "S",
                "type": "elemental",
                "alignment": "Neutral",
                "ac": "17 (natural armor)",
                "hp": "26 (4d6+12)",
                "speed": "walk 30 ft.",
                "str": "12",
                "dex": "10",
                "con": "16",
                "int": "9",
                "wis": "14",
                "cha": "11",
                "save": "",
                "skill": "Perception +4, Stealth +2",
                "passive": "14",
                "languages": "",
                "cr": "1/4",
                "resist": "",
                "immune": "",
                "vulnerable": "",
                "conditionImmune": "",
                "senses": "darkvision 60 ft., tremorsense 30 ft.",
                "trait": {
                    "name": "Boulder Guise",
                    "text": "While fully withdrawn into its shell, the geonid can't see and is indistinguishable from a small boulder"
                },
                "action": [
                    {
                        "name": "Club",
                        "text": "Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 3 (1d4 + 1) bludgeoning damage.",
                        "attack": "Club|+3|1d4+1"
                    },
                    {
                        "name": "Stone Tell",
                        "text": "The geonid touches a stone object or surface and knows what types of creatures have been within 10 feet of that stone in the past 24 hours. The geonid can also determine the number of creatures of each type, but not their identities."
                    }
                ],
                "description": "Also known as rocklings and rock hermits, geonids are small, intelligent cave dwellers that originated on the Elemental Plane of Earth. A geonid's arms and legs come out of a small opening in the bottom of its shell. A geonid can draw its limbs into its shell and close the opening. When it does so, the creature looks like a small boulder. In this state, the geonid can't see and relies on its tremorsense to detect other creatures nearby.\nDark Lairs. Geonids live in natural tunnels and caves. They feed primarily on lizards, rats, slugs, and other vermin, as well as on cave lichen and moss. Geonids like to collect coins and gemstones, and they rarely confront creatures larger than themselves except to rob them or scare them away.\nStone Tell. Geonids can attune to stone in a way that lets them discern what other creatures have been in the area recently. Geonids use this ability to track prey and to determine whether other creatures have trespassed in their territory. The information gleaned is imprecise and doesn't include the specific identities of such creatures or the precise times when they passed nearby.\nSource: The Tortle Package p. 22",
                "environment": ""
            },
            {
                "name": "Giant Slug",
                "size": "L",
                "type": "monstrosity",
                "alignment": "Unaligned",
                "ac": "13 (natural armor)",
                "hp": "66 (6d10+18)",
                "speed": "walk 10 ft., climb 10 ft.",
                "str": "14",
                "dex": "13",
                "con": "16",
                "int": "1",
                "wis": "12",
                "cha": "5",
                "save": "",
                "skill": "Perception +3",
                "passive": "13",
                "languages": "Abyssal, Aquan, Common",
                "cr": "3",
                "resist": "",
                "immune": "",
                "vulnerable": "",
                "conditionImmune": "",
                "senses": "darkvision 60 ft.",
                "trait": [
                    {
                        "name": "Keen Smell",
                        "text": "The slug has advantage on Wisdom (Perception) checks that rely on smell."
                    },
                    {
                        "name": "Spider Climb",
                        "text": "The slug can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."
                    },
                    {
                        "name": "Innate Spellcasting",
                        "text": [
                            "The slug's innate spellcasting ability is Wisdom (spell save DC 11, +3 to hit with spell attacks). It can innately cast the following spells, requiring no material components:",
                            "1/day each: guiding bolt, sanctuary, spiritual weapon"
                        ]
                    }
                ],
                "action": [
                    {
                        "name": "Multiattack",
                        "text": "The slug makes two attacks: one with its tentacles and one with its bite."
                    },
                    {
                        "name": "Tentacles",
                        "text": "Melee Weapon Attack: +8 to hit, reach 10 ft., one creature. 4 (1d4 + 2) poison damage, and the target must succeed on a DC 13 Constitution saving throw or be poisoned for 1 minute. Until this poison ends, the target is paralyzed. The target can repeat the saving throw at the end of each of its turns, ending the poison on itself on a success.",
                        "attack": "Tentacles|+8|1d4+2"
                    },
                    {
                        "name": "Bite",
                        "text": "Melee Weapon Attack: +4 to hit, reach 5 ft., one target. 7 (2d4 + 2) piercing damage.",
                        "attack": "Bite|+4|2d4+2"
                    }
                ],
                "reaction": {
                    "name": "Animate Tentacle",
                    "text": "When the slug takes damage in this cave (Shrine of Umberlee), it can use its reaction to animate one of the tentacles of the kraken statue and cause it to make a melee weapon attack (+3 to hit) against one creature within 20 feet of the statue that the slug can see. The tentacle deals 8 (1d8 + 4) bludgeoning damage on a hit."
                },
                "spells": "guiding bolt, sanctuary, spiritual weapon",
                "description": "Source: The Tortle Package p. 18",
                "environment": ""
            },
            {
                "name": "Topi",
                "size": "S",
                "type": "undead",
                "alignment": "Chaotic Evil",
                "ac": "13 (natural armor)",
                "hp": "13 (3d6+3)",
                "speed": "walk 30 ft.",
                "str": "7",
                "dex": "15",
                "con": "12",
                "int": "6",
                "wis": "10",
                "cha": "5",
                "save": "",
                "skill": "",
                "passive": "10",
                "languages": "understands the languages it knew in life but can't speak",
                "cr": "1/2",
                "resist": "bludgeoning",
                "immune": "poison",
                "vulnerable": "",
                "conditionImmune": "poisoned",
                "senses": "darkvision 60 ft.",
                "trait": [
                    {
                        "name": "Turn Resistance",
                        "text": "The topi has advantage on saving throws against any effect that turns undead."
                    },
                    {
                        "name": "Undead Fortitude",
                        "text": "If damage reduces the topi to 0 hit points, it must make a Constitution saving throw with a DC of 5+the damage taken, unless the damage is radiant or from a critical hit. On a success, the topi drops to 1 hit point instead."
                    }
                ],
                "action": {
                    "name": "Venomous Claws",
                    "text": "Melee Weapon Attack: +4 to hit, reach 5 ft., one target. 4 (1d4 + 2) slashing damage plus 2 (1d4) poison damage, and the target must succeed on a DC 11 Constitution saving throw or be poisoned until the end of the target's next turn.",
                    "attack": "Venomous Claws|+4|1d4+2"
                },
                "description": "Topis are similar to zombies. Before a topi is animated, its corpse is shrunk until it stands only 2 feet tall, and its heart is cut out and replaced with a leather bag that contains a live poisonous snake. The snake requires neither air nor sustenance, and it magically renders the topi's claws venomous. When a topi dies, the snake inside it dies too. The process of creating a topi is known only to a handful of evil priests and necromancers.\nTopis are more difficult to turn than ordinary zombies, and their spongy bodies make them resistant to bludgeoning.\nUndead Traits. A topi doesn't require air, food, drink, or sleep.\nSource: The Tortle Package p. 22",
                "environment": ""
            }
        ],
        "_version": "5",
        "_auto_indent": "NO"
    }
}
