{
    "compendium": {
        "item": [
            {
                "name": "Barrier Peaks Trinket",
                "detail": "Adventuring Gear",
                "type": "G",
                "weight": "",
                "property": "",
                "text": "At any point while the characters are searching through unusual equipment or detritus in the Monastery of the Distressed Body or the city of Daoine Gloine, roll on the following table to determine what they find. Each character finds one Barrier Peaks trinket over the course of the adventure.\nBarrier Peaks Trinkets\nd100 | Trinket\n01–02 | A handheld device containing a glowing green gem that darkens when no oxygen is present\n03–04 | A foot-long, egg-shaped object made from stitched leather\n05–06 | A black metal cylinder that dictates the history of an unknown plant or animal species when held\n07–08 | A cylindrical jar containing a pickled crustacean of unknown origin\n09–10 | A small thumb-button storage cylinder that releases a useless iron key when pressed\n11–12 | An unusual heraldic cloak pin that emits a short musical fanfare when tapped\n13–14 | A handheld tube that sucks in dust when squeezed and captures it in a detachable compartment\n15–16 | A scintillating disk of unknown material\n17–18 | A dial that can be twisted to slowly click back to its origin, whereupon it emits a loud ringing noise\n19–20 | A hovering, apple-sized orb of metal that follows you around\n21–22 | The petrified cocoon of an unknown insect\n23–24 | A bronze gauntlet set with many slots, and which violently expels any object pressed into those slots\n25–26 | A box that plays an illusory message in an unknown language when opened\n27–28 | A rod that causes you to forget the last five minutes when you press a button near its tip\n29–30 | A palm-sized cylinder that emits a harmless ray of glowing blue light when squeezed\n31–32 | A bead that suppresses your hearing when secreted inside either ear, causing you to be deafened\n33–34 | An amulet that displays your current health as a green bar above your head, with the bar retracting as your hit point total decreases\n35–36 | A casket containing one hundred tasteless blue pills that produce no discernible effect when swallowed\n37–38 | A metal mechanical puzzle with no apparent solution\n39–40 | A metal spinning top that never tips over when spun\n41–42 | Two strips of cloth-like material, each coated with a soft, hair-like fuzz on one side\n43–44 | A simple wire pyramid that preserves any foodstuffs it is placed over\n45–46 | A star chart labeled in an unknown script\n47–48 | A rectangle of black glass that displays indecipherable arcane runes when you swipe your finger across it\n49–50 | A schematic that shows the inner workings of an impossibly complex device\n51–52 | An odd pair of comfortable shoes made from supple, multicolored material\n53–54 | A mirror that makes you appear more beautiful when you tap your reflection\n55–56 | A mechanical metal puppy that playfully follows you around when activated\n57–58 | A talking bracelet that speaks only to correct your grammar\n59–60 | A bar of soap that can remove any stain\n61–62 | A journal in Common, written by someone in a world similar to but not quite the same as your own\n63–64 | A tub containing one serving of disgusting but nutritious goop that refills itself slowly over the course of one week\n65–66 | An instruction manual for activating a mysterious, world-destroying device\n67–68 | A small supple disk that displays weird moving symbols when placed over either eye\n69–70 | A tiny desk set with large, colorful buttons, each of which plays a discordant musical fanfare when pressed\n71–72 | A pair of tinted spectacles that reduce the glare of the sun when worn\n73–74 | An inflatable bedroll made from an unknown material, and which slowly deflates when used\n75–76 | A rod tipped with a blunt metal pincer whose grip can be adjusted by turning a screw\n77–78 | A battered helmet with a transparent orange visor that flips into place when donned\n79–80 | An animated map of a mysterious city that appears to be tracking the movements of five creatures\n81–82 | A cylinder of mist that holds your hair perfectly in shape when sprayed onto your head\n83–84 | A talking wand that tells you the name of any plant you point it at\n85–86 | A metal bracelet that displays the number of steps you've taken since your last long rest\n87–88 | A tiny handheld device that projects a glowing dot onto whatever you point it at\n89–90 | A rectangular piece of glass that displays a twelve-digit countdown on its surface\n91–92 | A wall chart of mysterious formulae arranged into a color-coded grid\n93–94 | A handheld device that solves any math problem you input using its buttons\n95–96 | A ball of speckled brown fur that appears to be alive\n97–98 | A complicated crystal board game that you don't know how to play\n99–00 | A large glass rectangle that displays a storm of black and white patterns when you press a button on its underside\nSource: Lost Laboratory of Kwalish p. 7"
            },
            {
                "name": "Deck of Several Things",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "",
                "property": "",
                "text": "Stored in a leather pouch, this unique deck contains twenty-two colored cards made of some strong but unknown metal, each of which features a design printed as a mosaic of raised dots. Before you draw a card, you must declare how many cards you intend to draw and then draw them randomly (you can use an altered deck of playing cards to simulate the deck). Any cards drawn in excess of this number have no effect. Otherwise, as soon as you draw a card from the deck, its magic takes effect. You must draw each card no more than 1 hour after the previous draw. If you fail to draw the chosen number, the remaining number of cards fly from the deck on their own and take effect all at once.\nOnce a card is drawn, it fades from existence. Unless the card is the Fool or the Jester, the card reappears in the deck, making it possible to draw the same card twice.\n1d22 | Card\n1 | Vizier\n2 | Sun\n3 | Moon\n4 | Star\n5 | Comet\n6 | The Fates\n7 | Throne\n8 | Key\n9 | Knight\n10 | Gem\n11 | Talons\n12 | The Void\n13 | Flames\n14 | Skull\n15 | Idiot\n16 | Donjon\n17 | Ruin\n18 | Euryale\n19 | Rogue\n20 | Balance\n21 | Fool\n22 | Jester\nBalance: Your mind suffers a wrenching alteration, causing your alignment to change for the duration of the adventure. Lawful becomes chaotic, good becomes evil, and vice versa. If you are true neutral or unaligned, this card has no effect on you.\nComet: If you single-handedly defeat the next hostile monster or group of monsters you encounter, you have advantage on ability checks made using one skill of your choice for the duration of the adventure. Otherwise, this card has no effect.\nDonjon: You are instantly teleported to and confined within the prison of the Monastery of the Distressed Body (area M6). Everything you were wearing and carrying stays behind in the space you occupied when you disappeared. You draw no more cards.\nEuryale: The card's medusa-like visage curses you. You take a −1 penalty on saving throws for the duration of the adventure.\nThe Fates: Reality's fabric unravels and spins anew, allowing you to avoid or erase one event as if it never happened. You can use the card's magic as soon as you draw the card or at any other point during the adventure.\nFlames: The Grand Master of the Monastery of the Distressed Body becomes your enemy. The bone devil seeks your ruin, savoring your suffering before attempting to slay you. If the Grand Master has already been defeated, you gain the enmity of Garret Levistusson's patron—a similarly powerful devil.\nFool: For the duration of the adventure, you lose proficiency with one skill or gain disadvantage on all checks made with one skill (with the skill and the penalty determined by the DM). Discard this card and draw from the deck again, counting both draws as one of your declared draws.\nGem: The 1,000 gp hoard of the leprechaun from the Wilderness Encounters table (see appendix A) appears at your feet. If that treasure has already been claimed, you gain an equivalent hoard.\nIdiot: Reduce your Intelligence by 1d4 + 1 (to a minimum score of 1) for the duration of the adventure. You can draw one additional card beyond your declared draws.\nJester: You gain proficiency in a skill of your choice for the duration of the adventure, or you can draw two additional cards beyond your declared draws.\nKey: A common or uncommon magic weapon with which you are proficient, or a spell scroll featuring a spell of a level you can cast, appears in your hands. The DM chooses the weapon or spell, which you possess for the duration of this adventure.\nKnight: You gain the service of any of the NPCs in the \"Hirelings\" section not currently with the party, who appears in a space you choose within 30 feet of you. The NPC serves you loyally for the duration of the adventure, believing that the fates have drawn them to you. You control this character.\nMoon: You are granted the ability to cast any spell of 5th level or lower, and can use that ability 1d3 times for the duration of the adventure.\nRogue: An NPC of the DM's choice becomes secretly hostile toward you. The identity of your new enemy isn't known until the NPC or someone else reveals it. Any enchantment spell cast on the NPC at 6th level or higher can end the NPC's hostility toward you.\nRuin: All forms of wealth that you carry or own, other than magic items, are lost to you. This wealth can be recovered either in the treasury of the Monastery of the Distressed Body (area M10) or Kwalish's lab in Daoine Gloine (area O7), whichever comes later in the adventure.\nSkull: You summon an avatar of death—a mechanical skeleton (use bone naga statistics) clad in a tattered black robe. It appears in a space of the DM's choice within 10 feet of you and attacks you, warning all others that you must win the battle alone. The avatar fights until you die or it drops to 0 hit points, whereupon it disappears. If anyone tries to help you, the helper summons its own avatar of death. A creature slain by an avatar of death can't be restored to life.\nStar: Increase one of your ability scores by 1 for the duration of the adventure. The score can exceed 20 but can't exceed 24.\nSun: You gain proficiency in the skill of your choice for the duration of the adventure. In addition, a common or uncommon wondrous item appears in your hands. The DM chooses the item, which you possess for the duration of this adventure.\nTalons: Every magic item you wear or carry is lost to you. These items can be recovered either in the treasury of the Monastery of the Distressed Body (area M10) or Kwalish's lab in Daoine Gloine (area O7), whichever comes later in the adventure.\nThrone: You gain proficiency in the Persuasion skill and you double your proficiency bonus on checks made with that skill for the duration of the adventure. In addition, the Monastery of the Distressed Body's brains in jars regard you thereafter as the monastery's rightful master. You must defeat or otherwise clear out the Grand Master and its servants before you can claim the monastery as yours.\nVizier: At any one time you choose within the duration of the adventure, you can ask a question in meditation and mentally receive a truthful answer to that question. Besides information, the answer helps you solve a puzzling problem or other dilemma. In other words, the knowledge comes with wisdom on how to apply it.\nThe Void: This black card spells disaster. Your soul is drawn from your body and held within machinery in either the control room of the Monastery of the Distressed Body (area M8) or Kwalish's lab in Daoine Gloine (area O7), whichever comes later in the adventure. While your soul is trapped in this way, your body is incapacitated. Divination, contact other plane, or a similar spell of 4th level or higher reveals the location of the machinery that holds your soul. You draw no more cards.\nUsing the Deck of Several Things: The special nature of this deck (carried by Mary Greymalkin if she is used as an NPC) means that many of its effects operate only within and with respect to this specific adventure. This typically covers any time the characters spend between setting out for the Barrier Peaks and the resolution of whatever events transpire in Kwalish's lab (area O7).\nFor cards that effectively remove a character from play for a period of time (Donjon and the Void), you can allow a player to take on the role of one of the party's NPC hirelings, or introduce a temporary character as an NPC met during the party's journey. Alternatively, you can decide that only some aspect of the character's will disappears and is imprisoned, leaving the character to operate in a robotic state until freed.\nSource: Lost Laboratory of Kwalish p. 53",
                "roll": [
                    "1d22",
                    "1d4+1",
                    "1d3"
                ]
            },
            {
                "name": "Enchanted Three-Dragon Ante Set",
                "detail": "Gaming Set",
                "type": "G",
                "weight": "",
                "value": "1.0",
                "property": "",
                "text": "One card in this deck is enchanted to appear as whatever specific card its owner commands. This magic works only 25 percent of the time, but the deck is worth 500 gp to any serious gambler who doesn't mind the risk—or who isn't told about it.\nSource: Lost Laboratory of Kwalish p. 15"
            },
            {
                "name": "Galder's Bubble Pipe",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "",
                "property": "",
                "text": "This finely carved pipe blows odorless bubbles instead of smoke when used. The pipe has 3 charges, and it regains all spent charges daily at dawn. While you hold the pipe, you can expend charges to gain access to the following properties:\n• You can cast fog cloud as an action (1 charge).\n• You can cast misty step as a bonus action (2 charges).\n• You can summon a steam mephit as an action (3 charges). The mephit is friendly to you, obeys your verbal commands, and acts on its own turn in the initiative order. It disappears in a harmless puff of steam after 1 minute or if it ends its turn more than 60 feet from the pipe.\nSource: Lost Laboratory of Kwalish p. 55"
            },
            {
                "name": "Heward's Hireling Armor",
                "detail": "Light Armor",
                "type": "LA",
                "weight": "10",
                "property": "",
                "ac": "11",
                "text": "A number of Kwalish's experiments were attempts to research the works of the legendary mage Heward, who first crafted what he named hireling armor. While wearing this armor, you gain a +1 bonus to AC. In addition, the armor's animated straps can assist with the drawing and sheathing of weapons, such that you can draw or stow two one-handed weapons when you would normally be able to draw or stow only one.\nThis armor also has six pockets, each of which is an extradimensional space. Each pocket can hold up to 20 pounds of material, not exceeding a volume of 2 cubic feet. The armor always weighs 10 pounds, regardless of its pockets' contents. Placing an object into one of the armor's pockets follows the normal rules for interacting with objects. Retrieving an item from a pocket of the armor requires you to use an action. When you reach into a pocket for a specific item, the item is always magically on top.\nPlacing the armor inside an extradimensional space created by a bag of holding, a Heward's handy haversack, or a similar item instantly destroys both items and opens a gate to the Astral Plane. The gate originates where the one item was placed inside the other. Any creature within 10 feet of the gate is sucked through it and deposited in a random location on the Astral Plane. The gate then closes. The gate is one-way only and can't be reopened.\nSource: Lost Laboratory of Kwalish p. 55"
            },
            {
                "name": "Ioun Stone, Historical Knowledge",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "",
                "property": "",
                "text": "An Ioun stone is named after Ioun, a god of knowledge and prophecy revered on some worlds. Many types of Ioun stone exist, each type a distinct combination of shape and color.\nWhen you use an action to toss one of these stones into the air, the stone orbits your head at a distance of 1d3 feet and confers a benefit to you. Thereafter, another creature must use an action to grasp or net the stone to separate it from you, either by making a successful attack roll against AC 24 or a successful DC 24 Dexterity (Acrobatics) check. You can use an action to seize and stow the stone, ending its effect.\nA stone has AC 24, 10 hit points, and resistance to all damage. It is considered to be an object that is being worn while it orbits your head.\nYou gain proficiency in the History skill, or a +1 bonus to checks with that skill if already proficient, while this polished, steely sphere orbits your head.\nSource: Lost Laboratory of Kwalish p. 55",
                "roll": "1d3"
            },
            {
                "name": "Ioun Stone, Language Knowledge",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "",
                "property": "",
                "text": "An Ioun stone is named after Ioun, a god of knowledge and prophecy revered on some worlds. Many types of Ioun stone exist, each type a distinct combination of shape and color.\nWhen you use an action to toss one of these stones into the air, the stone orbits your head at a distance of 1d3 feet and confers a benefit to you. Thereafter, another creature must use an action to grasp or net the stone to separate it from you, either by making a successful attack roll against AC 24 or a successful DC 24 Dexterity (Acrobatics) check. You can use an action to seize and stow the stone, ending its effect.\nA stone has AC 24, 10 hit points, and resistance to all damage. It is considered to be an object that is being worn while it orbits your head.\nYou are fluent in one additional language while this pulsating bit of red jeweled crystal orbits your head. The DM chooses the language bestowed by the stone.\nSource: Lost Laboratory of Kwalish p. 55",
                "roll": "1d3"
            },
            {
                "name": "Ioun Stone, Natural Knowledge",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "",
                "property": "",
                "text": "An Ioun stone is named after Ioun, a god of knowledge and prophecy revered on some worlds. Many types of Ioun stone exist, each type a distinct combination of shape and color.\nWhen you use an action to toss one of these stones into the air, the stone orbits your head at a distance of 1d3 feet and confers a benefit to you. Thereafter, another creature must use an action to grasp or net the stone to separate it from you, either by making a successful attack roll against AC 24 or a successful DC 24 Dexterity (Acrobatics) check. You can use an action to seize and stow the stone, ending its effect.\nA stone has AC 24, 10 hit points, and resistance to all damage. It is considered to be an object that is being worn while it orbits your head.\nYou gain proficiency in the Nature skill, or a +1 bonus to checks with that skill if already proficient, while this burnished, brassy stone orbits your head.\nSource: Lost Laboratory of Kwalish p. 55",
                "roll": "1d3"
            },
            {
                "name": "Ioun Stone, Religious Knowledge",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "",
                "property": "",
                "text": "An Ioun stone is named after Ioun, a god of knowledge and prophecy revered on some worlds. Many types of Ioun stone exist, each type a distinct combination of shape and color.\nWhen you use an action to toss one of these stones into the air, the stone orbits your head at a distance of 1d3 feet and confers a benefit to you. Thereafter, another creature must use an action to grasp or net the stone to separate it from you, either by making a successful attack roll against AC 24 or a successful DC 24 Dexterity (Acrobatics) check. You can use an action to seize and stow the stone, ending its effect.\nA stone has AC 24, 10 hit points, and resistance to all damage. It is considered to be an object that is being worn while it orbits your head.\nYou gain proficiency in the Religion skill, or a +1 bonus to checks with that skill if already proficient, while this tiny golden gem orbits your head.\nSource: Lost Laboratory of Kwalish p. 55",
                "roll": "1d3"
            },
            {
                "name": "Ioun Stone, Self-Preservation",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "",
                "property": "",
                "text": "An Ioun stone is named after Ioun, a god of knowledge and prophecy revered on some worlds. Many types of Ioun stone exist, each type a distinct combination of shape and color.\nWhen you use an action to toss one of these stones into the air, the stone orbits your head at a distance of 1d3 feet and confers a benefit to you. Thereafter, another creature must use an action to grasp or net the stone to separate it from you, either by making a successful attack roll against AC 24 or a successful DC 24 Dexterity (Acrobatics) check. You can use an action to seize and stow the stone, ending its effect.\nA stone has AC 24, 10 hit points, and resistance to all damage. It is considered to be an object that is being worn while it orbits your head.\nYou gain a +1 bonus to Intelligence saving throws while this silvery gem orbits your head.\nSource: Lost Laboratory of Kwalish p. 55",
                "roll": "1d3"
            },
            {
                "name": "Ioun Stone, Supreme Intellect",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "",
                "property": "",
                "text": "An Ioun stone is named after Ioun, a god of knowledge and prophecy revered on some worlds. Many types of Ioun stone exist, each type a distinct combination of shape and color.\nWhen you use an action to toss one of these stones into the air, the stone orbits your head at a distance of 1d3 feet and confers a benefit to you. Thereafter, another creature must use an action to grasp or net the stone to separate it from you, either by making a successful attack roll against AC 24 or a successful DC 24 Dexterity (Acrobatics) check. You can use an action to seize and stow the stone, ending its effect.\nA stone has AC 24, 10 hit points, and resistance to all damage. It is considered to be an object that is being worn while it orbits your head.\nYou gain a +1 bonus to Intelligence checks while this faceted sphere orbits your head.\nSource: Lost Laboratory of Kwalish p. 55",
                "roll": "1d3"
            },
            {
                "name": "Leather Golem Armor",
                "detail": "Cursed item, Light Armor",
                "type": "LA",
                "weight": "10",
                "property": "",
                "ac": "11",
                "text": "Strange rituals have repurposed the body of a flesh golem into this partially sentient suit of leather armor. While wearing this armor, you gain a +1 bonus to AC and to saving throws against spells and other magical effects. In addition, you gain the following properties:\nYou are immune to any spell or effect that would alter your form.\nYou gain resistance to lightning damage. Whenever you take lightning damage, you gain 5 temporary hit points.\nCurse: This armor is cursed, and becoming attuned to it extends the curse to you. Until the curse is broken with a remove curse spell or similar magic, you are unwilling to part with the armor. In addition, while you wear the cursed armor, you gain the following properties:\nIf you take fire damage, you have disadvantage on attack rolls and ability checks until the end of your next turn.\nWhenever a critical hit is made against you, roll a d6. On a 6, the armor causes you to go berserk. On each of your turns while berserk, you attack the nearest creature you can see. If no creature is near enough to move to and attack, you attack an object, with preference for an object smaller than yourself. Once the armor causes you to go berserk, it cannot be removed. You continue to attack until you are incapacitated or until another creature is able to calm you with appropriate magic (such as a calm emotions spell) or a successful DC 15 Charisma (Persuasion) check.\nSource: Lost Laboratory of Kwalish p. 55"
            },
            {
                "name": "Powered Armor",
                "detail": "Heavy Armor",
                "type": "HA",
                "weight": "65",
                "property": "",
                "ac": "18",
                "text": "Powered armor resembles a suit of unusual plate armor, with finely articulated joints connected by an oily, black, leather-like material. The armor has been worked to create the appearance of a heavily muscled warrior, and its great helm is unusual in that it has no openings—only a broad glass plate in the front with a second piece of glass above it. Strange plates, tubing, and large metal bosses adorn the armor in seemingly random fashion. On the back of the armor's left gauntlet is a rectangular metal box, from which projects a short rod tipped with a cone-shaped red crystal.\nWhile wearing this armor, you gain the following benefits:\n• You have a +1 bonus to AC.\n• Your Strength score is 18 (this has no effect if your Strength is already 18 or higher).\n• You have advantage on death saving throws.\nThe armor has further capabilities that can be powered either by energy cells or by your own life energy. You can use a bonus action to draw power from an energy cell or sacrifice hit points to gain one of the following benefits:\n• Emit a force field to gain 2d6 + 5 temporary hit points (1 charge or 5 hit points).\n• Activate boosters to gain a flying speed of 15 feet for 1 minute (1 charge or 5 hit points).\n• Fire arm-mounted laser: Ranged Weapon Attack: +8 to hit, range 120 feet, one target. 2d6 radiant damage (1 charge or 5 hit points).\n• Translate any writing you can see in any nonmagical language, to a total of one thousand words over 1 minute (1 charge or 5 hit points).\n• Fill the armor with air, allowing you to breathe normally in any environment for up to 1 hour (1 charge or 5 hit points).\n• Gain darkvision to a range of 60 feet for up to 1 hour (1 charge or 5 hit points).\nThe armor can accept only one energy cell at a time. It is found with one energy cell attached, containing 2d10 charges.\nPowered Armor Options: Depending on where and how it appears in the adventure, you might wish to modify the features of Kwalish's legendary powered armor.\nSource: Lost Laboratory of Kwalish p. 56",
                "roll": [
                    "2d6+5",
                    "2d6",
                    "2d10"
                ]
            },
            {
                "name": "Ioun Stone",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "",
                "property": "",
                "text": "Ioun Stone, Supreme Intellect\nIoun Stone, Historical Knowledge\nIoun Stone, Natural Knowledge\nIoun Stone, Religious Knowledge\nIoun Stone, Language Knowledge\nIoun Stone, Self-Preservation\nSource: Lost Laboratory of Kwalish p. 55"
            }
        ],
        "_version": "5",
        "_auto_indent": "NO"
    }
}
