{
    "compendium": {
        "background": [
            {
                "name": "Dissenter",
                "proficiency": "Athletics, Intimidation, History, Religion",
                "trait": [
                    {
                        "name": "Description",
                        "text": "Even in the carefully constructed and curated city-state of Naktamun, and in the presence of the five gods, some people rebel against the doctrines of the God-Pharaoh. They don't challenge the existence of the gods, of course, for those gods are visible nearly every day in the streets of the city. Nor do they question the fact of life after death, which is plain to see in the anointed mummies that surround them, as well as the marauding mummies outside the Hekma. Rather, these dissenters simply refuse to follow the ordained course of life that leads to the glorious afterlife.\nSome dissenters are spurred by fear, not wanting to subject themselves to a violent death in the trials (or in training for the trials). Some are moved by conscience, unwilling to kill their crop-mates in the trials. For while they cannot deny that the gods exist, they can deny that the gods are just—and can fight to prove that the dictates of an unjust god need not be obeyed. Some believe that one god (probably Bontu) has corrupted the process of the trials and the path to the afterlife. Others correctly intuit that the God-Pharaoh did not actually have the people's best interests in mind when he ordered their society.\nA character who is identified as a dissenter loses the benefit of the initiate's or vizier's background feature. In its place, the character gains the Shelter of Dissenters feature.\nSource: Plane Shift: Amonkhet p. 11"
                    },
                    {
                        "name": "Overview",
                        "text": "Even in the carefully constructed and curated city-state of Naktamun, and in the presence of the five gods, some people rebel against the doctrines of the God-Pharaoh. They don't challenge the existence of the gods, of course, for those gods are visible nearly every day in the streets of the city. Nor do they question the fact of life after death, which is plain to see in the anointed mummies that surround them, as well as the marauding mummies outside the Hekma. Rather, these dissenters simply refuse to follow the ordained course of life that leads to the glorious afterlife.\nSome dissenters are spurred by fear, not wanting to subject themselves to a violent death in the trials (or in training for the trials). Some are moved by conscience, unwilling to kill their crop-mates in the trials. For while they cannot deny that the gods exist, they can deny that the gods are just—and can fight to prove that the dictates of an unjust god need not be obeyed. Some believe that one god (probably Bontu) has corrupted the process of the trials and the path to the afterlife. Others correctly intuit that the God-Pharaoh did not actually have the people's best interests in mind when he ordered their society.\nA character who is identified as a dissenter loses the benefit of the initiate's or vizier's background feature. In its place, the character gains the following feature:"
                    },
                    {
                        "name": "Feature: Shelter of Dissenters",
                        "text": "If they wish to have any hope of survival, whether hiding within the city or cast out into the desert, dissenters must help each other. You can find a place to hide, rest, or recuperate among other dissenters. They will help shield you from those who hunt you, possibly even risking their lives for you."
                    }
                ]
            },
            {
                "name": "Initiate",
                "proficiency": "Athletics, Intimidation",
                "trait": [
                    {
                        "name": "Description",
                        "text": "You are an initiate, on the path to completing the trials of the five gods in the hope of earning a glorified death in the final Trial of Zeal. Some combination of your natural aptitude, your crop's needs, and your teachers' assessment while you were an acolyte led you to focus your training in one particular area of specialization—hand-to-hand combat, long-range combat, or spellcasting. But only a well-rounded initiate can be called truly worthy of the afterlife.\nIf you are a hand-to-hand specialist, consider the barbarian, fighter, monk, paladin, or rogue classes. As a long-range combat specialist, you might be a fighter, a ranger, or a rogue. If you are a spellcasting specialist, you might be a bard, sorcerer, or wizard. And beyond this initial choice, you might consider multiclassing or using feats to round out your skills in all three areas.\n• Skill Proficiencies: Athletics, Intimidation\n• Tool Proficiencies: One type of gaming set, vehicles (land)\n• Equipment: A simple puzzle box, a scroll containing the basic teachings of the five gods, a gaming set, a set of common clothes, and a belt pouch containing 15 gp. If you have completed any trials before the start of the campaign, you also have any cartouches you have earned\nSource: Plane Shift: Amonkhet p. 8"
                    },
                    {
                        "name": "Feature: Trials of the Five Gods",
                        "text": "Your life is oriented around your participation in the five trials that will determine your worthiness in the afterlife. While you prepare for and undergo those trials, you have constant access to training. A comfortable place to live and regular meals are provided to you by servitor mummies (the anointed) under the supervision of viziers. You can enjoy these benefits only as long as you obey the societal norms of Naktamun—training for the trials (with or without your crop), obeying the orders of the gods, and following the instructions of their viziers. If you violate these norms, you risk being treated as a dissenter. See \"Trials of the Five Gods\" for more information about undertaking the trials and their rewards.\nThe five gods are the effective rulers of Amonkhet. They are not the creators of the plane, but they are its stewards while the people of Naktamun await the return of the God-Pharaoh. The five gods believe they were created by the God-Pharaoh, who charged them with teaching the people the ways of the God-Pharaoh, and with protecting them until he comes.\nThe five gods embody the five virtues the God-Pharaoh wishes to cultivate in those who will become his Eternals in the afterlife. Each god is responsible for modeling and teaching one of those virtues to the acolytes and initiates of Naktamun, and then testing those initiates to ensure that they have mastered their teachings. Thus, they are present during the acolytes' first lessons, during the Ceremony of Measuring, during the initiates' intense training, and at each of the trials that are part of an initiate's journey.\nIn the absence of the God-Pharaoh, only the gods can determine whether initiates have proven themselves worthy of the glory of the afterlife. The gods in turn prove their own worthiness by executing their duties infallibly. They make the trials as challenging as possible to ensure that only the most worthy are selected."
                    },
                    {
                        "name": "Suggested Characteristics",
                        "text": "An initiate's life is focused on the trials, but it doesn't need to be all about the trials. Though some initiates are highly focused on their training, most undergo that training while also experiencing joy, sorrow, love, loss, anger, jealousy, hope, faith, delight—the whole range of mortal emotions and experience. The afterlife might be a constant presence in every initiate's mind, but it is the culmination of a life well-lived—not a replacement for it.\nd8 | Personality Trait\n1 | I always have a joke on hand when the mood gets too serious.\n2 | I use sarcasm and insults to keep a distance between myself and my crop-mates, because I don't want to get attached to them.\n3 | I'll settle for nothing less than perfection—in myself, in my cropmates, in everything.\n4 | I'm so focused on the glorious afterlife that nothing in this life can shake my calm resolve.\n5 | I enjoy using my skills to help those who lack those same skills.\n6 | I train hard so that I can play hard at the end of the day. I fully expect to play even harder in the glorious afterlife, but I'm not in a hurry to get there.\n7 | I'm perfectly happy letting others pick up the slack for me while I take it easy.\n8 | I'm constantly sizing up everyone around me, thinking about what kind of opponent they'll be in the final trial.\n\nd6 | Ideal\n1 | Solidarity. The thing that matters most of all is that we're there for each other. (Lawful)\n2 | Knowledge. The world is a puzzle—a mystery waiting to be solved. (Neutral)\n3 | Strength. All that matters to me is my own perfection. Let everyone else seek that perfection in their own way. (Any)\n4 | Ambition. I'm going to prove that I deserve only the best—of everything. (Evil)\n5 | Zeal. Anything worth doing is worth throwing my whole self into. (Any)\n6 | Redemption. I will train all the harder to make up for the doubt I entertained when I was younger. (Any)\n\nd6 | Bond\n1 | One of my crop-mates is my dearest friend, and I hope we will face each other in the final trial.\n2 | I am in love with a vizier.\n3 | I am particularly drawn to one of the five gods, and I want nothing more than to win that god's particular favor.\n4 | I am more devoted to Naktamun and its people than I am to any of the ideals of the gods.\n5 | My weapon was a gift from a beloved trainer who died in an accident.\n6 | I carry a memento of my time as an acolyte, and I treasure it above all other things.\n\nd6 | Flaw\n1 | I'm easily distracted by an attractive person, which could be the death of me in the trials.\n2 | I really wanted to be a vizier, and I'm angry at the god who didn't choose me.\n3 | Training for a lifetime to die in the end seems like a big waste of energy.\n4 | I'm not at all sure I'll be able to grant a glorified death to any of my crop-mates.\n5 | I have a lasting grudge against one of my crop-mates, and each of us wants to see the other fail.\n6 | I think I've figured out that this world is not what it seems. Something dark is going on here."
                    }
                ]
            },
            {
                "name": "Vizier",
                "proficiency": "History, Religion",
                "trait": [
                    {
                        "name": "Description",
                        "text": "You are a vizier, a servant of your god. You perform tasks that are essential to facilitating the initiates' journey, so the gods reward you with entry into the afterlife with the God-Pharaoh's blessing. You hope to achieve the most honored status in the afterlife by being the best possible servant to your god.\nAs a vizier, you can have any class, but you are especially likely to be a cleric, a druid (particularly if you serve Rhonas), or a paladin.\n• Skill Proficiencies: History, Religion\n• Tool Proficiencies: One type of artisan's tools, one type of musical instrument\n• Equipment: A set of artisan's tools or a musical instrument (one of your choice), a scroll of your god's teachings, a vizier's cartouche, a set of fine clothes, and a pouch containing 25 gp\nSource: Plane Shift: Amonkhet p. 10"
                    },
                    {
                        "name": "Feature: Voice of Authority",
                        "text": "Your voice is the voice of your god, at least in theory. Your job might include training and instructing initiates, and they are required to obey you. In any circumstance, an initiate is expected to defer to your voice and obey your commands. If you abuse this authority, though, your god might personally punish you."
                    },
                    {
                        "name": "Suggested Characteristics",
                        "text": "A vizier's characteristics strongly reflect the ideals and personality of the god they serve.\nd10 | Personality Trait\n1 | Everything I do, I do gracefully and deliberately, and with complete confidence. (Oketra)\n2 | Nothing can shake my rock-hard focus. (Oketra)\n3 | When I am at peace, I am an oasis of perfect calm in the world. When I am roused to anger, I am an embodiment of terror. (Kefnet)\n4 | I enjoy teasing acolytes and initiates with juicy tidbits of knowledge wrapped up in fiendishly difficult puzzles. (Kefnet)\n5 | I have the utmost faith in myself and my abilities. (Rhonas)\n6 | I get restless when life in the city feels too tame, too safe. (Rhonas)\n7 | I enjoy solitude as an opportunity to plan my victory. (Bontu)\n8 | I use satire as a way to undermine the teachings of the other gods. (Bontu)\n9 | I love, fight, and feast with equal zeal. (Hazoret)\n10 | I think of those in my care as my family, in a way that most people have trouble understanding. (Hazoret)\n\nd6 | Ideal\n1 | Solidarity. The worthy must respect the worthy. In the afterlife, all will be united in goal and action. (Oketra)\n2 | Knowledge. The worthy shall cultivate a nimble mind, so as to perceive the wonders beyond imagination that wait in the afterlife. (Kefnet)\n3 | Strength. The worthy shall hone a strong body that can withstand the boundless energies of the afterlife. (Rhonas)\n4 | Ambition. The worthy shall strive for greatness, for supremacy in life leads to supremacy in the afterlife. (Bontu)\n5 | Zeal. The worthy shall rush to the God-Pharaoh's side with relentless passion, rising to overcome every obstacle in their way. (Hazoret)\n6 | Naktamun. The life of the city is ordered according to the plan of the God-Pharaoh, and that order must be preserved at all costs.\n\nd6 | Bond\n1 | My loyalty to my companions embodies the ideal of loyalty to my god. (Oketra)\n2 | The teachings of my god are more precious to me than any possession. (Kefnet)\n3 | I would do anything to defend the temple of my god from any harm or desecration. (Rhonas)\n4 | I am committed to the service of my god—because it's my sure ticket into the afterlife. (Bontu)\n5 | I love my god and never want my service to end. (Hazoret)\n6 | I have a close friend or lover who is also a vizier.\n\nd6 | Flaw\n1 | I am in love with an initiate, and I want to shield this person from death in the trials.\n2 | I secretly wish I had not been chosen as a vizier, so I could participate in the trials as an initiate.\n3 | I secretly question whether the gods care at all about us or what we do.\n4 | A vizier of another god seeks my death in retribution for a past insult.\n5 | I am terrified of what lies beyond the Gate to the Afterlife.\n6 | I secretly believe the God-Pharaoh's return will not bring blessing to this world."
                    }
                ]
            }
        ],
        "_version": "5",
        "_auto_indent": "NO"
    }
}
