{
    "compendium": {
        "race": [
            {
                "name": "Aven (Hawk-Headed)",
                "size": "M",
                "speed": "25",
                "ability": "Dex 2, Wis 2",
                "proficiency": "Perception",
                "spellAbility": "",
                "trait": [
                    {
                        "name": "Description",
                        "text": "Source: Plane Shift: Amonkhet p. 16"
                    },
                    {
                        "name": "Hawkeyed",
                        "text": "You have proficiency in the Perception skill. In addition, attacking at long range doesn't impose disadvantage on your ranged weapon attack rolls."
                    },
                    {
                        "name": "Age",
                        "text": "Like humans, aven reach adulthood in their late teens and can theoretically live into their 80s. Of course, most find a glorious (or inglorious) death long before that point."
                    },
                    {
                        "name": "Alignment",
                        "text": "Most aven lean toward some form of neutrality. Ibis-headed aven, focused more on knowledge than any other virtue, are usually neutral. Hawk-headed aven are inclined toward lawful neutral."
                    },
                    {
                        "name": "Size",
                        "text": "Aven stand from 5 to 6 feet tall, but their bodies are slender and their bones are partially hollow to facilitate their flight. Your size is Medium."
                    },
                    {
                        "name": "Flight",
                        "text": "You have a flying speed of 30 feet. You can't use your flying speed while you wear medium or heavy armor. (If your campaign uses the variant rule for encumbrance, you can't use your flying speed if you are encumbered.)"
                    },
                    {
                        "name": "Languages",
                        "text": "You can speak, read, and write Common and Aven."
                    }
                ]
            },
            {
                "name": "Aven (Ibis-Headed)",
                "size": "M",
                "speed": "25",
                "ability": "Dex 2, Int 1",
                "proficiency": "",
                "spellAbility": "",
                "trait": [
                    {
                        "name": "Description",
                        "text": "Source: Plane Shift: Amonkhet p. 16"
                    },
                    {
                        "name": "Kefnet's Blessing",
                        "text": "You can add half your proficiency bonus, rounded down, to any Intelligence check you make that doesn't already include your proficiency bonus."
                    },
                    {
                        "name": "Age",
                        "text": "Like humans, aven reach adulthood in their late teens and can theoretically live into their 80s. Of course, most find a glorious (or inglorious) death long before that point."
                    },
                    {
                        "name": "Alignment",
                        "text": "Most aven lean toward some form of neutrality. Ibis-headed aven, focused more on knowledge than any other virtue, are usually neutral. Hawk-headed aven are inclined toward lawful neutral."
                    },
                    {
                        "name": "Size",
                        "text": "Aven stand from 5 to 6 feet tall, but their bodies are slender and their bones are partially hollow to facilitate their flight. Your size is Medium."
                    },
                    {
                        "name": "Flight",
                        "text": "You have a flying speed of 30 feet. You can't use your flying speed while you wear medium or heavy armor. (If your campaign uses the variant rule for encumbrance, you can't use your flying speed if you are encumbered.)"
                    },
                    {
                        "name": "Languages",
                        "text": "You can speak, read, and write Common and Aven."
                    }
                ]
            },
            {
                "name": "Human (Amonkhet)",
                "size": "M",
                "speed": "30",
                "ability": "",
                "proficiency": "",
                "spellAbility": "",
                "trait": [
                    {
                        "name": "Description",
                        "text": "Source: Plane Shift: Amonkhet p. 14"
                    },
                    {
                        "name": "Age",
                        "text": "Humans reach adulthood in their late teens. Most human initiates have completed the trials and found a glorious or inglorious death before they turn 30. Viziers can enjoy longer service to their gods, in theory living up to a century."
                    },
                    {
                        "name": "Alignment",
                        "text": "Humans tend toward no particular alignment. The best and the worst are found among them."
                    },
                    {
                        "name": "Size",
                        "text": "Humans vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium"
                    },
                    {
                        "name": "Ability Score Increase",
                        "text": "Two different ability scores of your choice increase by 1."
                    },
                    {
                        "name": "Skills",
                        "text": "You gain proficiency in one skill of your choice."
                    },
                    {
                        "name": "Feat",
                        "text": "You gain one feat of your choice."
                    },
                    {
                        "name": "Languages",
                        "text": "You can speak, read, and write Common and one extra language of your choice."
                    }
                ]
            },
            {
                "name": "Khenra",
                "size": "M",
                "speed": "35",
                "ability": "Dex 2, Str 1",
                "proficiency": "",
                "spellAbility": "",
                "trait": [
                    {
                        "name": "Description",
                        "text": "Source: Plane Shift: Amonkhet p. 17"
                    },
                    {
                        "name": "Age",
                        "text": "Khenra mature quickly, reaching adulthood in their early teens. Khenra initiates are usually the youngest in a crop, completing the trials by their late teens. Even without a violent death, they rarely live past 60."
                    },
                    {
                        "name": "Alignment",
                        "text": "Most khenra lean toward chaotic alignments. They have no particular inclination toward good or evil."
                    },
                    {
                        "name": "Size",
                        "text": "Khenra have similar builds to humans. Your size is Medium."
                    },
                    {
                        "name": "Khenra Weapon Training",
                        "text": "You have proficiency with the khopesh (longsword), spear, and javelin."
                    },
                    {
                        "name": "Khenra Twins",
                        "text": "If your twin is alive and you can see your twin, whenever you roll a 1 on an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll. If your twin is dead (or if you were born without a twin), you can't be frightened."
                    },
                    {
                        "name": "Languages",
                        "text": "You can speak, read, and write Common and Khenra."
                    }
                ]
            },
            {
                "name": "Minotaur (Amonkhet)",
                "size": "M",
                "speed": "30",
                "ability": "Str 2, Con 1",
                "proficiency": "Intimidation",
                "spellAbility": "",
                "trait": [
                    {
                        "name": "Description",
                        "text": "Source: Plane Shift: Amonkhet p. 19"
                    },
                    {
                        "name": "Age",
                        "text": "Minotaurs develop more slowly than humans, reaching full maturity around the age of 20. They typically become acolytes at around 8 or 9 years old, making them among the older members of their crops. Once they reach maturity, though, minotaurs age quickly, rushing headlong through the trials (as they do all aspects of life) to complete them before they pass their peak. A minotaur allowed to die of old age would rarely live beyond 40."
                    },
                    {
                        "name": "Alignment",
                        "text": "Most minotaurs lean toward chaotic alignments, and they have a slight inclination toward evil."
                    },
                    {
                        "name": "Size",
                        "text": "Minotaurs average over 6 feet in height, and they have strong, stocky builds. Your size is Medium."
                    },
                    {
                        "name": "Natural Weapon",
                        "text": "You can use your horns as a natural weapon to make unarmed strikes. If you hit with your horns, you deal bludgeoning damage equal to 1d6 + your Strength modifier."
                    },
                    {
                        "name": "Menacing",
                        "text": "You gain proficiency in the Intimidation skill."
                    },
                    {
                        "name": "Relentless Endurance",
                        "text": "When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can't use this feature again until you finish a long rest."
                    },
                    {
                        "name": "Savage Attacks",
                        "text": "When you score a critical hit with a melee weapon attack, you can roll one of the weapon's damage dice one additional time and add it to the extra damage of the critical hit."
                    },
                    {
                        "name": "Languages",
                        "text": "You can speak, read, and write Common and Minotaur."
                    }
                ]
            },
            {
                "name": "Naga",
                "size": "M",
                "speed": "30",
                "ability": "Con 2, Int 1",
                "proficiency": "",
                "spellAbility": "",
                "trait": [
                    {
                        "name": "Description",
                        "text": "Source: Plane Shift: Amonkhet p. 21"
                    },
                    {
                        "name": "Age",
                        "text": "Like humans, naga reach adulthood in their late teens. They show no signs of aging beyond that point except for growing larger, so in theory, a naga could live well over a century."
                    },
                    {
                        "name": "Alignment",
                        "text": "Most naga are either neutral or neutral evil in alignment."
                    },
                    {
                        "name": "Size",
                        "text": "Naga stand about 5 feet tall when upright, but the total length of their bodies, head to tail, ranges from 10 to as much as 20 feet. Your size is Medium."
                    },
                    {
                        "name": "Speed Burst",
                        "text": "By lowering your body to the ground and propelling yourself with your arms, you can move more quickly for a time. As a bonus action on your turn, if you have both hands free, you can increase your walking speed by 5 feet until the end of your turn."
                    },
                    {
                        "name": "Natural Weapons",
                        "text": "Your fanged maw and constricting serpentine body are natural weapons, which you can use to make unarmed strikes.\nIf you hit with your bite, you deal piercing damage equal to 1d4 + your Strength modifier, and your target must make a Constitution saving throw (DC 8 + your proficiency bonus + your Constitution modifier). On a failed save, the target takes 1d4 poison damage.\nIf you hit with your constrict attack, you deal bludgeoning damage equal to 1d6 + your Strength modifier, and the target is grappled (escape DC 8 + your proficiency bonus + your Strength modifier). Until this grapple ends, the target is restrained, and you can't constrict another target."
                    },
                    {
                        "name": "Poison Immunity",
                        "text": "You are immune to poison damage and can't be poisoned."
                    },
                    {
                        "name": "Poison Affinity",
                        "text": "You gain proficiency with the poisoner's kit."
                    },
                    {
                        "name": "Languages",
                        "text": "You can speak, read, and write Common and Naga."
                    }
                ]
            }
        ],
        "_version": "5",
        "_auto_indent": "NO"
    }
}
