{
    "compendium": {
        "item": [
            {
                "name": "Hag Eye",
                "detail": "Other",
                "type": "G",
                "weight": "",
                "property": "",
                "text": "A hag coven can craft a magic item called a hag eye, which is made from a real eye coated in varnish and often fitted to a pendant or other wearable item. The hag eye is usually entrusted to a minion for safekeeping and transport. A hag in the coven can take an action to see what the hag eye sees if the hag eye is on the same plane of existence. A hag eye has AC 10, 1 hit point, and darkvision with a radius of 60 feet. If it is destroyed, each coven member takes 3d10 psychic damage and is blinded for 24 hours.\nA hag coven can have only one hag eye at a time, and creating a new one requires all three members of the coven to perform a ritual. The ritual takes 1 hour, and the hags can't perform it while blinded. During the ritual, if the hags take any action other than performing the ritual, they must start over.\nSource: Monster Manual p. 177",
                "roll": "3d10"
            },
            {
                "name": "Heartstone",
                "detail": "Other",
                "type": "G",
                "weight": "",
                "property": "",
                "text": "This lustrous black gem allows a night hag to become ethereal while it is in her possession. The touch of a heartstone also cures any disease. Crafting a heartstone takes 30 days.\nSource: Monster Manual p. 179"
            },
            {
                "name": "Soul Bag",
                "detail": "Other",
                "type": "G",
                "weight": "",
                "property": "",
                "text": "When an evil humanoid dies as a result of a night hag's Nightmare Haunting, the hag catches the soul in this black sack made of stitched flesh. A soul bag can hold only one evil soul at a time, and only the night hag who crafted the bag can catch a soul with it. Crafting a soul bag takes 7 days and a humanoid sacrifice (whose flesh is used to make the bag).\nSource: Monster Manual p. 179"
            }
        ],
        "_version": "5",
        "_auto_indent": "NO"
    }
}
