{
    "compendium": {
        "class": {
            "name": "Ranger",
            "autolevel": [
                {
                    "feature": {
                        "name": "Ranger Archetype: Gloom Stalker",
                        "text": [
                            "Gloom Stalkers are at home in the darkest places: deep under the earth, in gloomy alleyways, in primeval forests, and wherever else the light dims. Most folk enter such places with trepidation, but a Gloom Stalker ventures boldly into the darkness, seeking to ambush threats before they can reach the broader world. Such rangers are often found in the Underdark, but they will go any place where evil lurks in the shadows.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 41"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Gloom Stalker: Dread Ambusher",
                        "text": [
                            "At 3rd level, you master the art of the ambush. You can give yourself a bonus to your initiative rolls equal to your Wisdom modifier.",
                            "At the start of your first turn of each combat, your walking speed increases by 10 feet, which lasts until the end of that turn. If you take the Attack action on that turn, you can make one additional weapon attack as part of that action. If that attack hits, the target takes an extra 1d8 damage of the weapon's damage type.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 41"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Gloom Stalker: Gloom Stalker Magic",
                        "text": [
                            "Starting at 3rd level, you learn an additional spell when you reach certain levels in this class, as shown in the Gloom Stalker Spells table. The spell counts as a ranger spell for you, but it doesn't count against the number of ranger spells you know.",
                            "",
                            "Gloom Stalker Spells",
                            "Ranger Level | Spells",
                            "3rd | disguise self",
                            "5th | rope trick",
                            "9th | fear",
                            "13th | greater invisibility",
                            "17th | seeming",
                            "",
                            "Source: Xanathar's Guide to Everything p. 41"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Gloom Stalker: Umbral Sight",
                        "text": [
                            "At 3rd level, you gain darkvision out to a range of 60 feet. If you already have darkvision from your race, its range increases by 30 feet.",
                            "You are also adept at evading creatures that rely on darkvision. While in darkness, you are invisible to any creature that relies on darkvision to see you in that darkness.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 41"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Ranger Archetype: Horizon Walker",
                        "text": [
                            "Horizon Walkers guard the world against threats that originate from other planes or that seek to ravage the mortal realm with otherworldly magic. They seek out planar portals and keep watch over them, venturing to the Inner Planes and the Outer Planes as needed to pursue their foes. These rangers are also friends to any forces in the multiverse—especially benevolent dragons, fey, and elementals—that work to preserve life and the order of the planes.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 42"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Horizon Walker: Detect Portal",
                        "text": [
                            "At 3rd level, you gain the ability to magically sense the presence of a planar portal. As an action, you detect the distance and direction to the closest planar portal within 1 mile of you.",
                            "Once you use this feature, you can't use it again until you finish a short or long rest.",
                            "See the \"Planar Travel\" section in chapter 2 of the Dungeon Master's Guide for examples of planar portals.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 42"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Horizon Walker: Horizon Walker Magic",
                        "text": [
                            "Starting at 3rd level, you learn an additional spell when you reach certain levels in this class, as shown in the Horizon Walker Spells table. The spell counts as a ranger spell for you, but it doesn't count against the number of ranger spells you know.",
                            "",
                            "Horizon Walker Spells",
                            "Ranger Level | Spells",
                            "3rd | protection from evil and good",
                            "5th | misty step",
                            "9th | haste",
                            "13th | banishment",
                            "17th | teleportation circle",
                            "",
                            "Source: Xanathar's Guide to Everything p. 42"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Horizon Walker: Planar Warrior",
                        "text": [
                            "At 3rd level, you learn to draw on the energy of the multiverse to augment your attacks.",
                            "As a bonus action, choose one creature you can see within 30 feet of you. The next time you hit that creature on this turn with a weapon attack, all damage dealt by the attack becomes force damage, and the creature takes an extra 1d8 force damage from the attack. When you reach 11th level in this class, the extra damage increases to 2d8.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 42"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Ranger Archetype: Monster Slayer",
                        "text": [
                            "You have dedicated yourself to hunting down creatures of the night and wielders of grim magic. A Monster Slayer seeks out vampires, dragons, evil fey, fiends, and other magical threats. Trained in supernatural techniques to overcome such monsters, slayers are experts at unearthing and defeating mighty, mystical foes.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 43"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Monster Slayer: Hunter's Sense",
                        "text": [
                            "At 3rd level, you gain the ability to peer at a creature and magically discern how best to hurt it. As an action, choose one creature you can see within 60 feet of you. You immediately learn whether the creature has any damage immunities, resistances, or vulnerabilities and what they are. If the creature is hidden from divination magic, you sense that it has no damage immunities, resistances, or vulnerabilities.",
                            "You can use this feature a number of times equal to your Wisdom modifier (minimum of once). You regain all expended uses of it when you finish a long rest.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 43"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Monster Slayer: Monster Slayer Magic",
                        "text": [
                            "Starting at 3rd level, you learn an additional spell when you reach certain levels in this class, as shown in the Monster Slayer Spells table. The spell counts as a ranger spell for you, but it doesn't count against the number of ranger spells you know.",
                            "",
                            "Monster Slayer Spells",
                            "Ranger Level | Spells",
                            "3rd | protection from evil and good",
                            "5th | zone of truth",
                            "9th | magic circle",
                            "13th | banishment",
                            "17th | hold monster",
                            "",
                            "Source: Xanathar's Guide to Everything p. 43"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Monster Slayer: Slayer's Prey",
                        "text": [
                            "Starting at 3rd level, you can focus your ire on one foe, increasing the harm you inflict on it. As a bonus action, you designate one creature you can see within 60 feet of you as the target of this feature. The first time each turn that you hit that target with a weapon attack, it takes an extra 1d6 damage from the weapon.",
                            "This benefit lasts until you finish a short or long rest. It ends early if you designate a different creature.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 43"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "3"
                },
                {
                    "feature": {
                        "name": "Gloom Stalker: Iron Mind",
                        "text": [
                            "By 7th level, you have honed your ability to resist the mind-altering powers of your prey. You gain proficiency in Wisdom saving throws. If you already have this proficiency, you instead gain proficiency in Intelligence or Charisma saving throws (your choice).",
                            "",
                            "Source: Xanathar's Guide to Everything p. 41"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "7"
                },
                {
                    "feature": {
                        "name": "Horizon Walker: Ethereal Step",
                        "text": [
                            "At 7th level, you learn to step through the Ethereal Plane. As a bonus action, you can cast the etherealness spell with this feature, without expending a spell slot, but the spell ends at the end of the current turn.",
                            "Once you use this feature, you can't use it again until you finish a short or long rest.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 42"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "7"
                },
                {
                    "feature": {
                        "name": "Monster Slayer: Supernatural Defense",
                        "text": [
                            "At 7th level, you gain extra resilience against your prey's assaults on your mind and body. Whenever the target of your Slayer's Prey forces you to make a saving throw and whenever you make an ability check to escape that target's grapple, add 1d6 to your roll.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 43"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "7"
                },
                {
                    "feature": {
                        "name": "Gloom Stalker: Stalker's Flurry",
                        "text": [
                            "At 11th level, you learn to attack with such unexpected speed that you can turn a miss into another strike. Once on each of your turns when you miss with a weapon attack, you can make another weapon attack as part of the same action.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 41"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "11"
                },
                {
                    "feature": {
                        "name": "Horizon Walker: Distant Strike",
                        "text": [
                            "At 11th level, you gain the ability to pass between the planes in the blink of an eye. When you take the Attack action, you can teleport up to 10 feet before each attack to an unoccupied space you can see.",
                            "If you attack at least two different creatures with the action, you can make one additional attack with it against a third creature.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 42"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "11"
                },
                {
                    "feature": {
                        "name": "Monster Slayer: Magic-User's Nemesis",
                        "text": [
                            "At 11th level, you gain the ability to thwart someone else's magic. When you see a creature casting a spell or teleporting within 60 feet of you, you can use your reaction to try to magically foil it. The creature must succeed on a Wisdom saving throw against your spell save DC, or its spell or teleport fails and is wasted.",
                            "Once you use this feature, you can't use it again until you finish a short or long rest.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 43"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "11"
                },
                {
                    "feature": {
                        "name": "Gloom Stalker: Shadowy Dodge",
                        "text": [
                            "Starting at 15th level, you can dodge in unforeseen ways, with wisps of supernatural shadow around you. Whenever a creature makes an attack roll against you and doesn't have advantage on the roll, you can use your reaction to impose disadvantage on it. You must use this feature before you know the outcome of the attack roll.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 41"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "15"
                },
                {
                    "feature": {
                        "name": "Horizon Walker: Spectral Defense",
                        "text": [
                            "At 15th level, your ability to move between planes enables you to slip through the planar boundaries to lessen the harm done to you during battle. When you take damage from an attack, you can use your reaction to give yourself resistance to all of that attack's damage on this turn.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 42"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "15"
                },
                {
                    "feature": {
                        "name": "Monster Slayer: Slayer's Counter",
                        "text": [
                            "At 15th level, you gain the ability to counterattack when your prey tries to sabotage you. If the target of your Slayer's Prey forces you to make a saving throw, you can use your reaction to make one weapon attack against the quarry. You make this attack immediately before making the saving throw. If your attack hits, your save automatically succeeds, in addition to the attack's normal effects.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 43"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "15"
                }
            ]
        },
        "_version": "5",
        "_auto_indent": "NO"
    }
}
