{
    "compendium": {
        "class": {
            "name": "Sorcerer",
            "autolevel": [
                {
                    "feature": {
                        "name": "Sorcerous Origin: Divine Soul",
                        "text": [
                            "Sometimes the spark of magic that fuels a sorcerer comes from a divine source that glimmers within the soul. Having such a blessed soul is a sign that your innate magic might come from a distant but powerful familial connection to a divine being. Perhaps your ancestor was an angel, transformed into a mortal and sent to fight in a god's name.",
                            "Or your birth might align with an ancient prophecy, marking you as a servant of the gods or a chosen vessel of divine magic.",
                            "A Divine Soul, with a natural magnetism, is seen as a threat by some religious hierarchies. As an outsider who commands sacred power, a Divine Soul can undermine an existing order by claiming a direct tie to the divine.",
                            "In some cultures, only those who can claim the power of a Divine Soul may command religious power. In these lands, ecclesiastical positions are dominated by a few bloodlines and preserved over generations.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Divine Soul: Divine Magic",
                        "text": [
                            "Your link to the divine allows you to learn spells from the cleric class. When your Spellcasting feature lets you learn or replace a sorcerer cantrip or a sorcerer spell of 1st level or higher, you can choose the new spell from the cleric spell list or the sorcerer spell list. You must otherwise obey all the restrictions for selecting the spell, and it becomes a sorcerer spell for you.",
                            "In addition, choose an affinity for the source of your divine power: good, evil, law, chaos, or neutrality. You learn an additional spell based on that affinity, as shown below. It is a sorcerer spell for you, but it doesn't count against your number of sorcerer spells known. If you later replace this spell, you must replace it with a spell from the cleric spell list.",
                            "",
                            "Affinity | Spell",
                            "Good | cure wounds",
                            "Evil | inflict wounds",
                            "Law | bless",
                            "Chaos | bane",
                            "Neutrality | protection from evil and good",
                            "",
                            "Source: Xanathar's Guide to Everything p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Divine Soul: Favored by the Gods",
                        "text": [
                            "Starting at 1st level, divine power guards your destiny. If you fail a saving throw or miss with an attack roll, you can roll 2d4 and add it to the total, possibly changing the outcome. Once you use this feature, you can't use it again until you finish a short or long rest.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Sorcerous Origin: Shadow Magic",
                        "text": [
                            "You are a creature of shadow, for your innate magic comes from the Shadowfell itself. You might trace your lineage to an entity from that place, or perhaps you were exposed to its fell energy and transformed by it.",
                            "The power of shadow magic casts a strange pall over your physical presence. The spark of life that sustains you is muffled, as if it struggles to remain viable against the dark energy that imbues your soul. At your option, you can pick from or roll on the Shadow Sorcerer Quirks table to create a quirk for your character.",
                            "",
                            "Shadow Sorcerer Quirks",
                            "d6 | Quirk",
                            "1 | You are always icy cold to the touch.",
                            "2 | When you are asleep, you don't appear to breathe (though you must still breathe to survive).",
                            "3 | You barely bleed, even when badly injured.",
                            "4 | Your heart beats once per minute. This event sometimes surprises you.",
                            "5 | You have trouble remembering that living creatures and corpses should be treated differently.",
                            "6 | You blinked. Once. Last week.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Shadow Magic: Eyes of the Dark",
                        "text": [
                            "Starting at 1st level, you have darkvision with a range of 120 feet.",
                            "When you reach 3rd level in this class, you learn the darkness spell, which doesn't count against your number of sorcerer spells known. In addition, you can cast it by spending 2 sorcery points or by expending a spell slot. If you cast it with sorcery points, you can see through the darkness created by the spell.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Shadow Magic: Strength of the Grave",
                        "text": [
                            "Starting at 1st level, your existence in a twilight state between life and death makes you difficult to defeat. When damage reduces you to 0 hit points, you can make a Charisma saving throw (DC 5 + the damage taken). On a success, you instead drop to 1 hit point. You can't use this feature if you are reduced to 0 hit points by radiant damage or by a critical hit.",
                            "After the saving throw succeeds, you can't use this feature again until you finish a long rest.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Sorcerous Origin: Storm Sorcery",
                        "text": [
                            "Your innate magic comes from the power of elemental air. Many with this power can trace their magic back to a near-death experience caused by the Great Rain, but perhaps you were born during a howling gale so powerful that folk still tell stories of it, or your lineage might include the influence of potent air creatures such as djinn. Whatever the case, the magic of the storm permeates your being.",
                            "Storm sorcerers are invaluable members of a ship's crew. Their magic allows them to exert control over wind and weather in their immediate area. Their abilities also prove useful in repelling attacks by sahuagin, pirates, and other waterborne threats.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 51"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Storm Sorcery: Tempestuous Magic",
                        "text": [
                            "Starting at 1st level, you can use a bonus action on your turn to cause whirling gusts of elemental air to briefly surround you, immediately before or after you cast a spell of 1st level or higher. Doing so allows you to fly up to 10 feet without provoking opportunity attacks.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 51"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Storm Sorcery: Wind Speaker",
                        "text": [
                            "The arcane magic you command is infused with elemental air. You can speak, read, and write Primordial. Knowing this language allows you to understand and be understood by those who speak its dialects: Aquan, Auran, Ignan, and Terran.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 51"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "1"
                },
                {
                    "feature": {
                        "name": "Divine Soul: Empowered Healing",
                        "text": [
                            "Starting at 6th level, the divine energy coursing through you can empower healing spells. Whenever you or an ally within 5 feet of you rolls dice to determine the number of hit points a spell restores, you can spend 1 sorcery point to reroll any number of those dice once, provided you aren't incapacitated. You can use this feature only once per turn.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Shadow Magic: Hound of Ill Omen",
                        "text": [
                            "At 6th level, you gain the ability to call forth a howling creature of darkness to harass your foes. As a bonus action, you can spend 3 sorcery points to magically summon a hound of ill omen to target one creature you can see within 120 feet of you. The hound uses the dire wolf's statistics (see the Monster Manual or appendix C in the Player's Handbook), with the following changes:",
                            "• The hound is size Medium, not Large, and it counts as a monstrosity, not a beast.",
                            "• It appears with a number of temporary hit points equal to half your sorcerer level.",
                            "• It can move through other creatures and objects as if they were difficult terrain. The hound takes 5 force damage if it ends its turn inside an object.",
                            "• At the start of its turn, the hound automatically knows its target's location. If the target was hidden, it is no longer hidden from the hound.",
                            "The hound appears in an unoccupied space of your choice within 30 feet of the target. Roll initiative for the hound. On its turn, it can move only toward its target by the most direct route, and it can use its action only to attack its target. The hound can make opportunity attacks, but only against its target. Additionally, while the hound is within 5 feet of the target, the target has disadvantage on saving throws against any spell you cast. The hound disappears if it is reduced to 0 hit points, if its target is reduced to 0 hit points, or after 5 minutes.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Storm Sorcery: Heart of the Storm",
                        "text": [
                            "At 6th level, you gain resistance to lightning and thunder damage. In addition, whenever you start casting a spell of 1st level or higher that deals lightning or thunder damage, stormy magic erupts from you. This eruption causes creatures of your choice that you can see within 10 feet of you to take lightning or thunder damage (choose each time this ability activates) equal to half your sorcerer level.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 51"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Storm Sorcery: Storm Guide",
                        "text": [
                            "At 6th level, you gain the ability to subtly control the weather around you.",
                            "If it is raining, you can use an action to cause the rain to stop falling in a 20-foot-radius sphere centered on you. You can end this effect as a bonus action.",
                            "If it is windy, you can use a bonus action each round to choose the direction that the wind blows in a 100-foot-radius sphere centered on you. The wind blows in that direction until the end of your next turn. This feature doesn't alter the speed of the wind.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 51"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "6"
                },
                {
                    "feature": {
                        "name": "Divine Soul: Otherworldly Wings",
                        "text": [
                            "Starting at 14th level, you can use a bonus action to manifest a pair of spectral wings from your back. While the wings are present, you have a flying speed of 30 feet. The wings last until you're incapacitated, you die, or you dismiss them as a bonus action.",
                            "The affinity you chose for your Divine Magic feature determines the appearance of the spectral wings: eagle wings for good or law, bat wings for evil or chaos, and dragonfly wings for neutrality.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "14"
                },
                {
                    "feature": {
                        "name": "Shadow Magic: Shadow Walk",
                        "text": [
                            "At 14th level, you gain the ability to step from one shadow into another. When you are in dim light or darkness, as a bonus action, you can magically teleport up to 120 feet to an unoccupied space you can see that is also in dim light or darkness.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "14"
                },
                {
                    "feature": {
                        "name": "Storm Sorcery: Storm's Fury",
                        "text": [
                            "Starting at 14th level, when you are hit by a melee attack, you can use your reaction to deal lightning damage to the attacker. The damage equals your sorcerer level. The attacker must also make a Strength saving throw against your sorcerer spell save DC. On a failed save, the attacker is pushed in a straight line up to 20 feet away from you.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 51"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "14"
                },
                {
                    "feature": {
                        "name": "Divine Soul: Unearthly Recovery",
                        "text": [
                            "At 18th level, you gain the ability to overcome grievous injuries. As a bonus action when you have fewer than half of your hit points remaining, you can regain a number of hit points equal to half your hit point maximum.",
                            "Once you use this feature, you can't use it again until you finish a long rest.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "18"
                },
                {
                    "feature": {
                        "name": "Shadow Magic: Umbral Form",
                        "text": [
                            "Starting at 18th level, you can spend 6 sorcery points as a bonus action to magically transform yourself into a shadowy form. In this form, you have resistance to all damage except force and radiant damage, and you can move through other creatures and objects as if they were difficult terrain. You take 5 force damage if you end your turn inside an object.",
                            "You remain in this form for 1 minute. It ends early if you are incapacitated, if you die, or if you dismiss it as a bonus action.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 50"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "18"
                },
                {
                    "feature": {
                        "name": "Storm Sorcery: Wind Soul",
                        "text": [
                            "At 18th level, you gain immunity to lightning and thunder damage.",
                            "You also gain a magical flying speed of 60 feet. As an action, you can reduce your flying speed to 30 feet for 1 hour and choose a number of creatures within 30 feet of you equal to 3 + your Charisma modifier. The chosen creatures gain a magical flying speed of 30 feet for 1 hour. Once you reduce your flying speed in this way, you can't do so again until you finish a short or long rest.",
                            "",
                            "Source: Xanathar's Guide to Everything p. 51"
                        ],
                        "_optional": "YES"
                    },
                    "_level": "18"
                }
            ]
        },
        "_version": "5",
        "_auto_indent": "NO"
    }
}
