{"compendium":{"monster":[{"name":"Amber Golem","size":"L","type":"construct","alignment":"Unaligned","ac":"17 (natural armor)","hp":"178 (17d10+85)","speed":"walk 30 ft.","str":"22","dex":"9","con":"20","int":"3","wis":"11","cha":"1","save":"","skill":"","passive":"10","languages":"understands the languages of its creator but can't speak","cr":"10","resist":"","immune":"poison, psychic; bludgeoning, piercing, slashing from nonmagical attacks that aren't adamantine","vulnerable":"","conditionImmune":"charmed, exhaustion, frightened, paralyzed, petrified, poisoned","senses":"darkvision 120 ft.","trait":[{"name":"Immutable Form","text":"The golem is immune to any spell or effect that would alter its form."},{"name":"Magic Resistance","text":"The golem has advantage on saving throws against spells and other magical effects."},{"name":"Magic Weapons","text":"The golem's weapon attacks are magical."}],"action":[{"name":"Multiattack","text":"The golem makes two slam attacks."},{"name":"Slam","text":"Melee Weapon Attack: +10 to hit, reach 5 ft., one target. 19 (3d8 + 6) bludgeoning damage.","attack":"Slam|+10|3d8+6"},{"name":"Slow (Recharge 5-6)","text":"The golem targets one or more creatures it can see within 10 feet of it. Each target must make a DC 17 Wisdom saving throw against this magic. On a failed save, a target can't use reactions, its speed is halved, and it can't make more than one attack on its turn. In addition, the target can take either an action or a bonus action on its turn, not both. These effects last for 1 minute. A target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."}],"description":"Source: Curse of Strahd p. 186","environment":""},{"name":"Anastrasya Karelova","size":"M","type":"undead","alignment":"Neutral Evil","ac":"15 (natural armor)","hp":"82 (11d8+33)","speed":"walk 30 ft.","str":"16","dex":"16","con":"16","int":"11","wis":"10","cha":"12","save":"Dex +6, Wis +3","skill":"Perception +3, Stealth +6","passive":"13","languages":"the languages it knew in life","cr":"5","resist":"necrotic; bludgeoning, piercing, slashing from nonmagical attacks","immune":"","vulnerable":"","conditionImmune":"","senses":"darkvision 60 ft.","trait":[{"name":"Regeneration","text":"Anastrasya regains 10 hit points at the start of its turn if it has at least 1 hit point and isn't in sunlight or running water. If Anastrasya takes radiant damage or damage from holy water, this trait doesn't function at the start of Anastrasya's next turn."},{"name":"Spider Climb","text":"Anastrasya can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."},{"name":"Vampire Weaknesses","text":["Anastrasya has the following flaws:","Forbiddance. Anastrasya can't enter a residence without an invitation from one of the occupants.","Harmed by Running Water. Anastrasya takes 20 acid damage when it ends its turn in running water.","Stake to the Heart. Anastrasya is destroyed if a piercing weapon made of wood is driven into its heart while it is incapacitated in its resting place.","Sunlight Hypersensitivity. Anastrasya takes 20 radiant damage when it starts its turn in sunlight. While in sunlight, it has disadvantage on attack rolls and ability checks."]}],"action":[{"name":"Multiattack","text":"Anastrasya makes two attacks, only one of which can be a bite attack."},{"name":"Bite","text":"Melee Weapon Attack: +6 to hit, reach 5 ft., one willing creature, or a creature that is grappled by Anastrasya, incapacitated, or restrained. 6 (1d6 + 3) piercing damage plus 7 (2d6) necrotic damage. The target's hit point maximum is reduced by an amount equal to the necrotic damage taken, and Anastrasya regains hit points equal to that amount. The reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hit point maximum to 0.","attack":"Bite|+6|1d6+3"},{"name":"Claws","text":"Melee Weapon Attack: +6 to hit, reach 5 ft., one creature. 8 (2d4 + 3) slashing damage. Instead of dealing damage, Anastrasya can grapple the target (escape DC 13).","attack":"Claws|+6|2d4+3"}],"description":"Source: Curse of Strahd p. 93","environment":"underdark, urban"},{"name":"Animated Halberd","size":"S","type":"construct","alignment":"Unaligned","ac":"17 (natural armor)","hp":"17 (5d6)","speed":"walk 0 ft., fly 50 ft.","str":"12","dex":"15","con":"11","int":"1","wis":"5","cha":"1","save":"Dex +4","skill":"","passive":"7","languages":"","cr":"1/4","resist":"","immune":"poison, psychic","vulnerable":"","conditionImmune":"blinded, charmed, deafened, frightened, paralyzed, petrified, poisoned","senses":"blindsight 60 ft. (blind beyond this radius)","trait":[{"name":"Antimagic Susceptibility","text":"The sword is incapacitated while in the area of an antimagic field. If targeted by dispel magic, the sword must succeed on a Constitution saving throw against the caster's spell save DC or fall unconscious for 1 minute."},{"name":"False Appearance","text":"While the sword remains motionless and isn't flying, it is indistinguishable from a normal sword."}],"action":{"name":"Longsword","text":"Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 5 (1d8 + 1) slashing damage.","attack":"Longsword|+3|1d8+1"},"description":"Source: Curse of Strahd p. 59","environment":""},{"name":"Arabelle","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"10","hp":"2 (1d8)","speed":"walk 30 ft.","str":"10","dex":"10","con":"10","int":"10","wis":"10","cha":"10","save":"","skill":"","passive":"10","languages":"any one language (usually Common)","cr":"0","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","description":"Source: Curse of Strahd p. 38","environment":"arctic, desert, coastal, grassland, hill, urban, forest"},{"name":"Armored Saber-Toothed Tiger","size":"L","type":"beast","alignment":"Unaligned","ac":"12","hp":"84 (7d10+14)","speed":"walk 40 ft.","str":"18","dex":"14","con":"15","int":"3","wis":"12","cha":"8","save":"","skill":"Perception +3, Stealth +6","passive":"13","languages":"","cr":"2","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Keen Smell","text":"The tiger has advantage on Wisdom (Perception) checks that rely on smell."},{"name":"Pounce","text":"If the tiger moves at least 20 feet straight toward a creature and then hits it with a claw attack on the same turn, that target must succeed on a DC 14 Strength saving throw or be knocked prone. If the target is prone, the tiger can make one bite attack against it as a bonus action."}],"action":[{"name":"Bite","text":"Melee Weapon Attack: +6 to hit, reach 5 ft., one target. 10 (1d10 + 5) piercing damage.","attack":"Bite|+6|1d10+5"},{"name":"Claw","text":"Melee Weapon Attack: +6 to hit, reach 5 ft., one target. 12 (2d6 + 5) slashing damage.","attack":"Claw|+6|2d6+5"}],"description":"Source: Curse of Strahd p. 115","environment":"mountain, arctic"},{"name":"Arrigal","size":"M","type":"humanoid (any race)","alignment":"Any Non-Good Alignment","ac":"15 (studded leather armor)","hp":"78 (12d8+24)","speed":"walk 30 ft.","str":"11","dex":"16","con":"14","int":"13","wis":"11","cha":"10","save":"Dex +6, Int +4","skill":"Acrobatics +6, Deception +3, Perception +3, Stealth +9","passive":"13","languages":"Thieves' cant plus any two languages","cr":"8","resist":"poison","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Assassinate","text":"During its first turn, Arrigal has advantage on attack rolls against any creature that hasn't taken a turn. Any hit Arrigal scores against a surprised creature is a critical hit."},{"name":"Evasion","text":"If Arrigal is subjected to an effect that allows it to make a Dexterity saving throw to take only half damage, Arrigal instead takes no damage if it succeeds on the saving throw, and only half damage if it fails."},{"name":"Sneak Attack (1/Turn)","text":"Arrigal deals an extra 14 (4d6) damage when it hits a target with a weapon attack and has advantage on the attack roll, or when the target is within 5 feet of an ally of Arrigal that isn't incapacitated and Arrigal doesn't have disadvantage on the attack roll."}],"action":[{"name":"Multiattack","text":"Arrigal makes two shortsword attacks."},{"name":"Shortsword","text":"Melee Weapon Attack: +6 to hit, reach 5 ft., one target. 6 (1d6 + 3) piercing damage, and the target must make a DC 15 Constitution saving throw, taking 24 (7d6) poison damage on a failed save, or half as much damage on a successful one.","attack":["Shortsword|+6|1d6+3","Shortsword||7d6"]},{"name":"Light Crossbow","text":"Ranged Weapon Attack: +6 to hit, range 80/320 ft., one target. 7 (1d8 + 3) piercing damage, and the target must make a DC 15 Constitution saving throw, taking 24 (7d6) poison damage on a failed save, or half as much damage on a successful one.","attack":["Light Crossbow|+6|1d8+3","Light Crossbow||7d6"]}],"description":"Source: Curse of Strahd p. 121","environment":""},{"name":"Baba Lysaga","size":"M","type":"humanoid (human, shapechanger)","alignment":"Chaotic Evil","ac":"15 (natural armor)","hp":"120 (16d8+48)","speed":"walk 30 ft.","str":"18","dex":"10","con":"16","int":"20","wis":"17","cha":"13","save":"Wis +7","skill":"Arcana +13, Religion +13","passive":"13","languages":"Abyssal, Common, Draconic, Dwarvish, Giant","cr":"11","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Shapechanger","text":"Baba Lysaga can use an action to polymorph into a swarm of insects (flies), or back into her true form. While in swarm form, she has a walking speed of 5 feet and a flying speed of 30 feet. Anything she is wearing transforms with her, but nothing she is carrying does."},{"name":"Blessing of Mother Night","text":"Baba Lysaga is shielded against divination magic, as though protected by a nondetection spell."},{"name":"Spellcasting","text":["Baba Lysaga is a 16th-level spellcaster. Her spellcasting ability is Intelligence (spell save DC 17, +9 to hit with spell attacks). Baba Lysaga has the following wizard spells prepared:","Cantrips (at will): acid splash, fire bolt, light, mage hand, prestidigitation","• 1st level (4 slots): detect magic, magic missile, sleep, witch bolt","• 2nd level (3 slots): crown of madness, enlarge/reduce, misty step","• 3rd level (3 slots): dispel magic, fireball, lightning bolt","• 4th level (3 slots): blight, Evard's black tentacles, polymorph","• 5th level (2 slots): cloudkill, geas, scrying","• 6th level (1 slots): programmed illusion, true seeing","• 7th level (1 slots): finger of death, mirage arcane","• 8th level (1 slots): power word stun"]}],"action":[{"name":"Multiattack","text":"Baba Lysaga makes three attacks with her quarterstaff."},{"name":"Quarterstaff","text":"Melee Weapon Attack: +8 to hit, reach 5 ft., one target. 7 (1d6 + 4) bludgeoning damage, or 8 (1d8 + 4) bludgeoning damage if wielded with two hands.","attack":"Quarterstaff|+8|1d6+4"},{"name":"Summon Swarms of Insects (Recharges after a Short or Long Rest)","text":"Baba Lysaga summons 1d4 swarms of insects. A summoned swarm appears in an unoccupied space within 60 feet of Baba Lysaga and acts as her ally. It remains until it dies or until Baba Lysaga dismisses it as an action."}],"slots":"4, 3, 3, 3, 2, 1, 1, 1","spells":"acid splash, fire bolt, light, mage hand, prestidigitation, detect magic, magic missile, sleep, witch bolt, crown of madness, enlarge/reduce, misty step, dispel magic, fireball, lightning bolt, blight, Evard's black tentacles, polymorph, cloudkill, geas, scrying, programmed illusion, true seeing, finger of death, mirage arcane, power word stun","description":"Two women gave life to Strahd von Zarovich. The first was Queen Ravenovia van Roeyen, Strahd's biological mother. The second was the queen's midwife, a devout follower of Mother Night named Baba Lysaga. Although it was the former who raised Strahd and enabled him to follow in his father's footsteps, it was the latter who sensed a potential for greatness and darkness in Strahd surpassing that of any other mortal. Lysaga believed then, as she believes now, that she is Strahd's true mother.\nOther Mother. When Strahd was still a baby in his crib, Baba Lysaga cast protective spells on him and crept into his nursery on stormy nights to sing magical rhymes to him. She also placed the \"spark of magic\" in him, ensuring that he would become a spellcaster.\nBaba Lysaga's unhealthy attachment to the baby Strahd did not go unnoticed. After she received several disturbing reports, Queen Ravenovia was forced to banish the midwife from the kingdom. Lysaga never saw Strahd again, but she has succeeded in staying alive to witness the triumphs of her beloved boy, who, in her mind, is eternally blessed. Despite the horrors Strahd has wrought, Lysaga still envisions him as the perfect child she delivered into the world. Strahd is the only thing in her life that matters to her.\nMother Nearest. During her exile, Baba Lysaga made countless sacrifices to Mother Night, pleading with the goddess to afflict Queen Ravenovia with ill health and visit death upon her. Lysaga eventually got her wish, and after Strahd settled in the valley of Barovia, Lysaga moved as close to him as she dared to.\nIn the filth-ridden depths of her heart, Lysaga knows that Strahd would never accept her as his true mother, nor could she bear his rejection. As a result, she has never confronted him. She would rather exist in perpetual denial, whiling away the days, months, and years practicing fell magic and looking for ways to help her \"son.\"\nRaven Bane. Baba Lysaga has allies in Castle Ravenloft - a coven of witches. Through the aid of these witches, Lysaga recently uncovered a potential threat to Strahd: a secret society of wereravens called the Keepers of the Feather, a group that uses ordinary ravens as their spies.\nStrahd doesn't consider the wereravens a serious threat, but Lysaga has chosen to make them the bane of her existence. After much searching and scrying, she discovered a wereraven refuge at the Wizard of Wines winery (chapter 12), and she has begun to wage war against it. In addition, she has forged an alliance with the mad druids that haunt Yester Hill (chapter 14), convincing them that she gave birth to Strahd, whom the druids consider a god. With the druids on her side, she expects to rid Barovia of its wereraven menace.\nGifts of Mother Night. The goddess Mother Night has bestowed magical gifts on Baba Lysaga as rewards for her ceaseless devotion to Strahd. Her skin has the resilience of stone, she is resistant to harmful magic, and she is shielded against divination magic. Mother Night has also imparted to Lysaga the secret of longevity, which requires her to bathe in the blood of beasts on nights of the new moon. Failure to do so causes Lysaga to age rapidly, becoming mere dust and bones in a matter of seconds.\nBaba Lysaga's Traits. Ideal. \"No love is greater than a mother's love for her son.\"\nBond. \"I am the mother of Strahd. Anyone who disputes this fact can rot.\"\nFlaw. \"I will not rest until the last of my son's enemies are destroyed.\"\nSource: Curse of Strahd p. 228","environment":""},{"name":"Baba Lysaga's Creeping Hut","size":"G","type":"construct","alignment":"Unaligned","ac":"16 (natural armor)","hp":"263 (17d20+85)","speed":"walk 30 ft.","str":"26","dex":"7","con":"20","int":"1","wis":"3","cha":"3","save":"Con +9, Wis +0, Cha +0","skill":"","passive":"6","languages":"","cr":"11","resist":"","immune":"poison, psychic","vulnerable":"","conditionImmune":"blinded, charmed, deafened, exhaustion, frightened, paralyzed, petrified, prone","senses":"blindsight 120 ft. (blind beyond this radius)","trait":[{"name":"Constructed Nature","text":["An animated object doesn't require air, food, drink, or sleep.","The magic that animates an object is dispelled when the construct drops to 0 hit points. An animated object reduced to 0 hit points becomes inanimate and is too damaged to be of much use or value to anyone."]},{"name":"Antimagic Susceptibility","text":"The hut is incapacitated while the magic gem that animates it is in the area of an antimagic field. If targeted by dispel magic, the hut must succeed on a Constitution saving throw against the caster's spell save DC or fall unconscious for 1 minute."},{"name":"Siege Monster","text":"The hut deals double damage to objects and structures."}],"action":[{"name":"Multiattack","text":"The hut makes three attacks with its roots. It can replace one of these attacks with a rock attack."},{"name":"Root","text":"Melee Weapon Attack: +12 to hit, reach 60 ft., one target. 30 (4d10 + 8) bludgeoning damage.","attack":"Root|+12|4d10+8"},{"name":"Rock","text":"Ranged Weapon Attack: +12 to hit, range 120 ft., one target. 21 (3d8 + 8) bludgeoning damage.","attack":"Rock|+12|3d8+8"}],"description":"Baba Lysaga built a hut atop the rotting stump of a giant tree that was felled long ago. It was only after she embedded a magic gemstone in the hut that the whole thing was imbued with a semblance of life. When she wills it to do so, the hut pulls its gigantic roots free of the earth and shambles around like a spidery behemoth, shaking the ground with every step. The hut attacks with its flailing and stomping roots. It can also use its roots to fling large rocks.\nHut Interior. The hut is a 15-foot-square, ramshackle wooden building with a gently sloping thatch roof. Its furnishings have been bolted to the floor, since the hut lurches from side to side when it walks.\nHeart of the Hut. The gemstone that has given life to Baba Lysaga's hut was previously buried in the Wizard of Wines vineyard. The gem was one of three imbued with life-giving magic that made the grapevines in the vineyard healthier, guaranteeing the finest wines. Baba Lysaga stole one of the gems and perverted its magic, using it instead to animate her wooden hut.\nRemoving the gem from the hut renders the hut incapacitated. That task is easier said than done, however. The glowing green gem is contained in a cavity in the stump, beneath the rotted floorboards of the hut. The floorboards can be ripped up with a successful DC 14 Strength check or smashed by dealing 10 damage to them. Once the floorboards are out of the way, a creature can reach into the cavity and snatch the gem. But if someone attempts this while the hut is alive, the cavity sprouts wooden teeth, becoming a mouth that bites anything that tries to remove the gem; a creature trying to remove the gem must make a DC 20 Dexterity saving throw. On a successful save, the creature claims the stone without getting bitten. On a failed save, the creature is bitten for 10 (3d6) piercing damage and fails to obtain the gem.\nSource: Curse of Strahd p. 226","environment":""},{"name":"Baron Vargas Vallakovich","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"15 (breastplate)","hp":"9 (2d8)","speed":"walk 30 ft.","str":"11","dex":"12","con":"11","int":"12","wis":"14","cha":"16","save":"","skill":"Deception +5, Insight +4, Persuasion +5","passive":"12","languages":"any two languages","cr":"1/8","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","action":{"name":"Rapier","text":"Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 5 (1d8 + 1) piercing damage.","attack":"Rapier|+3|1d8+1"},"reaction":{"name":"Parry","text":"Vargas adds 2 to its AC against one melee attack that would hit it. To do so, Vargas must see the attacker and be wielding a melee weapon."},"description":"Source: Curse of Strahd p. 105","environment":""},{"name":"Barovian Commoner","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"10","hp":"4 (1d8)","speed":"walk 30 ft.","str":"10","dex":"10","con":"10","int":"10","wis":"10","cha":"10","save":"","skill":"","passive":"10","languages":"any one language (usually Common)","cr":"0","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","action":{"name":"Club","text":"Melee Weapon Attack: +2 to hit, reach 5 ft., one target. 2 (1d4) bludgeoning damage.","attack":"Club|+2|1d4"},"description":"Source: Curse of Strahd p. 29","environment":"arctic, desert, coastal, grassland, hill, urban, forest"},{"name":"Barovian Scout","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"13 (leather armor)","hp":"16 (3d8+3)","speed":"walk 30 ft.","str":"11","dex":"14","con":"12","int":"11","wis":"13","cha":"11","save":"","skill":"Nature +4, Perception +5, Stealth +6, Survival +5","passive":"15","languages":"any one language (usually Common)","cr":"1/2","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":{"name":"Keen Hearing and Sight","text":"The scout has advantage on Wisdom (Perception) checks that rely on hearing or sight."},"action":[{"name":"Multiattack","text":"The scout makes two melee attacks or two ranged attacks."},{"name":"Shortsword","text":"Melee Weapon Attack: +4 to hit, reach 5 ft., one target. 5 (1d6 + 2) piercing damage.","attack":"Shortsword|+4|1d6+2"},{"name":"Light Crossbows","text":"Ranged Weapon Attack: +4 to hit, ranged 80/320 ft., one target. 6 (1d8 + 2) piercing damage.","attack":"Light Crossbows|+4|1d8+2"}],"description":"Source: Curse of Strahd p. 29","environment":""},{"name":"Barovian Witch","size":"M","type":"humanoid (human)","alignment":"Chaotic Evil","ac":"10","hp":"16 (3d8+3)","speed":"walk 30 ft.","str":"7","dex":"11","con":"13","int":"14","wis":"11","cha":"12","save":"","skill":"Arcana +4, Perception +2","passive":"12","languages":"Common","cr":"1/2","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"darkvision 60 ft.","action":[{"name":"Claws (Requires Alter Self)","text":"Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 4 (1d6 + 1) slashing damage. This attack is magical.","attack":"Claws (Requires Alter Self)|+3|1d6+1"},{"name":"Dagger","text":"Melee or Ranged Weapon Attack: +2 to hit, reach 5 ft. or range 20/60 ft., one target. 2 (1d4) piercing damage.","attack":"Dagger|+2|1d4"}],"trait":{"name":"Spellcasting","text":["The witch is a 3rd-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 12, +4 to hit with spell attacks). The witch has the following wizard spells prepared:","Cantrips (at will): mage hand, prestidigitation, ray of frost","• 1st level (4 slots): ray of sickness, sleep, Tasha's hideous laughter","• 2nd level (2 slots): alter self, invisibility"]},"slots":"4, 2","spells":"mage hand, prestidigitation, ray of frost, ray of sickness, sleep, Tasha's hideous laughter, alter self, invisibility","description":"The mad women and men known as Barovian witches forge pacts with Strahd and the Dark Powers of Ravenloft in exchange for magic and longevity. They prefer to live in the shadows and can see in the dark. When traveling in the open, they use alter self spells to assume less conspicuous forms. They also use these spells to grow long, sharp claws with which they can attack.\nBrothers and Sisters of Strahd. Barovian witches have no scruples. They will deal with anyone in return for power. They will also betray anyone for the same reason. The only thing they fear is Strahd, and his wish is their command. Barovian witches sometimes refer to themselves as the brothers and sisters of Strahd, though never to Strahd's face.\nPack Rats with Cats.  Barovian witches are obsessive collectors, each believing that almost anything found - a piece of broken bone, a dead rodent, a handful of dust, or some other worthless item or substance - could be valuable or useful as a spell component, a ritual object, or a potion ingredient.\nBarovian witches use the find familiar spell to call forth familiars. They are particularly fond of cats, though snakes and toads are also common. These animals lurk amid the clutter of the witches' lairs, seldom wandering far from their vile masters.\nSource: Curse of Strahd p. 229","environment":""},{"name":"Beucephalus","size":"L","type":"fiend","alignment":"Neutral Evil","ac":"13 (natural armor)","hp":"104 (8d10+24)","speed":"walk 60 ft., fly 90 ft.","str":"18","dex":"15","con":"16","int":"10","wis":"13","cha":"15","save":"","skill":"","passive":"11","languages":"understands Abyssal, Common, and Infernal but can't speak","cr":"3","resist":"","immune":"fire","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Confer Fire Resistance","text":"Beucephalus can grant resistance to fire damage to anyone riding it."},{"name":"Illumination","text":"Beucephalus sheds bright light in a 10-foot radius and dim light for an additional 10 feet."}],"action":[{"name":"Hooves","text":"Melee Weapon Attack: +6 to hit, reach 5 ft., one target. 13 (2d8 + 4) bludgeoning damage plus 7 (2d6) fire damage.","attack":"Hooves|+6|2d8+4"},{"name":"Ethereal Stride","text":"Beucephalus and up to three willing creatures within 5 feet of it magically enter the Ethereal Plane from the Material Plane, or vice versa."}],"description":"Source: Curse of Strahd p. 93","environment":""},{"name":"Bluto Krogarov","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"10","hp":"4 (1d8)","speed":"walk 30 ft.","str":"10","dex":"10","con":"10","int":"10","wis":"10","cha":"10","save":"","skill":"","passive":"10","languages":"any one language (usually Common)","cr":"0","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","action":{"name":"Club","text":"Melee Weapon Attack: +2 to hit, reach 5 ft., one target. 2 (1d4) bludgeoning damage.","attack":"Club|+2|1d4"},"description":"Source: Curse of Strahd p. 38","environment":"arctic, desert, coastal, grassland, hill, urban, forest"},{"name":"Broom of Animated Attack","size":"S","type":"construct","alignment":"Unaligned","ac":"15 (natural armor)","hp":"17 (5d6)","speed":"walk 0 ft., fly 50 ft.","str":"10","dex":"17","con":"10","int":"1","wis":"5","cha":"1","save":"","skill":"","passive":"7","languages":"","cr":"1/4","resist":"","immune":"poison, psychic","vulnerable":"","conditionImmune":"blinded, charmed, deafened, exhaustion, frightened, paralyzed, petrified, poisoned, prone","senses":"blindsight 30 ft. (blind beyond this radius)","trait":[{"name":"Constructed Nature","text":["An animated object doesn't require air, food, drink, or sleep.","The magic that animates an object is dispelled when the construct drops to 0 hit points. An animated object reduced to 0 hit points becomes inanimate and is too damaged to be of much use or value to anyone."]},{"name":"Antimagic Susceptibility","text":"The broom is incapacitated while in the area of an antimagic field. If targeted by dispel magic, the broom must succeed on a Constitution saving throw against the caster's spell save DC or fall unconscious for 1 minute."},{"name":"False Appearance","text":"While the broom remains motionless and isn't flying, it is indistinguishable from a normal broom."}],"action":[{"name":"Multiattack","text":"The broom makes two melee attacks."},{"name":"Broomstick","text":"Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 5 (1d4 + 3) bludgeoning damage.","attack":"Broomstick|+5|1d4+3"}],"reaction":{"name":"Animated Attack","text":"If the broom is motionless and a creature grabs hold of it, the broom makes a Dexterity check contested by the creature's Strength check. If the broom wins the contest, it flies out of the creature's grasp and makes a melee attack against it with advantage on the attack roll."},"description":"A broom of animated attack is easily mistaken for a broom of flying. It attacks any creature that grabs it or tries to ride it.\nFlying Broom. Some brooms of animated attack allow their creators to ride them, in which case they behave like typical brooms of flying. A broom of animated attack, however, can carry only half the weight that a broom of flying can (see chapter 7, \"Treasure,\" of the Dungeon Master's Guide).\nSource: Curse of Strahd p. 226","environment":""},{"name":"Clovin Belview","size":"M","type":"humanoid (mongrelfolk)","alignment":"Any alignment","ac":"11 (natural armor)","hp":"26 (4d8+8)","speed":"walk 20 ft.","str":"12","dex":"9","con":"15","int":"9","wis":"10","cha":"6","save":"","skill":"Deception +2, Perception +2, Stealth +3","passive":"12","languages":"Common","cr":"1/4","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Two-Headed","text":"The mongrelfolk has advantage on Wisdom (Perception) checks and on saving throws against being blinded, charmed, deafened, frightened, stunned, or knocked unconscious."},{"name":"Mimicry","text":"Clovin can mimic any sounds it has heard, including voices. A creature that hears the sounds can tell they are imitations with a successful DC 12 Wisdom (Insight) check."}],"action":[{"name":"Multiattack","text":"Clovin makes two attacks: one with its bite and one with its claw or dagger."},{"name":"Bite","text":"Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 3 (1d4 + 1) piercing damage.","attack":"Bite|+3|1d4+1"},{"name":"Claw","text":"Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 3 (1d4 + 1) slashing damage.","attack":"Claw|+3|1d4+1"},{"name":"Dagger","text":"Melee or Ranged Weapon Attack: +3 to hit, reach 5 ft. or range 20/60 ft., one target. 3 (1d4 + 1) piercing damage.","attack":"Dagger|+3|1d4+1"}],"description":"Source: Curse of Strahd p. 147","environment":""},{"name":"Cyrus Belview","size":"M","type":"humanoid (mongrelfolk)","alignment":"Any alignment","ac":"11 (natural armor)","hp":"26 (4d8+8)","speed":"walk 20 ft.","str":"12","dex":"9","con":"15","int":"9","wis":"10","cha":"6","save":"","skill":"Deception +2, Perception +2, Stealth +3","passive":"12","languages":"Common","cr":"1/4","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Keen Hearing and Smell","text":"The mongrelfolk has advantage on Wisdom (Perception) checks that rely on hearing or smell."},{"name":"Mimicry","text":"Cyrus can mimic any sounds it has heard, including voices. A creature that hears the sounds can tell they are imitations with a successful DC 12 Wisdom (Insight) check."}],"action":[{"name":"Multiattack","text":"Cyrus makes two attacks: one with its bite and one with its claw or dagger."},{"name":"Bite","text":"Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 3 (1d4 + 1) piercing damage.","attack":"Bite|+3|1d4+1"},{"name":"Claw","text":"Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 3 (1d4 + 1) slashing damage.","attack":"Claw|+3|1d4+1"},{"name":"Dagger","text":"Melee or Ranged Weapon Attack: +3 to hit, reach 5 ft. or range 20/60 ft., one target. 3 (1d4 + 1) piercing damage.","attack":"Dagger|+3|1d4+1"}],"description":"Source: Curse of Strahd p. 77","environment":""},{"name":"Davian Martikov","size":"M","type":"humanoid (human, shapechanger)","alignment":"Lawful Good","ac":"12","hp":"31 (7d8)","speed":"walk 30 ft.","str":"10","dex":"15","con":"11","int":"13","wis":"15","cha":"14","save":"","skill":"Insight +4, Perception +6","passive":"16","languages":"Common (can't speak in raven form)","cr":"2","resist":"","immune":"bludgeoning, piercing, slashing from nonmagical attacks not made with silvered weapons","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Shapechanger","text":"Davian can use its action to polymorph into a raven-humanoid hybrid or into a raven, or back into its human form. Its statistics, other than its size, are the same in each form. Any equipment it is wearing or carrying isn't transformed. It reverts to its human form if it dies."},{"name":"Mimicry","text":"Davian can mimic simple sounds it has heard, such as a person whispering, a baby crying, or an animal chittering. A creature that hears the sounds can tell they are imitations with a successful DC 10 Wisdom (Insight) check."}],"action":[{"name":"Multiattack (Human or Hybrid Form Only)","text":"Davian makes two weapon attacks, one of which can be with its hand crossbow."},{"name":"Beak (Raven or Hybrid Form Only)","text":"Melee Weapon Attack: +4 to hit, reach 5 ft., one target. 1 piercing damage in raven form, or 4 (1d4 + 2) piercing damage in hybrid form. If the target is humanoid, it must succeed on a DC 10 Constitution saving throw or be cursed with wereraven lycanthropy.","attack":"Beak (Raven or Hybrid Form Only)|+4|1d4+2"},{"name":"Shortsword (Human or Hybrid Form Only)","text":"Melee Weapon Attack: +4 to hit, reach 5 ft., one target. 5 (1d6 + 2) piercing damage.","attack":"Shortsword (Human or Hybrid Form Only)|+4|1d6+2"},{"name":"Hand Crossbow (Human or Hybrid Form Only)","text":"Ranged Weapon Attack: +4 to hit, range 30/120 ft., one target. 5 (1d6 + 2) piercing damage.","attack":"Hand Crossbow (Human or Hybrid Form Only)|+4|1d6+2"}],"description":"Source: Curse of Strahd p. 173","environment":""},{"name":"Distended Corpse","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"10","hp":"4 (1d8)","speed":"walk 30 ft.","str":"10","dex":"10","con":"10","int":"10","wis":"10","cha":"10","save":"","skill":"","passive":"10","languages":"any one language (usually Common)","cr":"0","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","action":{"name":"Club","text":"Melee Weapon Attack: +2 to hit, reach 5 ft., one target. 2 (1d4) bludgeoning damage.","attack":"Club|+2|1d4"},"description":"Source: Curse of Strahd p. 165","environment":"arctic, desert, coastal, grassland, hill, urban, forest"},{"name":"Donavich","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"10","hp":"9 (2d8)","speed":"walk 30 ft.","str":"10","dex":"10","con":"10","int":"10","wis":"14","cha":"11","save":"","skill":"Medicine +4, Religion +2","passive":"12","languages":"any one language (usually Common)","cr":"1/4","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","action":{"name":"Club","text":"Melee Weapon Attack: +2 to hit, reach 5 ft., one target. 2 (1d4) bludgeoning damage.","attack":"Club|+2|1d4"},"trait":{"name":"Spellcasting","text":["Donavich is a 1st-level spellcaster. Its spellcasting ability is Wisdom (spell save DC 12, +4 to hit with spell attacks). Donavich has following cleric spells prepared:","Cantrips (at will): light, sacred flame, thaumaturgy","• 1st level (3 slots): bless, cure wounds, sanctuary"]},"slots":"3","spells":"light, sacred flame, thaumaturgy, bless, cure wounds, sanctuary","description":"Source: Curse of Strahd p. 46","environment":""},{"name":"Doru","size":"M","type":"undead","alignment":"Neutral Evil","ac":"15 (natural armor)","hp":"82 (11d8+33)","speed":"walk 30 ft.","str":"16","dex":"16","con":"16","int":"11","wis":"10","cha":"12","save":"Dex +6, Wis +3","skill":"Perception +3, Stealth +6","passive":"13","languages":"the languages it knew in life","cr":"5","resist":"necrotic; bludgeoning, piercing, slashing from nonmagical attacks","immune":"","vulnerable":"","conditionImmune":"","senses":"darkvision 60 ft.","trait":[{"name":"Regeneration","text":"Doru regains 10 hit points at the start of its turn if it has at least 1 hit point and isn't in sunlight or running water. If Doru takes radiant damage or damage from holy water, this trait doesn't function at the start of Doru's next turn."},{"name":"Spider Climb","text":"Doru can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."},{"name":"Vampire Weaknesses","text":["Doru has the following flaws:","Forbiddance. Doru can't enter a residence without an invitation from one of the occupants.","Harmed by Running Water. Doru takes 20 acid damage when it ends its turn in running water.","Stake to the Heart. Doru is destroyed if a piercing weapon made of wood is driven into its heart while it is incapacitated in its resting place.","Sunlight Hypersensitivity. Doru takes 20 radiant damage when it starts its turn in sunlight. While in sunlight, it has disadvantage on attack rolls and ability checks."]}],"action":[{"name":"Multiattack","text":"Doru makes two attacks, only one of which can be a bite attack."},{"name":"Bite","text":"Melee Weapon Attack: +6 to hit, reach 5 ft., one willing creature, or a creature that is grappled by Doru, incapacitated, or restrained. 6 (1d6 + 3) piercing damage plus 7 (2d6) necrotic damage. The target's hit point maximum is reduced by an amount equal to the necrotic damage taken, and Doru regains hit points equal to that amount. The reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hit point maximum to 0.","attack":"Bite|+6|1d6+3"},{"name":"Claws","text":"Melee Weapon Attack: +6 to hit, reach 5 ft., one creature. 8 (2d4 + 3) slashing damage. Instead of dealing damage, Doru can grapple the target (escape DC 13).","attack":"Claws|+6|2d4+3"}],"description":"Source: Curse of Strahd p. 47","environment":"underdark, urban"},{"name":"Emil Toranescu","size":"M","type":"humanoid (human, shapechanger)","alignment":"Chaotic Evil","ac":"11 (in humanoid form, 12 (natural armor) in wolf or hybrid form)","hp":"72 (9d8+18)","speed":"walk 30 ft.","str":"15","dex":"13","con":"14","int":"10","wis":"11","cha":"10","save":"","skill":"Perception +4","passive":"14","languages":"Common (can't speak in wolf form)","cr":"3","resist":"","immune":"bludgeoning, piercing, slashing from nonmagical attacks that aren't silvered","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Shapechanger","text":"Emil can use its action to polymorph into a wolf-humanoid hybrid or into a wolf, or back into its true form, which is humanoid. Its statistics, other than its AC, are the same in each form. Any equipment it is wearing or carrying isn't transformed. It reverts to its true form if it dies."},{"name":"Keen Hearing and Smell","text":"Emil has advantage on Wisdom (Perception) checks that rely on hearing or smell."}],"action":[{"name":"Multiattack (Humanoid or Hybrid Form Only)","text":"Emil makes two attacks: two with its spear (humanoid form) or one with its bite and one with its claws (hybrid form)."},{"name":"Bite (Wolf or Hybrid Form Only)","text":"Melee Weapon Attack: +4 to hit, reach 5 ft., one target. 6 (1d8 + 2) piercing damage. If the target is a humanoid, it must succeed on a DC 12 Constitution saving throw or be cursed with werewolf lycanthropy.","attack":"Bite (Wolf or Hybrid Form Only)|+4|1d8+2"},{"name":"Claws (Hybrid Form Only)","text":"Melee Weapon Attack: +4 to hit, reach 5 ft., one creature. 7 (2d4 + 2) slashing damage.","attack":"Claws (Hybrid Form Only)|+4|2d4+2"},{"name":"Spear (Humanoid Form Only)","text":"Melee or Ranged Weapon Attack: +4 to hit, reach 5 ft. or range 20/60 ft., one creature. 5 (1d6 + 2) piercing damage, or 6 (1d8 + 2) piercing damage if used with two hands to make a melee attack.","attack":"Spear (Humanoid Form Only)|+4|1d6+2"},{"name":"Variant: Nonhuman Lycanthropes","text":"The statistics presented in this section assume a base creature of human. However, you can also use the statistics to represent nonhuman lycanthropes, adding verisimilitude by allowing a nonhuman lycanthrope to retain one or more of its humanoid racial traits. For example, an elf werewolf might have the Fey Ancestry trait."}],"description":"Source: Curse of Strahd p. 81","environment":"forest, hill"},{"name":"Escher","size":"M","type":"undead","alignment":"Neutral Evil","ac":"15 (natural armor)","hp":"82 (11d8+33)","speed":"walk 30 ft.","str":"16","dex":"16","con":"16","int":"11","wis":"10","cha":"12","save":"Dex +6, Wis +3","skill":"Perception +3, Stealth +6","passive":"13","languages":"the languages it knew in life","cr":"5","resist":"necrotic; bludgeoning, piercing, slashing from nonmagical attacks","immune":"","vulnerable":"","conditionImmune":"","senses":"darkvision 60 ft.","trait":[{"name":"Regeneration","text":"Escher regains 10 hit points at the start of its turn if it has at least 1 hit point and isn't in sunlight or running water. If Escher takes radiant damage or damage from holy water, this trait doesn't function at the start of Escher's next turn."},{"name":"Spider Climb","text":"Escher can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."},{"name":"Vampire Weaknesses","text":["Escher has the following flaws:","Forbiddance. Escher can't enter a residence without an invitation from one of the occupants.","Harmed by Running Water. Escher takes 20 acid damage when it ends its turn in running water.","Stake to the Heart. Escher is destroyed if a piercing weapon made of wood is driven into its heart while it is incapacitated in its resting place.","Sunlight Hypersensitivity. Escher takes 20 radiant damage when it starts its turn in sunlight. While in sunlight, it has disadvantage on attack rolls and ability checks."]}],"action":[{"name":"Multiattack","text":"Escher makes two attacks, only one of which can be a bite attack."},{"name":"Bite","text":"Melee Weapon Attack: +6 to hit, reach 5 ft., one willing creature, or a creature that is grappled by Escher, incapacitated, or restrained. 6 (1d6 + 3) piercing damage plus 7 (2d6) necrotic damage. The target's hit point maximum is reduced by an amount equal to the necrotic damage taken, and Escher regains hit points equal to that amount. The reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hit point maximum to 0.","attack":"Bite|+6|1d6+3"},{"name":"Claws","text":"Melee Weapon Attack: +6 to hit, reach 5 ft., one creature. 8 (2d4 + 3) slashing damage. Instead of dealing damage, Escher can grapple the target (escape DC 13).","attack":"Claws|+6|2d4+3"}],"description":"Source: Curse of Strahd p. 70","environment":"underdark, urban"},{"name":"Exethanter","size":"M","type":"undead","alignment":"Any Evil Alignment","ac":"17 (natural armor)","hp":"99 (18d8+54)","speed":"walk 30 ft.","str":"11","dex":"16","con":"16","int":"20","wis":"14","cha":"16","save":"Con +10, Int +12, Wis +9","skill":"Arcana +19, History +12, Insight +9, Perception +9","passive":"19","languages":"Common plus up to five other languages","cr":"21","resist":"cold, lightning, necrotic","immune":"poison; bludgeoning, piercing, slashing from nonmagical attacks","vulnerable":"","conditionImmune":"charmed, exhaustion, frightened, paralyzed, poisoned","senses":"truesight 120 ft.","trait":[{"name":"Legendary Resistance (3/Day)","text":"If Exethanter fails a saving throw, it can choose to succeed instead."},{"name":"Rejuvenation","text":"If it has a phylactery, a destroyed lich gains a new body in 1d10 days, regaining all its hit points and becoming active again. The new body appears within 5 feet of the phylactery."},{"name":"Turn Resistance","text":"Exethanter has advantage on saving throws against any effect that turns undead."},{"name":"Spellcasting","text":["Exethanter is an 18th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 20, +12 to hit with spell attacks). Exethanter has the following wizard spells prepared:","Cantrips (at will): mage hand, prestidigitation, ray of frost","• 1st level (4 slots): detect magic, magic missile, shield, thunderwave","• 2nd level (3 slots): detect thoughts, invisibility, Melf's acid arrow, mirror image","• 3rd level (3 slots): animate dead, counterspell, dispel magic, fireball","• 4th level (3 slots): blight, dimension door","• 5th level (3 slots): cloudkill, scrying","• 6th level (1 slots): disintegrate, globe of invulnerability","• 7th level (1 slots): finger of death, plane shift","• 8th level (1 slots): dominate monster, power word stun","• 9th level (1 slots): power word kill"]}],"action":{"name":"Paralyzing Touch","text":"Melee Spell Attack: +12 to hit, reach 5 ft., one creature. 10 (3d6) cold damage. The target must succeed on a DC 18 Constitution saving throw or be paralyzed for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.","attack":"Paralyzing Touch|+12|3d6"},"legendary":[{"text":"The undead can take 4 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The undead regains spent legendary actions at the start of its turn."},{"name":"Cantrip","text":"Exethanter casts a cantrip."},{"name":"Paralyzing Touch (Costs 2 Actions)","text":"Exethanter uses its Paralyzing Touch."},{"name":"Frightening Gaze (Costs 2 Actions)","text":"Exethanter fixes its gaze on one creature it can see within 10 feet of it. The target must succeed on a DC 18 Wisdom saving throw against this magic or become frightened for 1 minute. The frightened target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a target's saving throw is successful or the effect ends for it, the target is immune to Exethanter's gaze for the next 24 hours."},{"name":"Disrupt Life (Costs 3 Actions)","text":"Each non-undead creature within 20 feet of Exethanter must make a DC 18 Constitution saving throw against this magic, taking 21 (6d6) necrotic damage on a failed save, or half as much damage on a successful one."},{"name":"Lair Actions"},{"text":["On initiative count 20 (losing initiative ties), the lich can take a lair action to cause one of the following magical effects; the lich can't use the same effect two rounds in a row:","• The lich rolls a d8 and regains a spell slot of that level or lower. If it has no spent spell slots of that level or lower, nothing happens.","• The lich targets one creature it can see within 30 feet of it. A crackling cord of negative energy tethers the lich to the target. Whenever the lich takes damage, the target must make a DC 18 Constitution saving throw. On a failed save, the lich takes half the damage (rounded down), and the target takes the remaining damage. This tether lasts until initiative count 20 on the next round or until the lich or the target is no longer in the lich's lair.","• The lich calls forth the spirits of creatures that died in its lair. These apparitions materialize and attack one creature that the lich can see within 60 feet of it. The target must succeed on a DC 18 Constitution saving throw, taking 52 (15d6) necrotic damage on a failed save, or half as much damage on a success. The apparitions then disappear."]}],"slots":"4, 3, 3, 3, 3, 1, 1, 1, 1","spells":"mage hand, prestidigitation, ray of frost, detect magic, magic missile, shield, thunderwave, detect thoughts, invisibility, Melf's acid arrow, mirror image, animate dead, counterspell, dispel magic, fireball, blight, dimension door, cloudkill, scrying, disintegrate, globe of invulnerability, finger of death, plane shift, dominate monster, power word stun, power word kill","description":"Source: Curse of Strahd p. 189","environment":""},{"name":"Ezmerelda d'Avenir","size":"M","type":"humanoid (human)","alignment":"Chaotic Good","ac":"17 (+1 studded leather armor)","hp":"82 (11d8+33)","speed":"walk 30 ft.","str":"14","dex":"19","con":"16","int":"16","wis":"11","cha":"17","save":"Wis +3","skill":"Acrobatics +7, Arcana +6, Deception +9, Insight +3, Medicine +3, Perception +6, Performance +6, Sleight of hand +7, Stealth +7, Survival +6","passive":"16","languages":"Common, Elvish","cr":"8","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Special Equipment","text":"In addition to her magic armor and weapons, Ezmerelda has two potion of greater healing, six holy water (flask), and three wooden stakes."},{"name":"Spellcasting","text":["Ezmerelda is a 7th-level spellcaster. Her spellcasting ability is Intelligence (spell save DC 14, +6 to hit with spell attacks). Ezmerelda has the following wizard spells prepared:","Cantrips (at will): fire bolt, light, mage hand, prestidigitation","• 1st level (4 slots): protection from evil and good, magic missile, shield","• 2nd level (3 slots): darkvision, knock, mirror image","• 3rd level (3 slots): clairvoyance, lightning bolt, magic circle","• 4th level (1 slots): greater invisibility"]}],"action":[{"name":"Multiattack","text":"Ezmerelda makes three attacks: two with her +1 rapier and one with her +1 handaxe or her silvered shortsword."},{"name":"Rapier +1","text":"Melee Weapon Attack: +8 to hit, reach 5 ft., one target. 9 (1d8 + 5) piercing damage.","attack":"Rapier +1|+8|1d8+5"},{"name":"Handaxe +1","text":"Melee or Ranged Weapon Attack: +6 to hit, reach 5 ft. or range 20/60 ft., one target. 6 (1d6 + 3) slashing damage.","attack":"Handaxe +1|+6|1d6+3"},{"name":"Silvered Shortsword","text":"Melee Weapon Attack: +7 to hit, reach 5 ft., one target. 7 (1d6 + 4) piercing damage.","attack":"Silvered Shortsword|+7|1d6+4"},{"name":"Curse (Recharges after a Long Rest)","text":"Ezmerelda targets one creature that she can see within 30 feet of her. The target must succeed on a DC 14 Wisdom saving throw or be cursed. While cursed, the target has vulnerability to one type of damage of Ezmerelda's choice. The curse lasts until ended with a greater restoration spell, a remove curse spell, or similar magic. When the curse ends, Ezmerelda takes 3d6 psychic damage."},{"name":"Evil Eye (Recharges after a Short or Long Rest)","text":"Ezmerelda targets one creature that she can see within 10 feet of her and casts one of the following spells on the target (save DC 14), requiring neither somatic nor material components to do so: animal friendship, charm person, or hold person. If the target succeeds on the initial saving throw, Ezmerelda is blinded until the end of her next turn. Once a target succeeds on a saving throw against this effect, it is immune to the Evil Eye power of all Vistani for 24 hours."}],"slots":"4, 3, 3, 1","spells":"fire bolt, light, mage hand, prestidigitation, protection from evil and good, magic missile, shield, darkvision, knock, mirror image, clairvoyance, lightning bolt, magic circle, greater invisibility","description":"Ezmerelda d'Avenir, a Vistana, is the protégé of Rudolph van Richten - despite the fact that her first encounter with the vampire hunter was anything but pleasant.\nWitness to Tragedy. When Ezmerelda was a little girl, her family kidnapped van Richten's teenage son, Erasmus, and delivered him into the clutches of a vampire. Even today, years later, she can still hear Erasmus's pleas for mercy. That event haunted her childhood.\nVan Richten tracked down Ezmerelda's family soon after the kidnapping, but not before the Vistani had sold the boy. Though van Richten could have done them harm, he instead interrogated Ezmerelda's mother and father on the whereabouts of his missing son. Satisfied with their answers, he spared their lives before departing with the information they had given him. Ezmerelda witnessed van Richten's act of mercy and was deeply moved by it.\nVan Richten's Tragic Tale. At the age of fifteen, Ezmerelda, still troubled by what her family had done to van Richten, ran away from home. After many harrowing adventures, she tracked down van Richten two years later. Thinking she was a Vistana assassin, he put a sword to her throat and threatened to spill her blood. Ezmerelda convinced him that she genuinely wanted to help him find his missing son, whereupon van Richten told her the saddest of tales. He had found his son, who had been transformed into a vampire spawn. When Erasmus pleaded to his father for salvation, van Richten granted his request by ending his existence.\nFarewell. Ezmerelda remained by van Richten's side for two years, helping him track down and slay many creatures of the night. But because van Richten could never bring himself to fully trust a Vistana, he kept secrets from her. The two vampire hunters got on each other's nerves, and their arguments became more frequent. At last, Ezmerelda suggested that they part company with some shred of their friendship still intact, and van Richten agreed.\nEzmerelda's Secret. Since bidding farewell to van Richten, Ezmerelda has amassed a sizable personal fortune, some of which she used to buy a wagon to carry her vampire-slaying paraphernalia. On one of her less successful adventures, a werewolf bit off her right leg below the knee, and although she avoided being afflicted with lycanthropy, Ezmerelda was sidelined for months. She commissioned a master artisan to craft a prosthetic lower leg and foot. After several tries, he delivered a prosthesis that restored her mobility. She has since adapted well to the false appendage.\nThe Great Vampire Hunt. While in the company of a Vistani caravan, Ezmerelda heard a rumor that Rudolph van Richten had gone to Barovia to slay the most powerful vampire of them all. She decided that he might need help and traveled for months to reach Strahd's domain. She rode her wagon to Vallaki and learned about an old tower that seemed the sort of place van Richten would use as a base. When she arrived there, she found some of van Richten's belongings, but of the vampire hunter there was no sign. Although she is anxious to learn the whereabouts of her mentor, she is also eager to earn his trust and respect. To that end, she has been poring over van Richten's research and learning about Strahd and Castle Ravenloft, with every intention of dispatching the vampire herself.\nTarokka Deck. Ezmerelda keeps a deck of tarokka cards in her wagon (chapter 11, area V1). Although the cards aren't magical, Ezmerelda can use them to perform a card reading for the characters (see chapter 1), like the one that can be performed by Madam Eva.\nEzmerelda d'Avenir's Traits. Ideal. \"Evil that feeds on the innocent is the worst of all evils and must be destroyed.\"\nBond. \"My mentor and teacher, Dr. Rudolph van Richten, is like a father to me.\"\nFlaw. \"I go where angels fear to tread.\"\nSource: Curse of Strahd p. 231","environment":""},{"name":"Gadof Blinsky","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"10","hp":"4 (1d8)","speed":"walk 30 ft.","str":"10","dex":"10","con":"10","int":"10","wis":"10","cha":"10","save":"","skill":"","passive":"10","languages":"any one language (usually Common)","cr":"0","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","action":{"name":"Club","text":"Melee Weapon Attack: +2 to hit, reach 5 ft., one target. 2 (1d4) bludgeoning damage.","attack":"Club|+2|1d4"},"description":"Source: Curse of Strahd p. 118","environment":"arctic, desert, coastal, grassland, hill, urban, forest"},{"name":"Gertruda","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"10","hp":"4 (1d8)","speed":"walk 30 ft.","str":"10","dex":"10","con":"10","int":"10","wis":"10","cha":"10","save":"","skill":"","passive":"10","languages":"any one language (usually Common)","cr":"0","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","action":{"name":"Club","text":"Melee Weapon Attack: +2 to hit, reach 5 ft., one target. 2 (1d4) bludgeoning damage.","attack":"Club|+2|1d4"},"description":"Source: Curse of Strahd p. 68","environment":"arctic, desert, coastal, grassland, hill, urban, forest"},{"name":"Guardian Portrait","size":"M","type":"construct","alignment":"Unaligned","ac":"5 (natural armor)","hp":"22 (5d8)","speed":"walk 0 ft.","str":"1","dex":"1","con":"10","int":"14","wis":"10","cha":"10","save":"","skill":"","passive":"10","languages":"Common, plus up to two other languages","cr":"1","resist":"","immune":"poison","vulnerable":"","conditionImmune":"charmed, exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained","senses":"darkvision 60 ft.","trait":[{"name":"Constructed Nature","text":["An animated object doesn't require air, food, drink, or sleep.","The magic that animates an object is dispelled when the construct drops to 0 hit points. An animated object reduced to 0 hit points becomes inanimate and is too damaged to be of much use or value to anyone."]},{"name":"Antimagic Susceptibility","text":"The portrait is incapacitated while in the area of an antimagic field. If targeted by dispel magic, the portrait must succeed on a Constitution saving throw against the caster's spell save DC or become unconscious for 1 minute."},{"name":"False Appearance","text":"While the figure in the portrait remains motionless, the portrait is indistinguishable from a normal painting."},{"name":"Innate Spellcasting","text":["The portrait's innate spellcasting ability is Intelligence (spell save DC 12). The portrait can innately cast the following spells, requiring no material components:","3/day each: counterspell, crown of madness, hypnotic pattern, telekinesis"]}],"spells":"counterspell, crown of madness, hypnotic pattern, telekinesis","description":"A guardian portrait looks like a finely rendered and beautifully framed work of art, usually depicting someone important in a realistic manner. The picture and its frame are bound with powerful magic and are inseparable.\nLiving Image. The eyes of the figure depicted in the painting are imbued with darkvision, and they appear to follow creatures that move in front of them.\nInnate Spells. When a guardian portrait attacks, the figure in the painting animates and moves as though alive (albeit in two dimensions). The guardian portrait has no effective melee attacks, but it has a repertoire of innate spells that it can cast. When it casts a spell, the figure painted on the canvas makes all the appropriate somatic gestures and verbal incantations for the spell.\nSource: Curse of Strahd p. 227","environment":""},{"name":"Helga Ruvak","size":"M","type":"undead","alignment":"Neutral Evil","ac":"15 (natural armor)","hp":"82 (11d8+33)","speed":"walk 30 ft.","str":"16","dex":"16","con":"16","int":"11","wis":"10","cha":"12","save":"Dex +6, Wis +3","skill":"Perception +3, Stealth +6","passive":"13","languages":"the languages it knew in life","cr":"5","resist":"necrotic; bludgeoning, piercing, slashing from nonmagical attacks","immune":"","vulnerable":"","conditionImmune":"","senses":"darkvision 60 ft.","trait":[{"name":"Regeneration","text":"Helga regains 10 hit points at the start of its turn if it has at least 1 hit point and isn't in sunlight or running water. If Helga takes radiant damage or damage from holy water, this trait doesn't function at the start of Helga's next turn."},{"name":"Spider Climb","text":"Helga can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."},{"name":"Vampire Weaknesses","text":["Helga has the following flaws:","Forbiddance. Helga can't enter a residence without an invitation from one of the occupants.","Harmed by Running Water. Helga takes 20 acid damage when it ends its turn in running water.","Stake to the Heart. Helga is destroyed if a piercing weapon made of wood is driven into its heart while it is incapacitated in its resting place.","Sunlight Hypersensitivity. Helga takes 20 radiant damage when it starts its turn in sunlight. While in sunlight, it has disadvantage on attack rolls and ability checks."]}],"action":[{"name":"Multiattack","text":"Helga makes two attacks, only one of which can be a bite attack."},{"name":"Bite","text":"Melee Weapon Attack: +6 to hit, reach 5 ft., one willing creature, or a creature that is grappled by Helga, incapacitated, or restrained. 6 (1d6 + 3) piercing damage plus 7 (2d6) necrotic damage. The target's hit point maximum is reduced by an amount equal to the necrotic damage taken, and Helga regains hit points equal to that amount. The reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hit point maximum to 0.","attack":"Bite|+6|1d6+3"},{"name":"Claws","text":"Melee Weapon Attack: +6 to hit, reach 5 ft., one creature. 8 (2d4 + 3) slashing damage. Instead of dealing damage, Helga can grapple the target (escape DC 13).","attack":"Claws|+6|2d4+3"}],"description":"Source: Curse of Strahd p. 64","environment":"underdark, urban"},{"name":"Henrik van der Voort","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"10","hp":"4 (1d8)","speed":"walk 30 ft.","str":"10","dex":"10","con":"10","int":"10","wis":"10","cha":"10","save":"","skill":"","passive":"10","languages":"any one language (usually Common)","cr":"0","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","action":{"name":"Club","text":"Melee Weapon Attack: +2 to hit, reach 5 ft., one target. 2 (1d4) bludgeoning damage.","attack":"Club|+2|1d4"},"description":"Source: Curse of Strahd p. 116","environment":"arctic, desert, coastal, grassland, hill, urban, forest"},{"name":"Ireena Kolyana","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"15 (breastplate)","hp":"14 (2d8)","speed":"walk 30 ft.","str":"11","dex":"12","con":"11","int":"12","wis":"14","cha":"16","save":"","skill":"Deception +5, Insight +4, Persuasion +5","passive":"12","languages":"any two languages","cr":"1/8","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","action":{"name":"Rapier","text":"Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 5 (1d8 + 1) piercing damage.","attack":"Rapier|+3|1d8+1"},"reaction":{"name":"Parry","text":"Ireena adds 2 to its AC against one melee attack that would hit it. To do so, Ireena must see the attacker and be wielding a melee weapon."},"description":"Source: Curse of Strahd p. 44","environment":""},{"name":"Ismark Kolyanovich","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"17 (splint armor)","hp":"58 (9d8+18)","speed":"walk 30 ft.","str":"16","dex":"13","con":"14","int":"10","wis":"11","cha":"10","save":"","skill":"Athletics +5, Perception +2","passive":"12","languages":"any one language (usually Common)","cr":"3","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","action":[{"name":"Multiattack","text":"Ismark makes two longsword attacks. If it has a shortsword drawn, it can also make a shortsword attack."},{"name":"Longsword","text":"Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 7 (1d8 + 3) slashing damage, or 8 (1d10 + 3) slashing damage if used with two hands.","attack":"Longsword|+5|1d8+3"},{"name":"Shortsword","text":"Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 6 (1d6 + 3) piercing damage.","attack":"Shortsword|+5|1d6+3"},{"name":"Heavy Crossbow","text":"Ranged Weapon Attack: +3 to hit, range 100/400 ft., one target. 6 (1d10 + 1) piercing damage.","attack":"Heavy Crossbow|+3|1d10+1"}],"description":"Source: Curse of Strahd p. 43","environment":""},{"name":"Izek Strazni","size":"M","type":"humanoid (human)","alignment":"Neutral Evil","ac":"14 (studded leather armor)","hp":"112 (15d8+45)","speed":"walk 30 ft.","str":"18","dex":"15","con":"16","int":"10","wis":"9","cha":"15","save":"","skill":"Intimidation +8, Perception +2","passive":"12","languages":"Common","cr":"5","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":{"name":"Brute","text":"A melee weapon deals one extra die of its damage when Izek hits with it (included in the attack)."},"action":[{"name":"Multiattack","text":"Izek makes two attacks with his battleaxe."},{"name":"Battleaxe","text":"Melee Weapon Attack: +7 to hit, reach 5 ft., one target. 13 (2d8 + 4) slashing damage, or 15 (2d10 + 4) when used with two hands.","attack":"Battleaxe|+7|2d8+4"},{"name":"Hurl Flame","text":"Ranged Spell Attack: +5 to hit, range 60 ft., one target. 10 (3d6) fire damage. If the target is a flammable object that isn't being worn or carried, it catches fire.","attack":"Hurl Flame|+5|3d6"}],"description":"Izek and his sister were born in Vallaki. One morning, their father and their uncle took them fishing on Lake Zarovich. On the way back to town, a dire wolf attacked Izek and bit off his right arm. His father carried Izek back to town while his uncle distracted the beast. His sister ran and hid in the woods and was never seen again.\nUnlike his sister, Izek was born without a soul. As time wore on, he forgot his lost sister and learned to cope with his disability.\nOrphaned Killer. Izek's parents succumbed to their grief, leaving him an orphan. He became a sociopath. Other children ruthlessly mocked him because of his dead family and his missing arm, but he was a large boy and had no trouble killing them and disposing of their bodies. He was eventually caught in the act and brought to the burgomaster. Instead of punishing the boy for his crimes, Baron Vallakovich pardoned Izek and took him into his home. Izek has been loyal to the burgomaster ever since, enjoying the power of his position and the comforts of his master's mansion. When he isn't enforcing the burgomaster's will, Izek drinks copious amounts of wine.\nFiendish Gift. After years of doing Baron Vallakovich's dirty work, Izek awakened from a drunken stupor one morning to find that he had grown a new arm to replace the one he had lost.\nThe new appendage has barbed spines, elongated fingers, and long nails. He can create fire with the snap of his fiendish fingers and has used the flames to put the fear of the devil in every Vallakian.\nDoll Collector. Perhaps more disturbing than his fiendish arm and his murderous nature is Izek's collection of dolls, which he keeps in his bedroom in the burgomaster's mansion. Izek often has dreams of a beautiful young woman, and for years he has forced a local toymaker named Gadof Blinsky to craft dolls in her likeness. The woman is Ireena Kolyana, although Izek doesn't know her name.\nFamily Is Forever. Izek has dreams of Ireena. If he spots her, he tries to take her by force to the burgomaster's mansion. If he succeeds, he holds her captive in his bedroom (chapter 5, area N3j). Unknown to Izek and Ireena, they are brother and sister. Ireena fled after Izek was attacked by the dire wolf and became lost in the woods. She wandered for days in shock until she was found and adopted by Kolyan Indirovich in the village of Barovia. Izek covets her in an unwholesome way and won't allow anyone or anything to come between them.\nIzek Strazni's Traits. Ideal. \"Fear is a powerful weapon. I use it to get what I want.\"\nBond. \"I am loyal to my master, Baron Vallakovich, for he brought me into his home. I owe him my life, but he isn't family.\"\nFlaw. \"I would do anything, kill anything, to find my sister.\"\nSource: Curse of Strahd p. 232","environment":""},{"name":"Kasimir Velikov","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"12 (15 with mage armor)","hp":"40 (9d8)","speed":"walk 30 ft.","str":"9","dex":"14","con":"11","int":"17","wis":"12","cha":"11","save":"Int +6, Wis +4","skill":"Arcana +6, History +6","passive":"11","languages":"any four languages","cr":"6","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Fey Ancestry","text":"Kasimir has advantage on saving throws against being charmed, and magic can't put the him to sleep."},{"name":"Special Equipment","text":"Kasimir wears a ring of warmth and carries a spellbook containing all the spells he has prepared plus the following spells: arcane lock, comprehend languages, hold person, identify, locate object, nondetection, polymorph, protection from evil and good, ray of frost, and wall of stone."},{"name":"Spellcasting","text":["Kasimir is a 9th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 14, +6 to hit with spell attacks). Kasimir has the following wizard spells prepared:","Cantrips (at will): fire bolt, light, mage hand, prestidigitation","• 1st level (4 slots): detect magic, mage armor, magic missile, shield","• 2nd level (3 slots): misty step, suggestion","• 3rd level (3 slots): counterspell, fireball, fly","• 4th level (3 slots): greater invisibility, ice storm","• 5th level (1 slots): cone of cold"]}],"action":[{"name":"Dagger","text":"Melee or Ranged Weapon Attack: +5 to hit, reach 5 ft. or range 20/60 ft., one target. 4 (1d4 + 2) piercing damage.","attack":"Dagger|+5|1d4+2"},{"name":"Variant: Familiars","text":"Any spellcaster that can cast the find familiar spell (such as an archmage or mage) is likely to have a familiar. The familiar can be one of the creatures described in the spell (see the Player's Handbook) or some other Tiny monster, such as a crawling claw, imp, pseudodragon, or quasit."}],"slots":"4, 3, 3, 3, 1","spells":"fire bolt, light, mage hand, prestidigitation, detect magic, mage armor, magic missile, shield, misty step, suggestion, counterspell, fireball, fly, greater invisibility, ice storm, cone of cold","description":"Source: Curse of Strahd p. 233","environment":""},{"name":"Kiril Stoyanovich","size":"M","type":"humanoid (human, shapechanger)","alignment":"Chaotic Evil","ac":"11 (in humanoid form, 12 (natural armor) in wolf or hybrid form)","hp":"90 (9d8+18)","speed":"walk 30 ft.","str":"15","dex":"13","con":"14","int":"10","wis":"11","cha":"10","save":"","skill":"Perception +4","passive":"14","languages":"Common (can't speak in wolf form)","cr":"3","resist":"","immune":"bludgeoning, piercing, slashing from nonmagical attacks that aren't silvered","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Shapechanger","text":"Kiril can use its action to polymorph into a wolf-humanoid hybrid or into a wolf, or back into its true form, which is humanoid. Its statistics, other than its AC, are the same in each form. Any equipment it is wearing or carrying isn't transformed. It reverts to its true form if it dies."},{"name":"Keen Hearing and Smell","text":"Kiril has advantage on Wisdom (Perception) checks that rely on hearing or smell."}],"action":[{"name":"Multiattack (Humanoid or Hybrid Form Only)","text":"Kiril makes two attacks: two with its spear (humanoid form) or one with its bite and one with its claws (hybrid form)."},{"name":"Bite (Wolf or Hybrid Form Only)","text":"Melee Weapon Attack: +4 to hit, reach 5 ft., one target. 6 (1d8 + 2) piercing damage. If the target is a humanoid, it must succeed on a DC 12 Constitution saving throw or be cursed with werewolf lycanthropy.","attack":"Bite (Wolf or Hybrid Form Only)|+4|1d8+2"},{"name":"Claws (Hybrid Form Only)","text":"Melee Weapon Attack: +4 to hit, reach 5 ft., one creature. 7 (2d4 + 2) slashing damage.","attack":"Claws (Hybrid Form Only)|+4|2d4+2"},{"name":"Spear (Humanoid Form Only)","text":"Melee or Ranged Weapon Attack: +4 to hit, reach 5 ft. or range 20/60 ft., one creature. 5 (1d6 + 2) piercing damage, or 6 (1d8 + 2) piercing damage if used with two hands to make a melee attack.","attack":"Spear (Humanoid Form Only)|+4|1d6+2"},{"name":"Variant: Nonhuman Lycanthropes","text":"The statistics presented in this section assume a base creature of human. However, you can also use the statistics to represent nonhuman lycanthropes, adding verisimilitude by allowing a nonhuman lycanthrope to retain one or more of its humanoid racial traits. For example, an elf werewolf might have the Fey Ancestry trait."}],"description":"Source: Curse of Strahd p. 203","environment":"forest, hill"},{"name":"Knight of the Order","size":"M","type":"undead","alignment":"Neutral","ac":"13 (leather armor)","hp":"136 (16d8+64)","speed":"walk 30 ft.","str":"18","dex":"14","con":"18","int":"13","wis":"16","cha":"18","save":"Str +7, Con +7, Wis +6, Cha +7","skill":"","passive":"13","languages":"the languages it knew in life","cr":"5","resist":"necrotic, psychic","immune":"poison","vulnerable":"","conditionImmune":"charmed, exhaustion, frightened, paralyzed, poisoned, stunned","senses":"darkvision 60 ft.","trait":[{"name":"Regeneration","text":"The knight regains 10 hit points at the start of its turn. If the knight takes fire or radiant damage, this trait doesn't function at the start of the knight's next turn. The knight's body is destroyed only if it starts its turn with 0 hit points and doesn't regenerate."},{"name":"Rejuvenation","text":"When the knight's body is destroyed, its soul lingers. After 24 hours, the soul inhabits and animates another humanoid corpse on the same plane of existence and regains all its hit points. While the soul is bodiless, a wish spell can be used to force the soul to go to the afterlife and not return."},{"name":"Turn Immunity","text":"The knight is immune to effects that turn undead."},{"name":"Vengeful Tracker","text":"The knight knows the distance to and direction of any creature against which it seeks revenge, even if the creature and the knight are on different planes of existence. If the creature being tracked by the knight dies, the knight knows."}],"action":[{"name":"Multiattack","text":"The knight makes two longsword attacks or two fist attacks."},{"name":"Longsword","text":"Melee Weapon Attack: +7 to hit, reach 5 ft., one target. 15 (2d10 + 4) slashing damage. If the target is a creature against which the knight has sworn vengeance, the target takes an extra 14 (4d6) slashing damage.","attack":"Longsword|+7|2d10+4"},{"name":"Fist","text":"Melee Weapon Attack: +7 to hit, reach 5 ft., one target. 11 (2d6 + 4) bludgeoning damage. If the target is a creature against which the knight has sworn vengeance, the target takes an extra 14 (4d6) bludgeoning damage. Instead of dealing damage, the knight can grapple the target (escape DC 14) provided the target is Large or smaller.","attack":"Fist|+7|2d6+4"},{"name":"Vengeful Glare","text":"The knight targets one creature it can see within 30 feet of it and against which it has sworn vengeance. The target must make a DC 15 Wisdom saving throw. On a failure, the target is paralyzed until the knight deals damage to it, or until the end of the knight's next turn. When the paralysis ends, the target is frightened of the knight for 1 minute. The frightened target can repeat the saving throw at the end of each of its turns, with disadvantage if it can see the knight, ending the frightened condition on itself on a success."},{"name":"Variant: Revenants with Spells and Weapons","text":"Revenants that were spellcasters before they died might retain some or all of their spellcasting capabilities. Similarly, knights that wore armor and wielded weapons in life might continue to do so."}],"description":"Source: Curse of Strahd p. 139","environment":"forest, swamp, hill, urban, desert, arctic"},{"name":"Lady Fiona Wachter","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"13 (chain shirt)","hp":"27 (5d8+5)","speed":"walk 30 ft.","str":"10","dex":"10","con":"12","int":"13","wis":"16","cha":"13","save":"","skill":"Medicine +7, Persuasion +3, Religion +5","passive":"13","languages":"any two languages","cr":"2","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Divine Eminence","text":"As a bonus action, Fiona can expend a spell slot to cause its melee weapon attacks to magically deal an extra 10 (3d6) radiant damage to a target on a hit. This benefit lasts until the end of the turn. If Fiona expends a spell slot of 2nd level or higher, the extra damage increases by 1d6 for each level above 1st."},{"name":"Spellcasting","text":["Fiona is a 5th-level spellcaster. Its spellcasting ability is Wisdom (spell save DC 13, +5 to hit with spell attacks). Fiona has the following cleric spells prepared:","Cantrips (at will): light, sacred flame, thaumaturgy","• 1st level (4 slots): cure wounds, guiding bolt, sanctuary","• 2nd level (3 slots): lesser restoration, spiritual weapon","• 3rd level (2 slots): dispel magic, spirit guardians"]}],"action":{"name":"Mace","text":"Melee Weapon Attack: +2 to hit, reach 5 ft., one target. 3 (1d6) bludgeoning damage.","attack":"Mace|+2|1d6"},"slots":"4, 3, 2","spells":"light, sacred flame, thaumaturgy, cure wounds, guiding bolt, sanctuary, lesser restoration, spiritual weapon, dispel magic, spirit guardians","description":"Source: Curse of Strahd p. 110","environment":""},{"name":"Lady Lydia Petrovna","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"10","hp":"4 (1d8)","speed":"walk 30 ft.","str":"10","dex":"10","con":"10","int":"10","wis":"10","cha":"10","save":"","skill":"","passive":"10","languages":"any one language (usually Common)","cr":"0","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","action":{"name":"Club","text":"Melee Weapon Attack: +2 to hit, reach 5 ft., one target. 2 (1d4) bludgeoning damage.","attack":"Club|+2|1d4"},"description":"Source: Curse of Strahd p. 105","environment":"arctic, desert, coastal, grassland, hill, urban, forest"},{"name":"Lief Lipsiege","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"10","hp":"4 (1d8)","speed":"walk 30 ft.","str":"10","dex":"10","con":"10","int":"10","wis":"10","cha":"10","save":"","skill":"","passive":"10","languages":"any one language (usually Common)","cr":"0","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","action":{"name":"Club","text":"Melee Weapon Attack: +2 to hit, reach 5 ft., one target. 2 (1d4) bludgeoning damage.","attack":"Club|+2|1d4"},"description":"Source: Curse of Strahd p. 62","environment":"arctic, desert, coastal, grassland, hill, urban, forest"},{"name":"Ludmilla Vilisevic","size":"M","type":"undead","alignment":"Neutral Evil","ac":"15 (natural armor)","hp":"82 (11d8+33)","speed":"walk 30 ft.","str":"16","dex":"16","con":"16","int":"11","wis":"10","cha":"12","save":"Dex +6, Wis +3","skill":"Perception +3, Stealth +6","passive":"13","languages":"the languages it knew in life","cr":"5","resist":"necrotic; bludgeoning, piercing, slashing from nonmagical attacks","immune":"","vulnerable":"","conditionImmune":"","senses":"darkvision 60 ft.","trait":[{"name":"Regeneration","text":"Ludmilla regains 10 hit points at the start of its turn if it has at least 1 hit point and isn't in sunlight or running water. If Ludmilla takes radiant damage or damage from holy water, this trait doesn't function at the start of Ludmilla's next turn."},{"name":"Spider Climb","text":"Ludmilla can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."},{"name":"Vampire Weaknesses","text":["Ludmilla has the following flaws:","Forbiddance. Ludmilla can't enter a residence without an invitation from one of the occupants.","Harmed by Running Water. Ludmilla takes 20 acid damage when it ends its turn in running water.","Stake to the Heart. Ludmilla is destroyed if a piercing weapon made of wood is driven into its heart while it is incapacitated in its resting place.","Sunlight Hypersensitivity. Ludmilla takes 20 radiant damage when it starts its turn in sunlight. While in sunlight, it has disadvantage on attack rolls and ability checks."]}],"action":[{"name":"Multiattack","text":"Ludmilla makes two attacks, only one of which can be a bite attack."},{"name":"Bite","text":"Melee Weapon Attack: +6 to hit, reach 5 ft., one willing creature, or a creature that is grappled by Ludmilla, incapacitated, or restrained. 6 (1d6 + 3) piercing damage plus 7 (2d6) necrotic damage. The target's hit point maximum is reduced by an amount equal to the necrotic damage taken, and Ludmilla regains hit points equal to that amount. The reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hit point maximum to 0.","attack":"Bite|+6|1d6+3"},{"name":"Claws","text":"Melee Weapon Attack: +6 to hit, reach 5 ft., one creature. 8 (2d4 + 3) slashing damage. Instead of dealing damage, Ludmilla can grapple the target (escape DC 13).","attack":"Claws|+6|2d4+3"}],"description":"Source: Curse of Strahd p. 93","environment":"underdark, urban"},{"name":"Luvash","size":"M","type":"humanoid (any race)","alignment":"Any Non-Lawful Alignment","ac":"15 (studded leather armor)","hp":"65 (10d8+20)","speed":"walk 30 ft.","str":"15","dex":"16","con":"14","int":"14","wis":"11","cha":"14","save":"Str +4, Dex +5, Wis +2","skill":"Athletics +4, Deception +4","passive":"10","languages":"any two languages","cr":"2","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","action":[{"name":"Multiattack","text":"Luvash makes three melee attacks: two with its scimitar and one with its dagger. Or Luvash makes two ranged attacks with its daggers."},{"name":"Scimitar","text":"Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 6 (1d6 + 3) slashing damage.","attack":"Scimitar|+5|1d6+3"},{"name":"Dagger","text":"Melee or Ranged Weapon Attack: +5 to hit, reach 5 ft. or range 20/60 ft., one target. 5 (1d4 + 3) piercing damage.","attack":"Dagger|+5|1d4+3"}],"reaction":{"name":"Parry","text":"Luvash adds 2 to its AC against one melee attack that would hit it. To do so, Luvash must see the attacker and be wielding a melee weapon."},"description":"Source: Curse of Strahd p. 121","environment":""},{"name":"Mad Mary","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"10","hp":"4 (1d8)","speed":"walk 30 ft.","str":"10","dex":"10","con":"10","int":"10","wis":"10","cha":"10","save":"","skill":"","passive":"10","languages":"any one language (usually Common)","cr":"0","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","action":{"name":"Club","text":"Melee Weapon Attack: +2 to hit, reach 5 ft., one target. 2 (1d4) bludgeoning damage.","attack":"Club|+2|1d4"},"description":"Source: Curse of Strahd p. 44","environment":"arctic, desert, coastal, grassland, hill, urban, forest"},{"name":"Madam Eva","size":"M","type":"humanoid (human)","alignment":"Chaotic Neutral","ac":"10","hp":"88 (16d8+16)","speed":"walk 20 ft.","str":"8","dex":"11","con":"12","int":"17","wis":"20","cha":"18","save":"Con +5","skill":"Arcana +7, Deception +8, Insight +13, Intimidation +8, Perception +9, Religion +7","passive":"19","languages":"Abyssal, Common, Elvish, Infernal","cr":"10","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","action":[{"name":"Dagger","text":"Melee Weapon Attack: +4 to hit, reach 5 ft., one target. 2 (1d4) piercing damage.","attack":"Dagger|+4|1d4"},{"name":"Curse (Recharges after a Long Rest)","text":"Madam Eva targets one creature that she can see within 30 feet of her. The target must succeed on a DC 17 Wisdom saving throw or be cursed. While cursed, the target is blinded and deafened. The curse lasts until ended with a greater restoration spell, a remove curse spell, or similar magic. When the curse ends, Madam Eva takes 5d6 psychic damage."},{"name":"Evil Eye (Recharges after a Short or Long Rest)","text":"Madam Eva targets one creature that she can see within 10 feet of her and casts one of the following spells on the target (save DC 17), requiring neither somatic nor material components to do so: animal friendship, charm person, or hold person. If the target succeeds on the initial saving throw, Madam Eva is blinded until the end of her next turn. Once a target succeeds on a saving throw against this effect, it is immune to the Evil Eye power of all Vistani for 24 hours."}],"trait":{"name":"Spellcasting","text":["Madam Eva is a 16th-level spellcaster. Her spellcasting ability is Wisdom (spell save DC 17, +9 to hit with spell attacks). Madam Eva has the following cleric spells prepared:","Cantrips (at will): light, mending, sacred flame, thaumaturgy","• 1st level (4 slots): bane, command, detect evil and good, protection from evil and good","• 2nd level (3 slots): lesser restoration, protection from poison, spiritual weapon","• 3rd level (3 slots): create food and water, speak with dead, spirit guardians","• 4th level (3 slots): divination, freedom of movement, guardian of faith","• 5th level (2 slots): greater restoration, raise dead","• 6th level (1 slots): find the path, harm, true seeing","• 7th level (1 slots): fire storm, regenerate","• 8th level (1 slots): earthquake"]},"slots":"4, 3, 3, 3, 2, 1, 1, 1","spells":"light, mending, sacred flame, thaumaturgy, bane, command, detect evil and good, protection from evil and good, lesser restoration, protection from poison, spiritual weapon, create food and water, speak with dead, spirit guardians, divination, freedom of movement, guardian of faith, greater restoration, raise dead, find the path, harm, true seeing, fire storm, regenerate, earthquake","description":"The fortune-teller Madam Eva lives among the Vistani but isn't truly one of them. She appears to be in her seventies, but she is, in fact, much older.\nRoyal Blood. Madam Eva is Strahd's half-sister, though Strahd is unaware of this fact. Her real name is Katarina, and she is the daughter of a Vistani woman whom King Barov, Strahd's father, took to his bed during one of his many crusades. Madam Eva knows she is Strahd's half-sister but has told no one of the royal blood flowing through her veins.\nMother Night. Over four hundred years ago, Katarina came to Barovia and insinuated herself into Strahd's court, working as a maid in Castle Ravenloft. She came to know the castle like the back of her hand, and she was present for the wedding of Sergei and Tatyana. After Strahd went mad and murdered his brother, she fled the castle and took refuge with the Vistani. Later, she forged a pact with the goddess Mother Night, trading her youth for the power to undo the evil that Strahd had wrought. Mother Night transformed Katarina into an ageless crone gifted with the power of magical foresight. In the guise of Madam Eva, she uses this ability to help Strahd. She can send her Vistani out in their wagons to visit other worlds and bring adventurers to Strahd's domain, in hopes that they will find a way to destroy the vampire or set Strahd free.\nFor the Love of Strahd. The Dark Powers of Ravenloft would consider Madam Eva a worthy choice to replace Strahd as the master of Ravenloft, but she has all the power she desires and doesn't seek to supplant him. She would rather help Strahd find someone else to succeed him, although she has grave doubts about her ability to locate such an individual.\nNone of Madam Eva's Vistani kin know her true identity or purpose. They puzzle over her desire to remain in Barovia.\nMadam Eva's Traits. Ideal. \"I wish Strahd to be free of his curse.\"\nBond. \"The Vistani are my people now.\"\nFlaw. \"The people whose fates I divine aren't important. They are but the means to an end.\"\nSource: Curse of Strahd p. 233","environment":""},{"name":"Majesto","size":"T","type":"fiend (devil)","alignment":"Lawful Evil","ac":"13","hp":"10 (3d4+3)","speed":"walk 20 ft., fly 40 ft.","str":"6","dex":"17","con":"13","int":"11","wis":"12","cha":"14","save":"","skill":"Deception +4, Insight +3, Persuasion +4, Stealth +5","passive":"11","languages":"Infernal, Common","cr":"1","resist":"cold; bludgeoning, piercing, slashing from nonmagical attacks not made with silvered weapons","immune":"fire, poison","vulnerable":"","conditionImmune":"poisoned","senses":"darkvision 120 ft.","trait":[{"name":"Shapechanger","text":"Majesto can use its action to polymorph into a beast form that resembles a rat (speed 20 ft.), a raven (20 ft., fly 60 ft.), or a spider (20 ft., climb 20 ft.), or back into its true form. Its statistics are the same in each form, except for the speed changes noted. Any equipment it is wearing or carrying isn't transformed. It reverts to its true form if it dies."},{"name":"Devil's Sight","text":"Magical darkness doesn't impede Majesto's darkvision."},{"name":"Magic Resistance","text":"Majesto has advantage on saving throws against spells and other magical effects."}],"action":[{"name":"Sting (Bite in Beast Form)","text":"Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 5 (1d4 + 3) piercing damage, and the target must make a DC 11 Constitution saving throw, taking 10 (3d6) poison damage on a failed save, or half as much damage on a successful one.","attack":["Sting (Bite in Beast Form)|+5|1d4+3","Sting (Bite in Beast Form)||3d6"]},{"name":"Invisibility","text":"Majesto magically turns invisible until it attacks, or until its concentration ends (as if concentrating on a spell). Any equipment Majesto wears or carries is invisible with it."},{"name":"Variant: Imp Familiar","text":["Imps can be found in the service to mortal spellcasters, acting as advisors, spies, and familiars. An imp urges its master to acts of evil, knowing the mortal's soul is a prize Majesto might ultimately claim. Imps display an unusual loyalty to their masters, and an imp can be quite dangerous if its master is threatened. Some such imps have the following trait.","Familiar. Majesto can enter into a contract to serve another creature as a familiar, forming a telepathic bond with its willing master. While the two are bonded, the master can sense what Majesto senses as long as they are within 1 mile of each other. While Majesto is within 10 feet of its master, the master shares Majesto's Magic Resistance trait. If its master violates the terms of the contract, Majesto can end its service as a familiar, ending the telepathic bond."]}],"description":"Source: Curse of Strahd p. 115","environment":""},{"name":"Marzena Belview","size":"M","type":"humanoid (mongrelfolk)","alignment":"Any alignment","ac":"11 (natural armor)","hp":"26 (4d8+8)","speed":"walk 20 ft.","str":"12","dex":"9","con":"15","int":"9","wis":"10","cha":"6","save":"","skill":"Deception +2, Perception +2, Stealth +3","passive":"12","languages":"Common","cr":"1/4","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Flight","text":"The mongrelfolk has leathery wings and a flying speed of 40 feet."},{"name":"Mimicry","text":"Marzena can mimic any sounds it has heard, including voices. A creature that hears the sounds can tell they are imitations with a successful DC 12 Wisdom (Insight) check."}],"action":[{"name":"Multiattack","text":"Marzena makes two attacks: one with its bite and one with its claw or dagger."},{"name":"Bite","text":"Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 3 (1d4 + 1) piercing damage.","attack":"Bite|+3|1d4+1"},{"name":"Claw","text":"Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 3 (1d4 + 1) slashing damage.","attack":"Claw|+3|1d4+1"},{"name":"Dagger","text":"Melee or Ranged Weapon Attack: +3 to hit, reach 5 ft. or range 20/60 ft., one target. 3 (1d4 + 1) piercing damage.","attack":"Dagger|+3|1d4+1"}],"description":"Source: Curse of Strahd p. 150","environment":""},{"name":"Milivoj","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"10","hp":"4 (1d8)","speed":"walk 30 ft.","str":"10","dex":"10","con":"10","int":"10","wis":"10","cha":"10","save":"","skill":"","passive":"10","languages":"any one language (usually Common)","cr":"0","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","action":{"name":"Club","text":"Melee Weapon Attack: +2 to hit, reach 5 ft., one target. 2 (1d4) bludgeoning damage.","attack":"Club|+2|1d4"},"description":"Source: Curse of Strahd p. 97","environment":"arctic, desert, coastal, grassland, hill, urban, forest"},{"name":"Mishka Belview","size":"M","type":"humanoid (mongrelfolk)","alignment":"Any alignment","ac":"11 (natural armor)","hp":"26 (4d8+8)","speed":"walk 20 ft.","str":"12","dex":"9","con":"15","int":"9","wis":"10","cha":"6","save":"","skill":"Deception +2, Perception +2, Stealth +3","passive":"12","languages":"Common","cr":"1/4","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Spider Climb","text":"The mongrelfolk can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."},{"name":"Mimicry","text":"Mishka can mimic any sounds it has heard, including voices. A creature that hears the sounds can tell they are imitations with a successful DC 12 Wisdom (Insight) check."}],"action":[{"name":"Multiattack","text":"Mishka makes two attacks: one with its bite and one with its claw or dagger."},{"name":"Bite","text":"Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 3 (1d4 + 1) piercing damage.","attack":"Bite|+3|1d4+1"},{"name":"Claw","text":"Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 3 (1d4 + 1) slashing damage.","attack":"Claw|+3|1d4+1"},{"name":"Dagger","text":"Melee or Ranged Weapon Attack: +3 to hit, reach 5 ft. or range 20/60 ft., one target. 3 (1d4 + 1) piercing damage.","attack":"Dagger|+3|1d4+1"}],"description":"Source: Curse of Strahd p. 150","environment":""},{"name":"Mongrelfolk","size":"M","type":"humanoid (mongrelfolk)","alignment":"Any alignment","ac":"11 (natural armor)","hp":"26 (4d8+8)","speed":"walk 20 ft.","str":"12","dex":"9","con":"15","int":"9","wis":"10","cha":"6","save":"","skill":"Deception +2, Perception +2, Stealth +3","passive":"12","languages":"Common","cr":"1/4","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Extraordinary Feature","text":["The mongrelfolk has one of the following extraordinary features, determined randomly by rolling a d20 or chosen by the DM:","1–3: Amphibious. The mongrelfolk can breathe air and water.","4–9: Darkvision. The mongrelfolk has darkvision out to a range of 60 feet.","10: Flight. The mongrelfolk has leathery wings and a flying speed of 40 feet.","11–15: Keen Hearing and Smell. The mongrelfolk has advantage on Wisdom (Perception) checks that rely on hearing or smell.","16–17: Spider Climb. The mongrelfolk can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check.","18–19: Standing Leap. The mongrelfolk's long jump is up to 20 feet and its high jump up to 10 feet, with or without a running start.","20: Two-Headed. The mongrelfolk has advantage on Wisdom (Perception) checks and on saving throws against being blinded, charmed, deafened, frightened, stunned, or knocked unconscious."]},{"name":"Mimicry","text":"The mongrelfolk can mimic any sounds it has heard, including voices. A creature that hears the sounds can tell they are imitations with a successful DC 12 Wisdom (Insight) check."}],"action":[{"name":"Multiattack","text":"The mongrelfolk makes two attacks: one with its bite and one with its claw or dagger."},{"name":"Bite","text":"Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 3 (1d4 + 1) piercing damage.","attack":"Bite|+3|1d4+1"},{"name":"Claw","text":"Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 3 (1d4 + 1) slashing damage.","attack":"Claw|+3|1d4+1"},{"name":"Dagger","text":"Melee or Ranged Weapon Attack: +3 to hit, reach 5 ft. or range 20/60 ft., one target. 3 (1d4 + 1) piercing damage.","attack":"Dagger|+3|1d4+1"}],"description":"Mongrelfolk are humanoids that have undergone, or whose ancestors underwent, horrific magical transformations, to the extent that they retain only a fraction of their original being. Their humanoid bodies incorporate the features of various beasts. For example, one mongrelfolk might have the basic body shape of a dwarf with a head that combines the features of a cat and a lizard, one arm that ends in a crab's pincer, and one leg that ends in a cloven hoof. Another might have the skin and horns of a cow, the eyes of a spider, frog's legs, and a scaly lizard's tail. Each mongrelfolk's mad combination of humanoid and animal forms results in its having a slow, awkward gait.\nSound Mimicry. Mongrelfolk have misshapen mouths and vocal cords. They speak fragmented Common mixed with various animal cries and nonsense. They can effectively imitate sounds made by beasts and humanoids that they've heard. Mongrelfolk aren't sophisticated enough to use these sounds as a covert form of communication, but they can use the sounds to lure enemies into a trap or otherwise distract them.\nOutcasts. Mongrelfolk are seldom welcome in other humanoid societies, where they are abused, enslaved, or shunned. They typically live on the fringes of civilization in ruins, deserted buildings, or other places that other humanoid races once lived in or built. They tend to be timid and skittish outside their homes and fiercely territorial within their lairs.\nCamouflage Experts. Mongrelfolk often hide their deformities under cloaks and cowls. In this way, they can sometimes pass as stout humans or thin dwarves. They are fond of camouflage, attaching leaves and twigs to their cloaks, making brown paint to cover their skin, and weaving grass nets under which they can hide. They use such camouflage while hunting in the wild or while standing guard outside their lairs. Until it is seen, a camouflaged mongrelfolk has advantage on Stealth checks made to hide.\nHorrific Offspring. It's possible to restore a mongrel-folk to its original form using a greater restoration spell, but the same can't be said for a mongrelfolk's offspring. Only mongrelfolk that are made by magic can be restored to their original forms. Mongrelfolk that are born are true mongrelfolk and not the subjects of a spell or an effect that can be undone.\nMongrelfolk can breed with other humanoids, but nearly all children born to such parents are mongrelfolk. (About one child in every hundred is born looking like its non-mongrelfolk parent.)\nSource: Curse of Strahd p. 234","environment":""},{"name":"Morgantha","size":"M","type":"fiend","alignment":"Neutral Evil","ac":"17 (natural armor)","hp":"112 (15d8+45)","speed":"walk 30 ft.","str":"18","dex":"15","con":"16","int":"16","wis":"14","cha":"16","save":"","skill":"Deception +6, Insight +5, Perception +5, Stealth +5","passive":"16","languages":"Abyssal, Common, Infernal, Primordial","cr":"5","resist":"cold, fire; bludgeoning, piercing, slashing from nonmagical attacks that aren't silvered","immune":"","vulnerable":"","conditionImmune":"charmed","senses":"darkvision 120 ft.","trait":[{"name":"Magic Resistance","text":"Morgantha has advantage on saving throws against spells and other magical effects."},{"name":"Night Hag Items","text":["A night hag carries two very rare magic items that she must craft for herself. If either object is lost, the night hag will go to great lengths to retrieve it, as creating a new tool takes time and effort.","Heartstone: This lustrous black gem allows a night hag to become ethereal while it is in her possession. The touch of a heartstone also cures any disease. Crafting a heartstone takes 30 days.","Soul Bag: When an evil humanoid dies as a result of a night hag's Nightmare Haunting, Morgantha catches the soul in this black sack made of stitched flesh. A soul bag can hold only one evil soul at a time, and only the night hag who crafted the bag can catch a soul with it. Crafting a soul bag takes 7 days and a humanoid sacrifice (whose flesh is used to make the bag)."]},{"name":"Hag Coven","text":["When hags must work together, they form covens, in spite of their selfish natures. A coven is made up of hags of any type, all of whom are equals within the group. However, each of Morganthas continues to desire more personal power.","A coven consists of three hags so that any arguments between two hags can be settled by the third. If more than three hags ever come together, as might happen if two covens come into conflict, the result is usually chaos."]},{"name":"Hag Eye (Coven Only)","text":["A hag coven can craft a magic item called a hag eye, which is made from a real eye coated in varnish and often fitted to a pendant or other wearable item. Morgantha eye is usually entrusted to a minion for safekeeping and transport. A hag in the coven can take an action to see what Morgantha eye sees if Morgantha eye is on the same plane of existence. A hag eye has AC 10, 1 hit point, and darkvision with a radius of 60 feet. If it is destroyed, each coven member takes 3d10 psychic damage and is blinded for 24 hours.","A hag coven can have only one hag eye at a time, and creating a new one requires all three members of the coven to perform a ritual. The ritual takes 1 hour, and Morganthas can't perform it while blinded. During the ritual, if Morganthas take any action other than performing the ritual, they must start over."]},{"name":"Innate Spellcasting","text":["Morgantha's innate spellcasting ability is Charisma (spell save DC 14, +6 to hit with spell attacks). She can innately cast the following spells, requiring no material components:","At will: detect magic, magic missile","2/day each: plane shift (self only), ray of enfeeblement, sleep"]},{"name":"Shared Spellcasting (Coven Only)","text":["While all three members of a hag coven are within 30 feet of one another, they can each cast the following spells from the wizard's spell list but must share the spell slots among themselves:","• 1st level (4 slots): identify, ray of sickness","• 2nd level (3 slots): hold person, locate object","• 3rd level (3 slots): bestow curse, counterspell, lightning bolt","• 4th level (3 slots): phantasmal killer, polymorph","• 5th level (2 slots): contact other plane, scrying","• 6th level (1 slots): eyebite","For casting these spells, each hag is a 12th-level spellcaster that uses Intelligence as her spellcasting ability. The spell save DC is 12 + Morgantha's Intelligence modifier, and the spell attack bonus is 4 + Morgantha's Intelligence modifier."]}],"action":[{"name":"Claws (Hag Form Only)","text":"Melee Weapon Attack: +7 to hit, reach 5 ft., one target. 13 (2d8 + 4) slashing damage.","attack":"Claws (Hag Form Only)|+7|2d8+4"},{"name":"Change Shape","text":"Morgantha magically polymorphs into a Small or Medium female humanoid, or back into her true form. Her statistics are the same in each form. Any equipment she is wearing or carrying isn't transformed. She reverts to her true form if she dies."},{"name":"Etherealness","text":"Morgantha magically enters the Ethereal Plane from the Material Plane, or vice versa. To do so, Morgantha must have a heartstone in her possession."},{"name":"Nightmare Haunting (1/Day)","text":"While on the Ethereal Plane, Morgantha magically touches a sleeping humanoid on the Material Plane. A protection from evil and good spell cast on the target prevents this contact, as does a magic circle. As long as the contact persists, the target has dreadful visions. If these visions last for at least 1 hour, the target gains no benefit from its rest, and its hit point maximum is reduced by 5 (1d10). If this effect reduces the target's hit point maximum to 0, the target dies, and if the target was evil, its soul is trapped in Morgantha's soul bag. The reduction to the target's hit point maximum lasts until removed by the  greater restoration spell or similar magic."}],"slots":"4, 3, 3, 3, 2, 1","spells":"detect magic, magic missile, plane shift, ray of enfeeblement, sleep, identify, ray of sickness, hold person, locate object, bestow curse, counterspell, lightning bolt, phantasmal killer, polymorph, contact other plane, scrying, eyebite","description":"Source: Curse of Strahd p. 48","environment":""},{"name":"Nikolai Wachter","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"15 (breastplate)","hp":"9 (2d8)","speed":"walk 30 ft.","str":"11","dex":"12","con":"11","int":"12","wis":"14","cha":"16","save":"","skill":"Deception +5, Insight +4, Persuasion +5","passive":"12","languages":"any two languages","cr":"1/8","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","action":{"name":"Rapier","text":"Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 5 (1d8 + 1) piercing damage.","attack":"Rapier|+3|1d8+1"},"reaction":{"name":"Parry","text":"Nikolai adds 2 to its AC against one melee attack that would hit it. To do so, Nikolai must see the attacker and be wielding a melee weapon."},"description":"Source: Curse of Strahd p. 110","environment":""},{"name":"Otto Belview","size":"M","type":"humanoid (mongrelfolk)","alignment":"Any alignment","ac":"11 (natural armor)","hp":"26 (4d8+8)","speed":"walk 20 ft.","str":"12","dex":"9","con":"15","int":"9","wis":"10","cha":"6","save":"","skill":"Deception +2, Perception +2, Stealth +3","passive":"12","languages":"Common","cr":"1/4","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Standing Leap","text":"The mongrelfolk's long jump is up to 20 feet and its high jump up to 10 feet, with or without a running start."},{"name":"Mimicry","text":"Otto can mimic any sounds it has heard, including voices. A creature that hears the sounds can tell they are imitations with a successful DC 12 Wisdom (Insight) check."}],"action":[{"name":"Multiattack","text":"Otto makes two attacks: one with its bite and one with its claw or dagger."},{"name":"Bite","text":"Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 3 (1d4 + 1) piercing damage.","attack":"Bite|+3|1d4+1"},{"name":"Claw","text":"Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 3 (1d4 + 1) slashing damage.","attack":"Claw|+3|1d4+1"},{"name":"Dagger","text":"Melee or Ranged Weapon Attack: +3 to hit, reach 5 ft. or range 20/60 ft., one target. 3 (1d4 + 1) piercing damage.","attack":"Dagger|+3|1d4+1"}],"description":"Source: Curse of Strahd p. 147","environment":""},{"name":"Parriwimple","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"16 (studded leather armor, shield)","hp":"112 (15d8+45)","speed":"walk 30 ft.","str":"18","dex":"15","con":"16","int":"10","wis":"12","cha":"15","save":"Str +7, Dex +5, Con +6","skill":"Athletics +10, Intimidation +5","passive":"11","languages":"any one language (usually Common)","cr":"5","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Brave","text":"Parriwimple has advantage on saving throws against being frightened."},{"name":"Brute","text":"A melee weapon deals one extra die of its damage when Parriwimple hits with it (included in the attack)."}],"action":[{"name":"Multiattack","text":"Parriwimple makes three melee attacks or two ranged attacks."},{"name":"Spear","text":"Melee or Ranged Weapon Attack: +7 to hit, reach 5 ft. and range 20/60 ft., one target. 11 (2d6 + 4) piercing damage, or 13 (2d8 + 4) piercing damage if used with two hands to make a melee attack.","attack":"Spear|+7|2d6+4"},{"name":"Shield Bash","text":"Melee Weapon Attack: +7 to hit, reach 5 ft., one creature. 9 (2d4 + 4) bludgeoning damage. If the target is a Medium or smaller creature, it must succeed on a DC 15 Strength saving throw or be knocked prone.","attack":"Shield Bash|+7|2d4+4"}],"reaction":{"name":"Parry","text":"Parriwimple adds 3 to its AC against one melee attack that would hit it. To do so, Parriwimple must see the attacker and be wielding a melee weapon."},"description":"Source: Curse of Strahd p. 43","environment":""},{"name":"Patrina Velikovna","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"12 (15 with mage armor)","hp":"99 (18d8+18)","speed":"walk 30 ft.","str":"10","dex":"14","con":"12","int":"20","wis":"15","cha":"16","save":"Int +9, Wis +6","skill":"Arcana +13, History +13","passive":"12","languages":"any six languages","cr":"12","resist":"damage from spells; nonmagical bludgeoning, piercing, slashing (from stoneskin)","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Magic Resistance","text":"Patrina has advantage on saving throws against spells and other magical effects."},{"name":"Spellcasting","text":["Patrina is an 18th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 17, +9 to hit with spell attacks). Patrina can cast disguise self and invisibility at will and has the following wizard spells prepared:","At will: disguise self, invisibility","Cantrips (at will): fire bolt, light, mage hand, prestidigitation, shocking grasp","• 1st level (4 slots): detect magic, identify, mage armor*, magic missile","• 2nd level (3 slots): detect thoughts, mirror image, misty step","• 3rd level (3 slots): counterspell, fly, lightning bolt","• 4th level (3 slots): banishment, fire shield, stoneskin*","• 5th level (3 slots): cone of cold, scrying, wall of force","• 6th level (1 slots): globe of invulnerability","• 7th level (1 slots): teleport","• 8th level (1 slots): mind blank*","• 9th level (1 slots): time stop","*Patrina casts these spells on itself before combat."]}],"action":[{"name":"Dagger","text":"Melee or Ranged Weapon Attack: +6 to hit, reach 5 ft. or range 20/60 ft., one target. 4 (1d4 + 2) piercing damage.","attack":"Dagger|+6|1d4+2"},{"name":"Variant: Familiars","text":"Any spellcaster that can cast the find familiar spell (such as an archmage or mage) is likely to have a familiar. The familiar can be one of the creatures described in the spell (see the Player's Handbook) or some other Tiny monster, such as a crawling claw, imp, pseudodragon, or quasit."}],"slots":"4, 3, 3, 3, 3, 1, 1, 1, 1","spells":"disguise self, invisibility, fire bolt, light, mage hand, prestidigitation, shocking grasp, detect magic, identify, mage armor, magic missile, detect thoughts, mirror image, misty step, counterspell, fly, lightning bolt, banishment, fire shield, stoneskin, cone of cold, scrying, wall of force, globe of invulnerability, teleport, mind blank, time stop","description":"Source: Curse of Strahd p. 89","environment":""},{"name":"Phantom Warrior","size":"M","type":"undead","alignment":"Any alignment","ac":"16","hp":"45 (6d8+18)","speed":"walk 30 ft.","str":"16","dex":"11","con":"16","int":"8","wis":"10","cha":"15","save":"","skill":"Perception +2, Stealth +4","passive":"12","languages":"any languages it knew in life","cr":"3","resist":"bludgeoning, piercing, slashing from nonmagical attacks","immune":"cold, necrotic, poison","vulnerable":"","conditionImmune":"charmed, exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained","senses":"darkvision 60 ft.","trait":[{"name":"Ethereal Sight","text":"The phantom warrior can see 60 feet into the Ethereal Plane when it is on the Material Plane, and vice versa."},{"name":"Incorporeal Movement","text":"The phantom warrior can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object."},{"name":"Spectral Armor and Shield","text":"The phantom warrior's AC accounts for its spectral armor and shield."}],"action":[{"name":"Multiattack","text":"The phantom warrior makes two attacks with its spectral longsword."},{"name":"Spectral Longsword","text":"Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 7 (1d8 + 3) force damage.","attack":"Spectral Longsword|+5|1d8+3"},{"name":"Etherealness","text":"The phantom warrior enters the Ethereal Plane from the Material Plane, or vice versa. It is visible on the Material Plane while it is in the Border Ethereal, and vice versa, yet it can't affect or be affected by anything on the other plane."}],"description":"A phantom warrior is the spectral remnant of a willful soldier or knight who perished on the battlefield or died performing its sworn duty. It appears like a translucent version of its living self.\nTask Driven. Although one is often mistaken for a ghost, a phantom warrior isn't bound by a yearning to complete some unresolved goal. It can choose to end its undead existence at any time. Its spirit lingers willingly, either out of loyalty to its former master or because it believes it must perform a task to satisfy its honor or sense of duty. For example, a guard who dies defending a wall might return as a phantom warrior and continue guarding the wall, then disappear forever once a new guard assumes its post or the wall is destroyed. The period between the time it died and the time it rises as a phantom warrior is usually 24 hours.\nFaded Memories. A phantom warrior retains the alignment and personality it had before it died, and it remembers how it died. Memories of its life from shortly before it died are hazy, and older memories are forgotten. A phantom warrior can usually remember the last 1d10 + 10 days of its life; everything that happened before that is an impenetrable fog.\nForceful Presence. Although they are incorporeal, phantom warriors can harness the energy around them to deflect incoming attacks and strike with great force. An invisible sheath of energy surrounds a phantom warrior's ghostly armor, shields, and weapons, which become as hard as steel yet don't impede the warrior's ability to move through walls and other solid objects.\nUndead Nature. A phantom warrior doesn't require air, food, drink, or sleep.\nSource: Curse of Strahd p. 235","environment":""},{"name":"Piccolo","size":"S","type":"beast","alignment":"Unaligned","ac":"12","hp":"3 (1d6)","speed":"walk 30 ft., climb 30 ft.","str":"8","dex":"14","con":"11","int":"4","wis":"12","cha":"6","save":"","skill":"","passive":"11","languages":"","cr":"0","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":{"name":"Pack Tactics","text":"Piccolo has advantage on an attack roll against a creature if at least one of Piccolo's allies is within 5 feet of the creature and the ally isn't incapacitated."},"action":{"name":"Bite","text":"Melee Weapon Attack: +1 to hit, reach 5 ft., one target. 1 (1d4 - 1) piercing damage.","attack":"Bite|+1|1d4-1"},"description":"Source: Curse of Strahd p. 118","environment":"forest, hill"},{"name":"Pidlwick II","size":"S","type":"construct","alignment":"Neutral Evil","ac":"14 (natural armor)","hp":"10 (3d6)","speed":"walk 30 ft.","str":"10","dex":"14","con":"11","int":"8","wis":"13","cha":"10","save":"","skill":"Performance +2","passive":"11","languages":"understands Common but doesn't speak and can't read or write","cr":"1/4","resist":"","immune":"poison","vulnerable":"","conditionImmune":"paralyzed, petrified, poisoned","senses":"","trait":{"name":"Ambusher","text":"During the first round of combat, Pidlwick II has advantage on attack rolls against any creature that hasn't had a turn yet."},"action":[{"name":"Club","text":"Melee Weapon Attack: +2 to hit, reach 5 ft., one target. 2 (1d4) bludgeoning damage.","attack":"Club|+2|1d4"},{"name":"Dart","text":"Ranged Weapon Attack: +4 to hit, range 20/60 ft., one target. 4 (1d4 + 2) piercing damage.","attack":"Dart|+4|1d4+2"}],"description":"After her husband died in battle, Duchess Dorfniya Dilisnya set her sights on becoming Count Strahd von Zarovich's bride, but she failed to win his love. Her visits to the castle were nonetheless frequent, and she never traveled without her fool, the delightful Pidlwick. The little man was like a ray of sunshine in Castle Ravenloft, and though he failed to amuse Strahd, he delighted Tatyana and Sergei with his jokes and gambols. As a result, Strahd didn't object whenever Pidlwick and the duchess came to visit.\nEager to please and desiring to return the courtesy, the duchess commissioned the legendary toymaker Fritz von Weerg to build a clockwork effigy of Pidlwick as a gift for Strahd's family. Although the duchess's heart was in the right place, the effigy didn't have Pidlwick's abilities, and it failed to entertain anyone. Even though Pidlwick himself had spent months training it, the effigy couldn't speak, and its movements were more awkward than amusing.\nA harsh winter trapped the duchess, her fool, and her fool's effigy in Castle Ravenloft for several months. The duchess subsequently succumbed to illness, after which Tatyana asked Pidlwick to remain at Castle Ravenloft.\nOne Pidlwick Too Many. Von Weerg was no ordinary toymaker, and he put a little of himself into all his creations, which is to say his works had a touch of their creator's madness. Pidlwick II knew that it had no purpose as long as Pidlwick remained in Castle Ravenloft, so it pushed Pidlwick down a long flight of stairs, killing him. Everyone else thought it was an accident. In the days that followed, Pidlwick II tried its best to fill its namesake's shoes, but the effigy's mere presence was upsetting to Tatyana, and it was never called on to perform. Eventually, it was shut away like a discarded toy.\nEvil Toy. Pidlwick II was kept in a small closet adjacent to one of the guest bedrooms. On rare occasions when someone stayed there, Pidlwick would sneak out of the closet in the middle of the night, smother the guest with a pillow, and then retreat back to the closet. The castle staff never considered that the effigy might be responsible, instead assuming that the guests had died in their sleep.\nBut Strahd was not fooled. He came to realize fairly quickly that the clockwork effigy had begun to display a murderous nature. Rather than have Pidlwick II destroyed, Strahd kept the fool around to dispose of irksome guests from time to time.\nAfter the deaths of Sergei and Tatyana, the castle became virtually abandoned, and there were no more guests for Pidlwick II to \"entertain.\" The clockwork effigy emerged from its closet and found new places to hide. It fears Strahd and eagerly follows anyone who gives it the attention it craves.\nPidlwick II is basically an oversized toy - a 4-foot-tall mechanism stuffed with gears, springs, and other components expertly fitted together to impart a semblance of life to it. Its skin is made of stitched leather pulled taut over an articulated wooden frame. Pidlwick II has rubbed soot around its eyes and mouth, giving it the triangular eyes and jagged grin of a jack-o'-lantern.\nPidlwick II's Traits. Ideal. \"I wish I could make people happy.\"\nBond. \"I would like to find someone - anyone - who isn't afraid of me and who enjoys my company.\"\nFlaw. \"When I'm upset, I do bad things.\"\nSource: Curse of Strahd p. 236","environment":""},{"name":"Rahadin","size":"M","type":"humanoid (elf)","alignment":"Lawful Evil","ac":"18 (studded leather armor)","hp":"135 (18d8+54)","speed":"walk 35 ft.","str":"14","dex":"22","con":"17","int":"15","wis":"16","cha":"18","save":"Con +7, Wis +7","skill":"Deception +8, Insight +7, Intimidation +12, Perception +11, Stealth +14","passive":"21","languages":"Common, Elvish","cr":"10","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"darkvision 60 ft.","trait":[{"name":"Deathly Choir","text":"Any creature within 10 feet of Rahadin that isn't protected by a mind blank spell hears in its mind the screams of the thousands of people Rahadin has killed. As a bonus action, Rahadin can force all creatures that can hear the screams to make a DC 16 Wisdom saving throw. Each creature takes 16 (3d10) psychic damage on a failed save, or half as much damage on a successful one."},{"name":"Fey Ancestry","text":"Rahadin has advantage on saving throws against being charmed, and magic can't put him to sleep."},{"name":"Mask of the Wild","text":"Rahadin can attempt to hide even when he is only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena."},{"name":"Innate Spellcasting","text":["Rahadin's innate spellcasting ability is Intelligence. He can innately cast the following spells, requiring no components:","1/day: magic weapon, nondetection","3/day: misty step, phantom steed"]}],"action":[{"name":"Multiattack","text":"Rahadin attacks three times with his scimitar, or twice with his poisoned darts."},{"name":"Scimitar","text":"Melee Weapon Attack: +10 to hit, reach 5 ft., one target. 9 (1d6 + 6) slashing damage.","attack":"Scimitar|+10|1d6+6"},{"name":"Poisoned Dart","text":"Ranged Weapon Attack: +10 to hit, range 20/60 ft., one target. 8 (1d4 + 6) piercing damage plus 5 (2d4) poison damage.","attack":"Poisoned Dart|+10|1d4+6"}],"spells":"magic weapon, nondetection, misty step, phantom steed","description":"Rahadin, the dusk elf chamberlain of Castle Ravenloft, has served Strahd's family faithfully for nearly five hundred years. He is Strahd's eternal servant, a longtime comrade-in-arms, and a ruthless warrior who has killed thousands in his lifetime.\nExile. Rahadin was exiled for refusing to bow down to a dusk elf prince whom he considered weak and corrupt. When the dusk elves later declined to pay fealty to King Barov, Rahadin helped Barov conquer them. The elf kingdom's royal line was obliterated, the dusk elves hunted like rabbits. The few that survived were either subjugated or forced to live among the Vistani. So pleased was Barov with Rahadin that the king made the dusk elf an honorary member of his family.\nChamberlain. After Barov died, Rahadin continued to fight as one of Strahd's generals. When the wars ended and Strahd turned his attention to building Castle Ravenloft, Rahadin saw to it that wizards and artisans were brought to Barovia. Years later, Strahd appointed Rahadin his castle chamberlain. Rahadin was pleased to do whatever Strahd asked of him, and he instilled terror in the castle staff by routinely flogging those who didn't perform their duties to his exacting standards.\nWhen a dusk elf named Patrina Velikovna came knocking on Strahd's door, Rahadin could see that she intrigued Strahd, but Rahadin was suspicious of her motives. Patrina tried to seduce Strahd with the prospect of immortality - something Strahd desired above all. She told him of a vault of forbidden lore called the Amber Temple, where the secret of gaining immortality was hidden. While Strahd was off exploring the temple, Rahadin handled all of his master's affairs and began searching for a woman who could tear Strahd away from Patrina Velikovna. In this task, he failed. His goal was fulfilled, however, when Sergei, Strahd's brother, found Tatyana.\nTatyana was Strahd's type - a woman of exquisite beauty and gentle manner. When Strahd returned to Ravenloft, the young woman instantly caught his eye, and Rahadin had the pleasure of informing Patrina that her presence at the castle was no longer desired.\nRahadin's loyalty didn't waver after Tatyana died and Strahd became a vampire. Rahadin continued to do his master's bidding. Eager to put Tatyana out of his mind, Strahd lured more women to the castle, taking several of them as brides before draining their lives and turning them into vampire spawn. Rahadin would see to it that these women were lavished with jewels and fine clothes, and made comfortable during their stay in Ravenloft.\nExecutioner. Patrina Velikovna and her people were living among the Vistani when they heard of Tatyana's death and Strahd's curse. The ageless Patrina returned to Ravenloft in the hope of winning Strahd's love. This time, it was clear that Patrina craved Strahd's power and that Strahd would never love her. Rahadin assumed that Patrina would suffer the same fate as those women who had come before her. He was proven wrong when Patrina's own people stoned her to death to keep Strahd from claiming her as his wife.\nStrahd was upset that the dusk elves had taken Patrina from him. After securing her body and entombing it in the catacombs of Ravenloft, Strahd sent Rahadin to punish the dusk elves. Rahadin slew the female elves so that the males couldn't breed. He also sliced off the ears of Patrina's brother, Kasimir, who had orchestrated the stoning.\nScreams of the Dead. So dreadful a creature is Rahadin that anyone who stands within 10 feet of him can hear the howling screams of the countless men and women he has killed in his lifetime. Rahadin can't hear them, nor would he be haunted by them if he could. The only thing he cares about is Strahd von Zarovich, for whom he would gladly give his life.\nRahadin's Traits. Ideal. \"Loyalty is everything.\"\nBond. \"I am a son of King Barov von Zarovich, and I will serve his son - my brother and lord - forever.\"\nFlaw. \"I have slain thousands of men. I will slaughter thousands more to preserve the von Zarovich legacy.\"\nSource: Curse of Strahd p. 237","environment":""},{"name":"Rictavio","size":"M","type":"humanoid (human)","alignment":"Lawful Good","ac":"12 (leather armor)","hp":"77 (14d8+14)","speed":"walk 30 ft.","str":"9","dex":"12","con":"13","int":"16","wis":"18","cha":"16","save":"Con +4, Wis +7","skill":"Arcana +9, Insight +7, Medicine +7, Perception +7, Religion +6, Sleight of hand +4","passive":"17","languages":"Abyssal, Common, Elvish, Infernal","cr":"5","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Special Equipment","text":"In addition to his sword cane, Rictavio wears a hat of disguise and a ring of mind shielding, and he carries a spell scroll (5th level) of raise dead."},{"name":"Undead Slayer","text":"When Rictavio hits an undead with a weapon attack, the undead takes an extra 10 (3d6) damage of the weapon's type."},{"name":"Spellcasting","text":["Rictavio is a 9th-level spellcaster. His spellcasting ability is Wisdom (spell save DC 15, +7 to hit with spell attacks). Rictavio has the following cleric spells prepared:","Cantrips (at will): guidance, light, mending, thaumaturgy","• 1st level (4 slots): cure wounds, detect evil and good, protection from evil and good, sanctuary","• 2nd level (3 slots): augury, lesser restoration, protection from poison","• 3rd level (3 slots): magic circle, remove curse, speak with dead","• 4th level (3 slots): death ward, freedom of movement","• 5th level (1 slots): dispel evil and good"]}],"action":[{"name":"Multiattack","text":"Rictavio makes two attacks with his sword cane."},{"name":"Sword Cane","text":"Melee Weapon Attack: +4 to hit, reach 5 ft., one target. 4 (1d6 + 1) bludgeoning damage (wooden cane) or piercing damage (silvered sword).","attack":"Sword Cane|+4|1d6+1"}],"slots":"4, 3, 3, 3, 1","spells":"guidance, light, mending, thaumaturgy, cure wounds, detect evil and good, protection from evil and good, sanctuary, augury, lesser restoration, protection from poison, magic circle, remove curse, speak with dead, death ward, freedom of movement, dispel evil and good","description":"Several months ago, a colorfully dressed half-elf bard came to Barovia in a carnival wagon, with a pet monkey on his shoulder. He took over an abandoned tower on Lake Baratok before rolling into the town of Vallaki several months later. Claiming to be a carnival ringmaster in search of new actors, he began regaling locals with tales of distant lands.\nMonster Hunter. The half-elf ringmaster is, in fact, a legendary human vampire hunter named Rudolph van Richten. Van Richten's tale is a sad one. A scholar and doctor from a land called Darkon, he married his childhood sweetheart, Ingrid, and together they had a son, Erasmus. When he was fourteen, Erasmus was stolen away by Vistani and sold to a vampire named Baron Metus to be used as a companion. By the time van Richten found his son, it was too late: the baron had already transformed Erasmus into a vampire spawn. Erasmus begged his father to end his suffering, which van Richten did by pounding a wooden stake through his son's chest. Baron Metus avenged that deed by killing van Richten's wife, and van Richten has lived with the horror of his family's destruction ever since. After destroying Baron Metus in turn, van Richten sought revenge against the Vistani and took up a life of hunting evil monsters.\nThe Waiting Game. Van Richten isn't a young man anymore. He knows his road is coming to an end, but his work isn't done. He has come to Barovia to kill Strahd von Zarovich, the greatest vampire of them all. Van Richten has studied Strahd for years and knows he can't hope to best the vampire in a straight-up confrontation: he must wait for the right moment to strike. He has good evidence to suggest that Strahd periodically hibernates in his coffin, sometimes for years, when all is quiet in the realm. While he bides his time, van Richten hides in plain sight with the aid of a hat of disguise, his thoughts protected by a ring of mind shielding. He is trying to learn more about the Keepers of the Feather - a society of wereravens that oppose Strahd - while trying not to expose the secret society to their mutual enemy. He thinks the wereravens might prove helpful when the time comes. Van Richten also wants to take out as many of Strahd's spies as he can, starting with evil Vistani.\nMan with a Plan.  Van Richten doesn't know that his former protégé, a good-aligned Vistana named Ezmerelda d'Avenir, has come to Barovia looking for him. He taught her many of his monster-hunting techniques, but she doesn't know all of his tricks and disguises. So far, their paths haven't crossed. In the event that van Richten becomes aware of Ezmerelda's presence, he does his utmost to protect her without putting his own plans in jeopardy. If he can manipulate a party of adventurers into keeping an eye on her, he will do so.\nVan Richten works alone. A curse placed on him long ago by a Vistani seer brings doom to those he befriends. Furthermore, he believes too much is at stake to risk exposure. Consequently, if he thinks he's in danger of being unmasked, he retreats to his tower (see chapter 11) or some other quiet corner of Strahd's domain.\nRictavio's Traits. Ideal. \"Evil cannot go unchallenged.\"\nBond. \"To protect those I love, I must keep them distant and hidden from my enemies.\"\nFlaw. \"I am cursed. Thus, I will never have peace.\"\nSource: Curse of Strahd p. 238","environment":""},{"name":"Rosavalda \"Rose\" Durst","size":"S","type":"undead","alignment":"Any alignment","ac":"11","hp":"35 (10d6)","speed":"walk 0 ft., fly 40 ft.","str":"7","dex":"13","con":"10","int":"10","wis":"12","cha":"17","save":"","skill":"","passive":"11","languages":"any languages it knew in life","cr":"4","resist":"acid, fire, lightning, thunder; bludgeoning, piercing, slashing from nonmagical attacks","immune":"cold, necrotic, poison","vulnerable":"","conditionImmune":"charmed, exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained","senses":"darkvision 60 ft.","trait":[{"name":"Ethereal Sight","text":"Rose can see 60 feet into the Ethereal Plane when it is on the Material Plane, and vice versa."},{"name":"Incorporeal Movement","text":"Rose can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object."}],"action":[{"name":"Withering Touch","text":"Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 17 (4d6 + 3) necrotic damage.","attack":"Withering Touch|+5|4d6+3"},{"name":"Etherealness","text":"Rose enters the Ethereal Plane from the Material Plane, or vice versa. It is visible on the Material Plane while it is in the Border Ethereal, and vice versa, yet it can't affect or be affected by anything on the other plane."},{"name":"Possession (Recharge 6)","text":["One humanoid that Rose can see within 5 feet of it must succeed on a DC 13 Charisma saving throw or be possessed by Rose; Rose then disappears, and the target is incapacitated and loses control of its body. Rose now controls the body but doesn't deprive the target of awareness. Rose can't be targeted by any attack, spell, or other effect, except ones that turn undead, and it retains its alignment, Intelligence, Wisdom, Charisma, and immunity to being charmed and frightened. It otherwise uses the possessed target's statistics, but doesn't gain access to the target's knowledge, class features, or proficiencies.","The possession lasts until the body drops to 0 hit points, Rose ends it as a bonus action, or Rose is turned or forced out by an effect like the dispel evil and good spell. When the possession ends, Rose reappears in an unoccupied space within 5 feet of the body. The target is immune to this ghost's Possession for 24 hours after succeeding on the saving throw or after the possession ends."]}],"description":"Source: Curse of Strahd p. 217","environment":"underdark, urban"},{"name":"Sangzor","size":"L","type":"beast","alignment":"Unaligned","ac":"11 (natural armor)","hp":"33 (3d10+3)","speed":"walk 40 ft.","str":"17","dex":"11","con":"12","int":"3","wis":"12","cha":"6","save":"","skill":"","passive":"11","languages":"","cr":"1/2","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Charge","text":"If Sangzor moves at least 20 feet straight toward a target and then hits it with a ram attack on the same turn, the target takes an extra 5 (2d4) bludgeoning damage. If the target is a creature, it must succeed on a DC 13 Strength saving throw or be knocked prone."},{"name":"Sure-Footed","text":"Sangzor has advantage on Strength and Dexterity saving throws made against effects that would knock it prone."}],"action":{"name":"Ram","text":"Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 8 (2d4 + 3) bludgeoning damage.","attack":"Ram|+5|2d4+3"},"description":"Source: Curse of Strahd p. 160","environment":"mountain, grassland, hill"},{"name":"Savid","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"13 (leather armor)","hp":"16 (3d8+3)","speed":"walk 30 ft.","str":"11","dex":"14","con":"12","int":"11","wis":"13","cha":"11","save":"","skill":"Nature +4, Perception +5, Stealth +6, Survival +5","passive":"15","languages":"any one language (usually Common)","cr":"1/2","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":{"name":"Keen Hearing and Sight","text":"Savid has advantage on Wisdom (Perception) checks that rely on hearing or sight."},"action":[{"name":"Multiattack","text":"Savid makes two melee attacks or two ranged attacks."},{"name":"Shortsword","text":"Melee Weapon Attack: +4 to hit, reach 5 ft., one target. 5 (1d6 + 2) piercing damage.","attack":"Shortsword|+4|1d6+2"},{"name":"Longbow","text":"Ranged Weapon Attack: +4 to hit, ranged 150/600 ft., one target. 6 (1d8 + 2) piercing damage.","attack":"Longbow|+4|1d8+2"}],"description":"Source: Curse of Strahd p. 133","environment":""},{"name":"Sir Godfrey Gwilym","size":"M","type":"undead","alignment":"Neutral","ac":"13 (leather armor)","hp":"136 (16d8+64)","speed":"walk 30 ft.","str":"18","dex":"14","con":"18","int":"13","wis":"16","cha":"18","save":"Str +7, Con +7, Wis +6, Cha +7","skill":"","passive":"13","languages":"the languages it knew in life","cr":"5","resist":"necrotic, psychic","immune":"poison","vulnerable":"","conditionImmune":"charmed, exhaustion, frightened, paralyzed, poisoned, stunned","senses":"darkvision 60 ft.","trait":[{"name":"Regeneration","text":"Sir Godfrey regains 10 hit points at the start of its turn. If Sir Godfrey takes fire or radiant damage, this trait doesn't function at the start of Sir Godfrey's next turn. Sir Godfrey's body is destroyed only if it starts its turn with 0 hit points and doesn't regenerate."},{"name":"Rejuvenation","text":"When Sir Godfrey's body is destroyed, its soul lingers. After 24 hours, the soul inhabits and animates another humanoid corpse on the same plane of existence and regains all its hit points. While the soul is bodiless, a wish spell can be used to force the soul to go to the afterlife and not return."},{"name":"Turn Immunity","text":"Sir Godfrey is immune to effects that turn undead."},{"name":"Vengeful Tracker","text":"Sir Godfrey knows the distance to and direction of any creature against which it seeks revenge, even if the creature and Sir Godfrey are on different planes of existence. If the creature being tracked by Sir Godfrey dies, Sir Godfrey knows."}],"action":[{"name":"Multiattack","text":"Sir Godfrey makes two fist attacks."},{"name":"Fist","text":"Melee Weapon Attack: +7 to hit, reach 5 ft., one target. 11 (2d6 + 4) bludgeoning damage. If the target is a creature against which Sir Godfrey has sworn vengeance, the target takes an extra 14 (4d6) bludgeoning damage. Instead of dealing damage, Sir Godfrey can grapple the target (escape DC 14) provided the target is Large or smaller.","attack":"Fist|+7|2d6+4"},{"name":"Vengeful Glare","text":"Sir Godfrey targets one creature it can see within 30 feet of it and against which it has sworn vengeance. The target must make a DC 15 Wisdom saving throw. On a failure, the target is paralyzed until Sir Godfrey deals damage to it, or until the end of Sir Godfrey's next turn. When the paralysis ends, the target is frightened of Sir Godfrey for 1 minute. The frightened target can repeat the saving throw at the end of each of its turns, with disadvantage if it can see Sir Godfrey, ending the frightened condition on itself on a success."},{"name":"Variant: Revenants with Spells and Weapons","text":"Revenants that were spellcasters before they died might retain some or all of their spellcasting capabilities. Similarly, revenants that wore armor and wielded weapons in life might continue to do so."}],"description":"Source: Curse of Strahd p. 139","environment":"forest, swamp, hill, urban, desert, arctic"},{"name":"Snow Maiden","size":"M","type":"undead","alignment":"Chaotic Evil","ac":"12","hp":"22 (5d8)","speed":"walk 0 ft., fly 50 ft.","str":"1","dex":"14","con":"11","int":"10","wis":"10","cha":"11","save":"","skill":"","passive":"10","languages":"understands all languages it knew in life but can't speak","cr":"1","resist":"acid, fire, lightning, thunder; bludgeoning, piercing, slashing from nonmagical attacks","immune":"necrotic, poison","vulnerable":"","conditionImmune":"charmed, exhaustion, grappled, paralyzed, petrified, poisoned, prone, restrained, unconscious","senses":"darkvision 60 ft.","trait":[{"name":"Incorporeal Movement","text":"The specter can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object."},{"name":"Sunlight Sensitivity","text":"While in sunlight, the specter has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight."}],"action":{"name":"Life Drain","text":"Melee Spell Attack: +4 to hit, reach 5 ft., one creature. 10 (3d6) cold damage. The target must succeed on a DC 10 Constitution saving throw or its hit point maximum is reduced by an amount equal to the damage taken. This reduction lasts until the creature finishes a long rest. The target dies if this effect reduces its hit point maximum to 0.","attack":"Life Drain|+4|3d6"},"description":"Source: Curse of Strahd p. 159","environment":"underdark, urban"},{"name":"Stanimir","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"12 (15 with mage armor)","hp":"40 (9d8)","speed":"walk 30 ft.","str":"9","dex":"14","con":"11","int":"17","wis":"12","cha":"11","save":"Int +6, Wis +4","skill":"Arcana +6, History +6","passive":"11","languages":"any four languages","cr":"6","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","action":[{"name":"Dagger","text":"Melee or Ranged Weapon Attack: +5 to hit, reach 5 ft. or range 20/60 ft., one target. 4 (1d4 + 2) piercing damage.","attack":"Dagger|+5|1d4+2"},{"name":"Variant: Familiars","text":"Any spellcaster that can cast the find familiar spell (such as an archmage or mage) is likely to have a familiar. The familiar can be one of the creatures described in the spell (see the Player's Handbook) or some other Tiny monster, such as a crawling claw, imp, pseudodragon, or quasit."}],"trait":{"name":"Spellcasting","text":["Stanimir is a 9th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 14, +6 to hit with spell attacks). Stanimir has the following wizard spells prepared:","Cantrips (at will): fire bolt, light, mage hand, prestidigitation","• 1st level (4 slots): detect magic, mage armor, magic missile, shield","• 2nd level (3 slots): misty step, suggestion","• 3rd level (3 slots): counterspell, fireball, fly","• 4th level (3 slots): greater invisibility, ice storm","• 5th level (1 slots): cone of cold"]},"slots":"4, 3, 3, 3, 1","spells":"fire bolt, light, mage hand, prestidigitation, detect magic, mage armor, magic missile, shield, misty step, suggestion, counterspell, fireball, fly, greater invisibility, ice storm, cone of cold","description":"Source: Curse of Strahd p. 20","environment":""},{"name":"Stella Wachter","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"10","hp":"4 (1d8)","speed":"walk 30 ft.","str":"10","dex":"10","con":"10","int":"10","wis":"10","cha":"10","save":"","skill":"","passive":"10","languages":"any one language (usually Common)","cr":"0","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","action":{"name":"Club","text":"Melee Weapon Attack: +2 to hit, reach 5 ft., one target. 2 (1d4) bludgeoning damage.","attack":"Club|+2|1d4"},"description":"Source: Curse of Strahd p. 113","environment":"arctic, desert, coastal, grassland, hill, urban, forest"},{"name":"Strahd von Zarovich","size":"M","type":"undead (shapechanger)","alignment":"Lawful Evil","ac":"16 (natural armor)","hp":"144 (17d8+68)","speed":"walk 30 ft.","str":"18","dex":"18","con":"18","int":"20","wis":"15","cha":"18","save":"Dex +9, Wis +7, Cha +9","skill":"Arcana +15, Perception +12, Religion +10, Stealth +14","passive":"22","languages":"Abyssal, Common, Draconic, Elvish, Giant, Infernal","cr":"15","resist":"necrotic; bludgeoning, piercing, slashing from nonmagical attacks","immune":"","vulnerable":"","conditionImmune":"","senses":"darkvision 120 ft.","trait":[{"name":"Shapechanger","text":["If Strahd isn't in running water or sunlight, he can use his action to polymorph into a Tiny bat, a Medium wolf, or a Medium cloud of mist, or back into his true form.","While in bat or wolf form, Strahd can't speak. In bat form, his walking speed is 5 feet, and he has a flying speed of 30 feet. In wolf form, his walking speed is 40 feet. His statistics, other than his size and speed, are unchanged. Anything he is wearing transforms with him, but nothing he is carrying does. He reverts to his true form if he dies.","While in mist form, Strahd can't take any actions, speak, or manipulate objects. He is weightless, has a flying speed of 20 feet, can hover, and can enter a hostile creature's space and stop there. In addition, if air can pass through a space, the mist can do so without squeezing, and he can't pass through water. He has advantage on Strength, Dexterity, and Constitution saving throws, and he is immune to all nonmagical damage, except the damage he takes from sunlight."]},{"name":"Legendary Resistance (3/Day)","text":"If Strahd fails a saving throw, he can choose to succeed instead."},{"name":"Misty Escape","text":["When Strahd drops to 0 hit points outside his coffin, he transforms into a cloud of mist (as in the Shapechanger trait) instead of falling unconscious, provided that he isn't in running water or sunlight. If he can't transform, he is destroyed.","While he has 0 hit points in mist form, he can't revert to his vampire form, and he must reach his coffin within 2 hours or be destroyed. Once in his coffin, he reverts to his vampire form. He is then paralyzed until he regains at least 1 hit point. After 1 hour in his coffin with 0 hit points, he regains 1 hit point."]},{"name":"Regeneration","text":"Strahd regains 20 hit points at the start of his turn if he has at least 1 hit point and isn't in running water or sunlight. If he takes radiant damage or damage from holy water, this trait doesn't function at the start of his next turn."},{"name":"Spider Climb","text":"Strahd can climb difficult surfaces, including upside down on ceilings, without having to make an ability check."},{"name":"Vampire Weaknesses","text":["Strahd has the following flaws:","Forbiddance. He can't enter a residence without an invitation from one of the occupants.","Harmed by Running Water. He takes 20 acid damage if he ends his turn in running water.","Stake to the Heart. If a piercing weapon made of wood is driven into his heart while he is incapacitated in his coffin, he is paralyzed until the stake is removed.","Sunlight Hypersensitivity. While in sunlight, Strahd takes 20 radiant damage at the start of his turn, and he has disadvantage on attack rolls and ability checks."]},{"name":"Spellcasting","text":["Strahd is a 9th-level spellcaster. His spellcasting ability is Intelligence (spell save DC 18, +10 to hit with spell attacks). He has the following wizard spells prepared:","Cantrips (at will): mage hand, prestidigitation, ray of frost","• 1st level (4 slots): comprehend languages, fog cloud, sleep","• 2nd level (3 slots): detect thoughts, gust of wind, mirror image","• 3rd level (3 slots): animate dead, fireball, nondetection","• 4th level (3 slots): blight, greater invisibility, polymorph","• 5th level (1 slots): animate objects, scrying"]}],"action":[{"name":"Multiattack (Vampire Form Only)","text":"Strahd makes two attacks, only one of which can be a bite attack."},{"name":"Unarmed Strike (Vampire or Wolf Form Only)","text":"Melee Weapon Attack: +9 to hit, reach 5 ft., one target. 8 (1d8 + 4) slashing damage, plus 14 (4d6) necrotic damage. If the target is a creature, Strahd can grapple it (escape DC 18) instead of dealing the slashing damage.","attack":"Unarmed Strike (Vampire or Wolf Form Only)|+9|1d8+4"},{"name":"Bite","text":"Melee Weapon Attack: +9 to hit, reach 5 ft., one willing creature, or a creature that is grappled by Strahd, incapacitated, or restrained. 7 (1d6 + 4) piercing damage plus 10 (3d6) necrotic damage. The target's hit point maximum is reduced by an amount equal to the necrotic damage taken, and Strahd regains hit points equal to that amount. The reduction lasts until the target finishes a long rest. The target dies if its hit point maximum is reduced to 0. A humanoid slain in this way and then buried in the ground rises the following night as a vampire spawn under Strahd's control.","attack":"Bite|+9|1d6+4"},{"name":"Charm","text":["Strahd targets one humanoid he can see within 30 feet of him. If the target can see Strahd, the target must succeed on a DC 17 Wisdom saving throw against this magic or be charmed. The charmed target regards Strahd as a trusted friend to be heeded and protected. The target isn't under Strahd's control, but it takes Strahd's requests and actions in the most favorable way and lets Strahd bite it.","Each time Strahd or his companions do anything harmful to the target, it can repeat the saving throw, ending the effect on itself on a success. Otherwise, the effect lasts 24 hours or until Strahd is destroyed, is on a different plane of existence than the target, or takes a bonus action to end the effect."]},{"name":"Children of the Night (1/Day)","text":"Strahd magically calls 2d4 swarm of bats or swarm of rats, provided that the sun isn't up. While outdoors, Strahd can call 3d6 wolf instead. The called creatures arrive in 1d4 rounds, acting as allies of Strahd and obeying his spoken commands. The beasts remain for 1 hour, until Strahd dies, or until he dismisses them as a bonus action."}],"legendary":[{"text":"Strahd can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. Strahd regains spent legendary actions at the start of its turn."},{"name":"Move","text":"Strahd moves up to his speed without provoking opportunity attacks."},{"name":"Unarmed Strike","text":"Strahd makes one unarmed strike."},{"name":"Bite (Costs 2 Actions)","text":"Strahd makes one bite attack."},{"name":"Lair Actions"},{"text":["While Strahd is in Castle Ravenloft, he can take lair actions as long as he isn't incapacitated.","On initiative count 20 (losing initiative ties), Strahd can take one of the following lair action options, or forgo using any of them in that round:","• Until initiative count 20 of the next round, Strahd can pass through solid walls, doors, ceilings, and floors as if they weren't there.","• Strahd targets any number of doors and windows that he can see, causing each one to either open or close as he wishes. Closed doors can be magically locked (needing a successful DC 20 Strength check to force open) until Strahd chooses to end the effect, or until Strahd uses this lair action again.","• Strahd summons the angry spirit of one who has died in the castle. The apparition appears next to a hostile creature that Strahd can see, makes an attack against that creature, and then disappears. The apparition has the statistics of a specter.","• Strahd targets one Medium or smaller creature that casts a shadow. The target's shadow must be visible to Strahd and within 30 feet of him. If the target fails a DC 17 Charisma saving throw, its shadow detaches from it and becomes a shadow that obeys Strahd's commands, acting on initiative count 20. A greater restoration spell or a remove curse spell cast on the target restores its natural shadow, but only if its undead shadow has been destroyed."]}],"slots":"4, 3, 3, 3, 1","spells":"mage hand, prestidigitation, ray of frost, comprehend languages, fog cloud, sleep, detect thoughts, gust of wind, mirror image, animate dead, fireball, nondetection, blight, greater invisibility, polymorph, animate objects, scrying","description":"With his mind sharp and his heart dark, Strahd von Zarovich is a formidable foe. Courage and lives beyond measure have been lost to him. Reread chapter 1, \"Into the Mists,\" to understand his personality and goals.\nAlthough Strahd can be encountered almost anywhere in his domain, the vampire is always encountered in the place indicated by the card reading in chapter 1, unless he has been forced into his tomb in the catacombs of Castle Ravenloft.\nStrahd's Tactics. Because the entire adventure revolves around Strahd, you must play him intelligently and do everything you can to make him a terrifying and cunning adversary for the player characters.\nWhen you run an encounter with Strahd, keep the following facts in mind:\n• Strahd attacks at the most advantageous moment and from the most advantageous position.\n• Strahd knows when he's in over his head. If he begins taking more damage than he can regenerate, he moves beyond the reach of melee combatants and spellcasters, or he flies away (using summoned wolves or swarms of bats or rats to guard his retreat).\n• Strahd observes the characters to see who among them are most easily swayed, then tries to charm characters who have low Wisdom scores and use them as thralls. At the very least, he can order a charmed character to guard him against other members of the adventuring party.\nThe Vampire's Minions. Whenever Strahd appears in a location other than his tomb or the place indicated by the card reading, roll a d20 and consult the Strahd's Minions table to determine what creatures he brings with him, if any.\nStrahd's Minions. d20 | Creatures\n1–3 | 1d4 + 2 dire wolf\n4–6 | 1d6 + 3 ghoul\n7–9 | 1d4 + 2 Strahd zombie (in this appendix)\n10–12 | 2d4 swarm of bats\n13–15 | 1d4 + 1 vampire spawn\n16–18 | 3d6 wolf\n19–20 | None\n\nIf the characters are in a residence, Strahd's creatures break through doors and windows to reach them, or crawl up through the earth, or swoop down the chimney. The vampire spawn (all that's left of a party of adventurers that Strahd defeated long ago) can't enter the characters' location unless invited.\nHeart of Sorrow. Strahd can afford to be bold in his tactics, for he has additional protection in the form of a giant crystal heart hidden inside Castle Ravenloft.\nAny damage that Strahd takes is transferred to the Heart of Sorrow (see chapter 4, area K20). If the heart absorbs damage that reduces it to 0 hit points, it is destroyed, and Strahd takes any leftover damage. The Heart of Sorrow has 50 hit points and is restored to that number of hit points each dawn, provided it has at least 1 hit point remaining. Strahd can, as a bonus action on his turn, break his link to the Heart of Sorrow so that it no longer absorbs damage dealt to him. Strahd can reestablish his link to the Heart of Sorrow as a bonus action on his turn, but only while in Castle Ravenloft.\nThe effect of the protection afforded by the Heart of Sorrow can be chilling to behold, as damage to Strahd is quickly undone. For example, a critical hit might dislocate Strahd's jaw, but only for a moment; then the vampire's jaw quickly resets itself.\nThe ability of the Heart of Sorrow to absorb damage is suppressed if it or Strahd is fully within an antimagic field.\nSource: Curse of Strahd p. 240","environment":""},{"name":"Strahd Zombie","size":"M","type":"undead","alignment":"Unaligned","ac":"8","hp":"30 (4d8+12)","speed":"walk 20 ft.","str":"13","dex":"6","con":"16","int":"3","wis":"6","cha":"5","save":"Wis +0","skill":"","passive":"8","languages":"understands the languages it knew in life but can't speak","cr":"1","resist":"","immune":"poison","vulnerable":"","conditionImmune":"poisoned","senses":"darkvision 60 ft.","trait":{"name":"Loathsome Limbs","text":["Whenever the zombie takes at least 5 bludgeoning or slashing damage at one time, roll a d20 to determine what else happens to it:","1–8: One leg is severed from the zombie if it has any legs left.","9–16: One arm is severed from the zombie if it has any arms left.","17–20: The zombie is decapitated.","If the zombie is reduced to 0 hit points, all parts of it die. Until then, a severed part acts on the zombie's initiative and has its own action and movement. A severed part has AC 8. Any damage it takes is subtracted from the zombie's hit points.","A severed leg is unable to attack and has a speed of 5 feet.","A severed arm has a speed of 5 feet and can make one claw attack on its turn, with disadvantage on the attack roll. Each time the zombie loses an arm, it loses a claw attack.","If its head is severed, the zombie loses its bite attack and its body is blinded unless the head can see it. The severed head has a speed of 0 feet. It can make a bite attack, but only against a target in its space.","The zombie's speed is halved if it's missing a leg. If it loses both legs, it falls prone. If it has both arms, it can crawl. With only one arm, it can still crawl, but its speed is halved. With no arms or legs, its speed is 0 feet, and it can't benefit from bonuses to speed."]},"action":[{"name":"Multiattack","text":"The zombie makes three attacks: one with its bite and two with its claws."},{"name":"Bite","text":"Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 3 (1d4 + 1) piercing damage.","attack":"Bite|+3|1d4+1"},{"name":"Claw","text":"Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 4 (1d6 + 1) slashing damage.","attack":"Claw|+3|1d6+1"}],"description":"Strahd zombies are undead that serve the vampire Strahd von Zarovich. Created from the long-dead guards of Castle Ravenloft, they were called into being through dark magic by Strahd himself.\nLoathsome Limbs. A Strahd zombie's gray-green flesh looks soft, and its bones seem brittle. Any good hit from a bludgeoning or slashing weapon severs part of the zombie's body. Strahd zombies are suffused with horrible necromantic magic that allows their severed body parts to continue to attack. All parts of a Strahd zombie are considered one and the same creature, so damage to any part damages the whole creature.\nUndead Nature. A Strahd zombie doesn't require air or sleep.\nSource: Curse of Strahd p. 241","environment":""},{"name":"Strahd's Animated Armor","size":"M","type":"construct","alignment":"Lawful Evil","ac":"21 (natural armor)","hp":"112 (15d8+45)","speed":"walk 30 ft.","str":"17","dex":"13","con":"16","int":"9","wis":"10","cha":"9","save":"","skill":"Perception +3","passive":"13","languages":"understands Common but can't speak","cr":"6","resist":"cold, fire","immune":"lightning, poison","vulnerable":"","conditionImmune":"blinded, charmed, deafened, exhaustion, frightened, paralyzed, petrified, poisoned","senses":"blindsight 60 ft. (blind beyond this radius)","trait":[{"name":"Constructed Nature","text":["An animated object doesn't require air, food, drink, or sleep.","The magic that animates an object is dispelled when the construct drops to 0 hit points. An animated object reduced to 0 hit points becomes inanimate and is too damaged to be of much use or value to anyone."]},{"name":"Antimagic Susceptibility","text":"The armor is incapacitated while in the area of an antimagic field. If targeted by dispel magic, the armor must succeed on a Constitution saving throw against the caster's spell save DC or fall unconscious for 1 minute."},{"name":"False Appearance","text":"While the armor remains motionless, it is indistinguishable from a normal suit of armor."}],"action":[{"name":"Multiattack","text":"The armor makes two melee attacks or uses Shocking Bolt twice."},{"name":"Greatsword","text":"Melee Weapon Attack: +6 to hit, reach 5 ft., one target. 10 (2d6 + 3) slashing damage plus 3 (1d6) lightning damage.","attack":"Greatsword|+6|2d6+3"},{"name":"Shocking Bolt","text":"Ranged Spell Attack: +4 to hit (with advantage on the attack roll if the target is wearing armor made of metal), range 60 ft., one target. 10 (3d6) lightning damage.","attack":"Shocking Bolt|+4|3d6"}],"description":"The armor that Strahd wore into battle when he was alive lives on today as a headless, animated suit of plate armor. The armor is painted burgundy and adorned with golden angelic motifs.\nThing of Evil. Strahd imbued his automaton with a sliver of his being, bequeathing unto his armor a malevolence not found in most animated objects. He also fortified his armor and placed a number of permanent spell effects on it to make the armor a better castle defender.\nThe armor understands Common but obeys only the commands of its master.\nSource: Curse of Strahd p. 227","environment":""},{"name":"Szoldar Szoldarovich","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"13 (leather armor)","hp":"16 (3d8+3)","speed":"walk 30 ft.","str":"11","dex":"14","con":"12","int":"11","wis":"13","cha":"11","save":"","skill":"Nature +4, Perception +5, Stealth +6, Survival +5","passive":"15","languages":"any one language (usually Common)","cr":"1/2","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":{"name":"Keen Hearing and Sight","text":"Szoldar has advantage on Wisdom (Perception) checks that rely on hearing or sight."},"action":[{"name":"Multiattack","text":"Szoldar makes two melee attacks or two ranged attacks."},{"name":"Shortsword","text":"Melee Weapon Attack: +4 to hit, reach 5 ft., one target. 5 (1d6 + 2) piercing damage.","attack":"Shortsword|+4|1d6+2"},{"name":"Longbow","text":"Ranged Weapon Attack: +4 to hit, ranged 150/600 ft., one target. 6 (1d8 + 2) piercing damage.","attack":"Longbow|+4|1d8+2"}],"description":"Source: Curse of Strahd p. 100","environment":""},{"name":"The Abbot","size":"M","type":"celestial","alignment":"Lawful Good","ac":"17 (natural armor)","hp":"136 (16d8+64)","speed":"walk 30 ft., fly 90 ft.","str":"18","dex":"18","con":"18","int":"17","wis":"20","cha":"20","save":"Wis +9, Cha +9","skill":"Insight +9, Perception +9","passive":"19","languages":"all, telepathy 120 ft.","cr":"10","resist":"radiant; bludgeoning, piercing, slashing from nonmagical attacks","immune":"","vulnerable":"","conditionImmune":"charmed, exhaustion, frightened","senses":"darkvision 120 ft.","trait":[{"name":"Angelic Weapons","text":"The Abbot's weapon attacks are magical. When The Abbot hits with any weapon, the weapon deals an extra 4d8 radiant damage (included in the attack)."},{"name":"Magic Resistance","text":"The Abbot has advantage on saving throws against spells and other magical effects."},{"name":"Innate Spellcasting","text":["The Abbot's spellcasting ability is Charisma (spell save DC 17). The Abbot can innately cast the following spells, requiring only verbal components:","At will: detect evil and good","1/day each: commune, raise dead"]}],"action":[{"name":"Multiattack","text":"The Abbot makes two melee attacks."},{"name":"Mace","text":"Melee Weapon Attack: +8 to hit, reach 5 ft., one target. 7 (1d6 + 4) bludgeoning damage plus 18 (4d8) radiant damage.","attack":"Mace|+8|1d6+4"},{"name":"Healing Touch (3/Day)","text":"The Abbot touches another creature. The target magically regains 20 (4d8 + 2) hit points and is freed from any curse, disease, poison, blindness, or deafness."},{"name":"Change Shape","text":["The Abbot magically polymorphs into a humanoid or beast that has a challenge rating equal to or less than its own, or back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (The Abbot's choice).","In a new form, The Abbot retains its game statistics and ability to speak, but its AC, movement modes, Strength, Dexterity, and special senses are replaced by those of the new form, and it gains any statistics and capabilities (except class features, legendary actions, and lair actions) that the new form has but that it lacks."]}],"spells":"detect evil and good, commune, raise dead","description":"Source: Curse of Strahd p. 151","environment":""},{"name":"The Mad Mage of Mount Baratok","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"12 (15 with mage armor)","hp":"99 (18d8+18)","speed":"walk 30 ft.","str":"10","dex":"14","con":"12","int":"20","wis":"15","cha":"16","save":"Int +9, Wis +6","skill":"Arcana +13, History +13","passive":"12","languages":"any six languages","cr":"12","resist":"damage from spells; nonmagical bludgeoning, piercing, slashing (from stoneskin)","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Magic Resistance","text":"The Mad Mage has advantage on saving throws against spells and other magical effects."},{"name":"Spellcasting","text":["The Mad Mage is an 18th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 17, +9 to hit with spell attacks). The Mad Mage can cast disguise self and invisibility at will and has the following wizard spells prepared:","At will: disguise self, invisibility","Cantrips (at will): fire bolt, light, mage hand, prestidigitation, shocking grasp","• 1st level (4 slots): detect magic, identify, mage armor*, magic missile","• 2nd level (3 slots): detect thoughts, mirror image, misty step","• 3rd level (3 slots): counterspell, fly, lightning bolt","• 4th level (3 slots): banishment, fire shield, stoneskin*","• 5th level (3 slots): cone of cold, scrying, wall of force","• 6th level (1 slots): globe of invulnerability","• 7th level (1 slots): teleport","• 8th level (1 slots): mind blank*","• 9th level (1 slots): time stop","*The Mad Mage casts these spells on itself before combat."]}],"action":[{"name":"Dagger","text":"Melee or Ranged Weapon Attack: +6 to hit, reach 5 ft. or range 20/60 ft., one target. 4 (1d4 + 2) piercing damage.","attack":"Dagger|+6|1d4+2"},{"name":"Variant: Familiars","text":"Any spellcaster that can cast the find familiar spell (such as an archmage or mage) is likely to have a familiar. The familiar can be one of the creatures described in the spell (see the Player's Handbook) or some other Tiny monster, such as a crawling claw, imp, pseudodragon, or quasit."}],"slots":"4, 3, 3, 3, 3, 1, 1, 1, 1","spells":"disguise self, invisibility, fire bolt, light, mage hand, prestidigitation, shocking grasp, detect magic, identify, mage armor, magic missile, detect thoughts, mirror image, misty step, counterspell, fly, lightning bolt, banishment, fire shield, stoneskin, cone of cold, scrying, wall of force, globe of invulnerability, teleport, mind blank, time stop","description":"Source: Curse of Strahd p. 39","environment":""},{"name":"Thornboldt \"Thorn\" Durst","size":"S","type":"undead","alignment":"Any alignment","ac":"11","hp":"35 (10d6)","speed":"walk 0 ft., fly 40 ft.","str":"7","dex":"13","con":"10","int":"10","wis":"12","cha":"17","save":"","skill":"","passive":"11","languages":"any languages it knew in life","cr":"4","resist":"acid, fire, lightning, thunder; bludgeoning, piercing, slashing from nonmagical attacks","immune":"cold, necrotic, poison","vulnerable":"","conditionImmune":"charmed, exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained","senses":"darkvision 60 ft.","trait":[{"name":"Ethereal Sight","text":"Thorn can see 60 feet into the Ethereal Plane when it is on the Material Plane, and vice versa."},{"name":"Incorporeal Movement","text":"Thorn can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object."}],"action":[{"name":"Withering Touch","text":"Melee Weapon Attack: +5 to hit, reach 5 ft., one target. 17 (4d6 + 3) necrotic damage.","attack":"Withering Touch|+5|4d6+3"},{"name":"Etherealness","text":"Thorn enters the Ethereal Plane from the Material Plane, or vice versa. It is visible on the Material Plane while it is in the Border Ethereal, and vice versa, yet it can't affect or be affected by anything on the other plane."},{"name":"Possession (Recharge 6)","text":["One humanoid that Thorn can see within 5 feet of it must succeed on a DC 13 Charisma saving throw or be possessed by Thorn; Thorn then disappears, and the target is incapacitated and loses control of its body. Thorn now controls the body but doesn't deprive the target of awareness. Thorn can't be targeted by any attack, spell, or other effect, except ones that turn undead, and it retains its alignment, Intelligence, Wisdom, Charisma, and immunity to being charmed and frightened. It otherwise uses the possessed target's statistics, but doesn't gain access to the target's knowledge, class features, or proficiencies.","The possession lasts until the body drops to 0 hit points, Thorn ends it as a bonus action, or Thorn is turned or forced out by an effect like the dispel evil and good spell. When the possession ends, Thorn reappears in an unoccupied space within 5 feet of the body. The target is immune to this ghost's Possession for 24 hours after succeeding on the saving throw or after the possession ends."]}],"description":"Source: Curse of Strahd p. 217","environment":"underdark, urban"},{"name":"Tree Blight","size":"H","type":"plant","alignment":"Neutral Evil","ac":"15 (natural armor)","hp":"149 (13d12+65)","speed":"walk 30 ft.","str":"23","dex":"10","con":"20","int":"6","wis":"10","cha":"3","save":"","skill":"","passive":"10","languages":"understands Common and Druidic but doesn't speak","cr":"7","resist":"","immune":"","vulnerable":"","conditionImmune":"blinded, deafened","senses":"blindsight 60 ft. (blind beyond this radius)","trait":[{"name":"False Appearance","text":"While the blight remains motionless, it is indistinguishable from a dead tree."},{"name":"Siege Monster","text":"The blight deals double damage to objects and structures."}],"action":[{"name":"Multiattack","text":"The blight makes four attacks: two with its branches and two with its grasping roots. If it has a target grappled, the blight can also make a bite attack against that target as a bonus action."},{"name":"Bite","text":"Melee Weapon Attack: +9 to hit, reach 5 ft., one target. 19 (3d8 + 6) piercing damage.","attack":"Bite|+9|3d8+6"},{"name":"Branch","text":"Melee Weapon Attack: +9 to hit, reach 15 ft., one target. 16 (3d6 + 6) bludgeoning damage.","attack":"Branch|+9|3d6+6"},{"name":"Grasping Root","text":"Melee Weapon Attack: +9 to hit, reach 15 ft., one creature not grappled by the blight. The target is grappled (escape DC 15). Until the grapple ends, the target takes 9 (1d6 + 6) bludgeoning damage at the start of each of its turns. The root has AC 15 and can be severed by dealing 6 slashing damage or more to it at once. Cutting the root doesn't hurt the blight, but ends the grapple.","attack":"Grasping Root|+9|1d6+6"}],"description":"Blights (as described in the Monster Manual) are evil, ambulatory plant creatures, and a tree blight is a particularly enormous variety. It looks like a dead tree or treant, 30 feet tall, with spongy wooden flesh, thorny branches, and rubbery roots that trail behind it. It has blood for sap and is so saturated with blood that it doesn't catch fire easily.\nVicious Carnivore. A tree blight feeds on warm-blooded prey and takes perverse delight in causing carnage. It strikes with its heavy branches and crushes prey to death with its roots. It can open its gaping, tooth-filled mouth and bite a creature caught in its roots. The roots of a tree blight can be severed, though cutting them causes the blight no harm.\nBlight Animosity. A tree blight will often fight alongside other kinds of blights, but it hates other tree blights and will attack them given the chance. Tree blights also hate treants, and the feeling is mutual.\nSource: Curse of Strahd p. 230","environment":""},{"name":"Vasilka","size":"M","type":"construct","alignment":"Neutral","ac":"9","hp":"93 (11d8+44)","speed":"walk 30 ft.","str":"19","dex":"9","con":"18","int":"6","wis":"10","cha":"5","save":"","skill":"","passive":"10","languages":"understands the languages of its creator but can't speak","cr":"5","resist":"","immune":"lightning, poison; bludgeoning, piercing, slashing from nonmagical attacks that aren't adamantine","vulnerable":"","conditionImmune":"charmed, exhaustion, frightened, paralyzed, petrified, poisoned","senses":"darkvision 60 ft.","trait":[{"name":"Berserk","text":["Whenever Vasilka starts its turn with 40 hit points or fewer, roll a d6. On a 6, Vasilka goes berserk. On each of its turns while berserk, Vasilka attacks the nearest creature it can see. If no creature is near enough to move to and attack, Vasilka attacks an object, with preference for an object smaller than itself. Once Vasilka goes berserk, it continues to do so until it is destroyed or regains all its hit points.","Vasilka's creator, if within 60 feet of the berserk golem, can try to calm it by speaking firmly and persuasively. Vasilka must be able to hear its creator, who must take an action to make a DC 15 Charisma (Persuasion) check. If the check succeeds, Vasilka ceases being berserk. If it takes damage while still at 40 hit points or fewer, Vasilka might go berserk again."]},{"name":"Aversion of Fire","text":"If Vasilka takes fire damage, it has disadvantage on attack rolls and ability checks until the end of its next turn."},{"name":"Immutable Form","text":"Vasilka is immune to any spell or effect that would alter its form."},{"name":"Lightning Absorption","text":"Whenever Vasilka is subjected to lightning damage, it takes no damage and instead regains a number of hit points equal to the lightning damage dealt."},{"name":"Magic Resistance","text":"Vasilka has advantage on saving throws against spells and other magical effects."},{"name":"Magic Weapons","text":"Vasilka's weapon attacks are magical."}],"action":[{"name":"Multiattack","text":"Vasilka makes two slam attacks."},{"name":"Slam","text":"Melee Weapon Attack: +7 to hit, reach 5 ft., one target. 13 (2d8 + 4) bludgeoning damage.","attack":"Slam|+7|2d8+4"}],"description":"Source: Curse of Strahd p. 151","environment":""},{"name":"Victor Vallakovich","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"12 (15 with mage armor)","hp":"40 (9d8)","speed":"walk 30 ft.","str":"9","dex":"14","con":"11","int":"17","wis":"12","cha":"11","save":"Int +6, Wis +4","skill":"Arcana +6, History +6","passive":"11","languages":"any four languages","cr":"6","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","action":[{"name":"Dagger","text":"Melee or Ranged Weapon Attack: +5 to hit, reach 5 ft. or range 20/60 ft., one target. 4 (1d4 + 2) piercing damage.","attack":"Dagger|+5|1d4+2"},{"name":"Variant: Familiars","text":"Any spellcaster that can cast the find familiar spell (such as an archmage or mage) is likely to have a familiar. The familiar can be one of the creatures described in the spell (see the Player's Handbook) or some other Tiny monster, such as a crawling claw, imp, pseudodragon, or quasit."}],"trait":{"name":"Spellcasting","text":["Victor is a 9th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 14, +6 to hit with spell attacks). Victor has the following wizard spells prepared:","Cantrips (at will): fire bolt, light, mage hand, prestidigitation","• 1st level (4 slots): detect magic, mage armor, magic missile, shield","• 2nd level (3 slots): misty step, suggestion","• 3rd level (3 slots): counterspell, fireball, fly","• 4th level (3 slots): greater invisibility, ice storm","• 5th level (1 slots): cone of cold"]},"slots":"4, 3, 3, 3, 1","spells":"fire bolt, light, mage hand, prestidigitation, detect magic, mage armor, magic missile, shield, misty step, suggestion, counterspell, fireball, fly, greater invisibility, ice storm, cone of cold","description":"Source: Curse of Strahd p. 105","environment":""},{"name":"Vilnius","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"12 (15 with mage armor)","hp":"40 (9d8)","speed":"walk 30 ft.","str":"9","dex":"14","con":"11","int":"17","wis":"12","cha":"11","save":"Int +6, Wis +4","skill":"Arcana +6, History +6","passive":"11","languages":"any four languages","cr":"6","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","action":[{"name":"Dagger","text":"Melee or Ranged Weapon Attack: +5 to hit, reach 5 ft. or range 20/60 ft., one target. 4 (1d4 + 2) piercing damage.","attack":"Dagger|+5|1d4+2"},{"name":"Variant: Familiars","text":"Any spellcaster that can cast the find familiar spell (such as an archmage or mage) is likely to have a familiar. The familiar can be one of the creatures described in the spell (see the Player's Handbook) or some other Tiny monster, such as a crawling claw, imp, pseudodragon, or quasit."}],"trait":{"name":"Spellcasting","text":["Vilnius is a 9th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 14, +6 to hit with spell attacks). Vilnius has the following wizard spells prepared:","Cantrips (at will): fire bolt, light, mage hand, prestidigitation","• 1st level (4 slots): detect magic, mage armor, magic missile, shield","• 2nd level (3 slots): misty step, suggestion","• 3rd level (3 slots): counterspell, fireball, fly","• 4th level (3 slots): greater invisibility, ice storm","• 5th level (1 slots): cone of cold"]},"slots":"4, 3, 3, 3, 1","spells":"fire bolt, light, mage hand, prestidigitation, detect magic, mage armor, magic missile, shield, misty step, suggestion, counterspell, fireball, fly, greater invisibility, ice storm, cone of cold","description":"Source: Curse of Strahd p. 185","environment":""},{"name":"Vladimir Horngaard","size":"M","type":"undead","alignment":"Lawful Evil","ac":"17 (half plate armor)","hp":"192 (16d8+64)","speed":"walk 30 ft.","str":"18","dex":"14","con":"18","int":"13","wis":"16","cha":"18","save":"Str +7, Con +7, Wis +6, Cha +7","skill":"","passive":"13","languages":"Common, Draconic","cr":"7","resist":"necrotic, psychic","immune":"poison","vulnerable":"","conditionImmune":"charmed, exhaustion, frightened, paralyzed, poisoned, stunned","senses":"darkvision 60 ft.","trait":[{"name":"Regeneration","text":"Vladimir regains 10 hit points at the start of his turn. If he takes fire or radiant damage, this trait doesn't function at the start of his next turn. Vladimir's body is destroyed only if he starts his turn with 0 hit points and doesn't regenerate."},{"name":"Rejuvenation","text":"When Vladimir's body is destroyed, his soul lingers. After 24 hours, the soul inhabits and animates another corpse on the same plane of existence and regains all its hit points. While the soul is bodiless, a wish spell can be used to force the soul to go to the afterlife and not return."},{"name":"Special Equipment","text":"Vladimir wields a +2 greatsword with a hilt sculpted to resemble silver dragon wings and a pommel shaped like a silver dragon's head clutching a black opal between its teeth."},{"name":"Turn Immunity","text":"Vladimir is immune to effects that turn undead."},{"name":"Vengeful Tracker","text":"Vladimir knows the distance to and direction of Strahd, even if Strahd and Vladimir are on different planes of existence. If Strahd is destroyed, Vladimir knows."}],"action":[{"name":"Multiattack","text":"Vladimir makes two fist attacks or two attacks with his +2 Greatsword."},{"name":"Fist","text":"Melee Weapon Attack: +7 to hit, reach 5 ft., one target. 11 (2d6 + 4) bludgeoning damage. Strahd, the target of Vladimir's sworn vengeance, takes an extra 14 (4d6) bludgeoning damage. Instead of dealing damage, Vladimir can grapple the target (escape DC 14) provided the target is Large or smaller.","attack":"Fist|+7|2d6+4"},{"name":"Greatsword +2","text":"Melee Weapon Attack: +9 to hit, reach 5 ft., one target. 20 (4d6 + 6) slashing damage. Against Strahd, Vladimir deals an extra 14 (4d6) slashing damage with this weapon.","attack":"Greatsword +2|+9|4d6+6"},{"name":"Vengeful Glare","text":"Vladimir can target Strahd within 30 feet provided he can see Strahd. Strahd must make a DC 15 Wisdom saving throw. One a failure, Strahd is paralyzed until Vladimir deals damage to him, or until the end of Vladimir's next turn. When the paralysis ends, Strahd is frightened of Vladimir for 1 minute. Strahd can repeat the saving throw at the end of each of his turns, with disadvantage if he can see Vladimir, ending the frightened condition on itself on a success."}],"description":"Vladimir Horngaard joined the Order of the Silver Dragon at a young age and quickly earned the friendship of its founder, the silver dragon Argynvost. When he became a knight of the order, he traveled to distant lands to wage war against the forces of evil. The dragon stayed home and, in the guise of a human noble named Lord Argynvost, brought new initiates into the order.\nEnemies of Strahd. Vladimir found himself fighting Strahd's armies time and again as they swept across the land. When it became clear that Strahd couldn't be stopped, the knights of the order led hundreds of refugees to Argynvost's valley, but Strahd tracked them to their sanctuary and overwhelmed them with a vast force. Vladimir, whom Argynvost had made a field commander, couldn't hold back the evil tide and was killed, only after the heartbreak of witnessing Strahd himself slay Vladimir's beloved, his fellow knight Sir Godfrey Gwilym. With the battle won, Strahd surrounded Argynvostholt. Rather than cower in his lair, Argynvost emerged and battled Strahd's armies to the bitter end.\nDeadly Vengeance. Unwilling to accept his failure, Vladimir returned as a revenant. So great was his hatred of Strahd and his thirst for vengeance that those feelings fueled the spirits of many of his fellow knights - including Godfrey - to come back as revenants as well. Vladimir continued to wage the hopeless war, even as Strahd tightened his grip on the valley.\nWhen Strahd became a vampire, Vladimir and his revenants should have gone to their eternal rest. But Strahd's deeds were so heinous that Barovia and the knight's spirits became trapped behind curtains of mist.\nBlinded by Hatred.  Vladimir hates Strahd but doesn't want to see the vampire given his final rest. Vladimir wants Strahd to suffer forever for the deaths of Godfrey and Argynvost, the destruction of their order, and all the other crimes of which the vampire is guilty. Vladimir believes that all of Barovia has been swept into hell, and he wants to make sure that Strahd stays trapped in it forever. It angers Vladimir that he and his fellow knights are also trapped, but in Vladimir's mind, such is the price of keeping the vampire confined. Even his love for Godfrey is now just a dim memory shrouded by his hate.\nWere Vladimir to let go of his hatred, his spirit would find peace and could remember the warmth of love. Were Strahd to be defeated, even temporarily, the mists surrounding Barovia would fade, allowing the spirits of Vladimir and his knights to enter the afterlife. Nevertheless, Vladimir would rather savor Strahd's torment than bring peace to his fallen order or peace to the land of Barovia. Gone are the days of honor and valor.\nStatistics. Vladimir Horngaard has the statistics of a revenant with the following modifications:\n• Vladimir's alignment is lawful evil.\n• His Armor Class is 17 (half plate).\n• He has 192 hit points.\n• He speaks Common and Draconic.\n• Vladimir wields a +2 greatsword with a hilt sculpted to resemble silver dragon wings and a pommel shaped like a silver dragon's head clutching a black opal between its teeth. As an action, he can make two attacks with the sword (+9 to hit). It deals 20 (4d6 + 6) slashing damage on a hit. Against Strahd, Vladimir deals an extra 14 (4d6) slashing damage with the weapon.\n• Vladimir has a challenge rating of 7 (2,900 XP).\nVladimir Horngaard's Traits. Ideal. \"Vengeance is all I have left.\"\nBond. \"I have sworn oaths of allegiance to the Order of the Silver Dragon. Broken though the order may be, my allegiance never dies.\"\nFlaw. \"Destroying Strahd would end the vampire's torment, and that is something I will never allow.\"\nRevenant. A revenant forms from the soul of a mortal who met a cruel and undeserving fate. It claws its way back into the world to seek revenge against the one who wronged it. The revenant reclaims its mortal body and superficially resembles a zombie. However, instead of lifeless eyes, a revenant's eyes burn with resolve and flare in the presence of its adversary. If the revenant's original body was destroyed or is otherwise unavailable, the spirit of the revenant enters another humanoid corpse. Regardless of the body the revenant uses as a vessel, its adversary always recognizes the revenant for what it truly is.\nHunger for Revenge. A revenant has only one year to exact revenge. When its adversary dies, or if the revenant fails to kill its adversary before its time runs out, it crumbles to dust and its soul fades into the afterlife. If its foe is too powerful for the revenant to destroy on its own, it seeks worthy allies to help it fulfill its quest.\nDivine Justice. No magic can hide a creature pursued by a revenant, which always knows the direction and distance between it and the target of its vengeance. In cases where the revenant seeks revenge against more than one adversary, it pursues them one at a time, starting with the creature that dealt it the killing blow. If the revenant's body is destroyed, its soul flies forth to seek out a new corpse in which to resume its hunt.\nUndead Nature. A revenant doesn't require air, food, drink, or sleep.\nSource: Curse of Strahd p. 241","environment":""},{"name":"Volenta Popofsky","size":"M","type":"undead","alignment":"Neutral Evil","ac":"15 (natural armor)","hp":"82 (11d8+33)","speed":"walk 30 ft.","str":"16","dex":"16","con":"16","int":"11","wis":"10","cha":"12","save":"Dex +6, Wis +3","skill":"Perception +3, Stealth +6","passive":"13","languages":"the languages it knew in life","cr":"5","resist":"necrotic; bludgeoning, piercing, slashing from nonmagical attacks","immune":"","vulnerable":"","conditionImmune":"","senses":"darkvision 60 ft.","trait":[{"name":"Regeneration","text":"Volenta regains 10 hit points at the start of its turn if it has at least 1 hit point and isn't in sunlight or running water. If Volenta takes radiant damage or damage from holy water, this trait doesn't function at the start of Volenta's next turn."},{"name":"Spider Climb","text":"Volenta can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."},{"name":"Vampire Weaknesses","text":["Volenta has the following flaws:","Forbiddance. Volenta can't enter a residence without an invitation from one of the occupants.","Harmed by Running Water. Volenta takes 20 acid damage when it ends its turn in running water.","Stake to the Heart. Volenta is destroyed if a piercing weapon made of wood is driven into its heart while it is incapacitated in its resting place.","Sunlight Hypersensitivity. Volenta takes 20 radiant damage when it starts its turn in sunlight. While in sunlight, it has disadvantage on attack rolls and ability checks."]}],"action":[{"name":"Multiattack","text":"Volenta makes two attacks, only one of which can be a bite attack."},{"name":"Bite","text":"Melee Weapon Attack: +6 to hit, reach 5 ft., one willing creature, or a creature that is grappled by Volenta, incapacitated, or restrained. 6 (1d6 + 3) piercing damage plus 7 (2d6) necrotic damage. The target's hit point maximum is reduced by an amount equal to the necrotic damage taken, and Volenta regains hit points equal to that amount. The reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hit point maximum to 0.","attack":"Bite|+6|1d6+3"},{"name":"Claws","text":"Melee Weapon Attack: +6 to hit, reach 5 ft., one creature. 8 (2d4 + 3) slashing damage. Instead of dealing damage, Volenta can grapple the target (escape DC 13).","attack":"Claws|+6|2d4+3"}],"description":"Source: Curse of Strahd p. 93","environment":"underdark, urban"},{"name":"Wereraven","size":"M","type":"humanoid (human, shapechanger)","alignment":"Lawful Good","ac":"12","hp":"31 (7d8)","speed":"walk 30 ft.","str":"10","dex":"15","con":"11","int":"13","wis":"15","cha":"14","save":"","skill":"Insight +4, Perception +6","passive":"16","languages":"Common (can't speak in raven form)","cr":"2","resist":"","immune":"bludgeoning, piercing, slashing from nonmagical attacks not made with silvered weapons","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Shapechanger","text":"The wereraven can use its action to polymorph into a raven-humanoid hybrid or into a raven, or back into its human form. Its statistics, other than its size, are the same in each form. Any equipment it is wearing or carrying isn't transformed. It reverts to its human form if it dies."},{"name":"Mimicry","text":"The wereraven can mimic simple sounds it has heard, such as a person whispering, a baby crying, or an animal chittering. A creature that hears the sounds can tell they are imitations with a successful DC 10 Wisdom (Insight) check."}],"action":[{"name":"Multiattack (Human or Hybrid Form Only)","text":"The wereraven makes two weapon attacks, one of which can be with its hand crossbow."},{"name":"Beak (Raven or Hybrid Form Only)","text":"Melee Weapon Attack: +4 to hit, reach 5 ft., one target. 1 piercing damage in raven form, or 4 (1d4 + 2) piercing damage in hybrid form. If the target is humanoid, it must succeed on a DC 10 Constitution saving throw or be cursed with wereraven lycanthropy.","attack":"Beak (Raven or Hybrid Form Only)|+4|1d4+2"},{"name":"Shortsword (Human or Hybrid Form Only)","text":"Melee Weapon Attack: +4 to hit, reach 5 ft., one target. 5 (1d6 + 2) piercing damage.","attack":"Shortsword (Human or Hybrid Form Only)|+4|1d6+2"},{"name":"Hand Crossbow (Human or Hybrid Form Only)","text":"Ranged Weapon Attack: +4 to hit, range 30/120 ft., one target. 5 (1d6 + 2) piercing damage.","attack":"Hand Crossbow (Human or Hybrid Form Only)|+4|1d6+2"}],"description":"Wereravens are secretive and extraordinarily cautious lycanthropes that trust one another but are wary of just about everyone else. Although skilled at blending into society, they keep mostly to themselves, respect local laws, and strive to do good whenever possible.\nIn their human and hybrid forms, wereravens favor light weapons. They are reluctant to make bite attacks in raven form for fear of spreading their curse to those who don't deserve it or who would abuse it.\nA Kindness of Wereravens.  Wereravens refer to their tightly knit groups as kindnesses. A kindness of were-ravens usually numbers between seven and twelve individuals. Not surprisingly, wereravens get along well with ravens and often hide in plain sight among them.\nCharitable Collectors. Wereravens like to collect shiny trinkets and precious baubles. They are fond of sharing their wealth with those in need and, in their humanoid forms, modestly give money to charity. They take steps to keep magic items out of evil hands by stashing them in secret hiding places.\nCharacters as Wereravens. The Monster Manual has rules for characters afflicted with lycanthropy. The following text applies to wereraven characters specifically.\nA character cursed with wereraven lycanthropy gains a Dexterity of 15 if his or her score isn't already higher. Attack and damage rolls for the wereraven's bite are based on whichever is higher of the character's Strength and Dexterity. The bite of a wereraven in raven form deals 1 piercing damage (no ability modifier applies to this damage) and carries the curse of lycanthropy; see the \"Player Characters as Lycanthropes\" sidebar in the lycanthropes entry in the Monster Manual for details.\nSource: Curse of Strahd p. 242","environment":""},{"name":"Yevgeni Krushkin","size":"M","type":"humanoid (any race)","alignment":"Any alignment","ac":"13 (leather armor)","hp":"16 (3d8+3)","speed":"walk 30 ft.","str":"11","dex":"14","con":"12","int":"11","wis":"13","cha":"11","save":"","skill":"Nature +4, Perception +5, Stealth +6, Survival +5","passive":"15","languages":"any one language (usually Common)","cr":"1/2","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":{"name":"Keen Hearing and Sight","text":"Yevgeni has advantage on Wisdom (Perception) checks that rely on hearing or sight."},"action":[{"name":"Multiattack","text":"Yevgeni makes two melee attacks or two ranged attacks."},{"name":"Shortsword","text":"Melee Weapon Attack: +4 to hit, reach 5 ft., one target. 5 (1d6 + 2) piercing damage.","attack":"Shortsword|+4|1d6+2"},{"name":"Longbow","text":"Ranged Weapon Attack: +4 to hit, ranged 150/600 ft., one target. 6 (1d8 + 2) piercing damage.","attack":"Longbow|+4|1d8+2"}],"description":"Source: Curse of Strahd p. 100","environment":""},{"name":"Zuleika Toranescu","size":"M","type":"humanoid (human, shapechanger)","alignment":"Chaotic Evil","ac":"11 (in humanoid form, 12 (natural armor) in wolf or hybrid form)","hp":"58 (9d8+18)","speed":"walk 30 ft.","str":"15","dex":"13","con":"14","int":"10","wis":"11","cha":"10","save":"","skill":"Perception +4","passive":"14","languages":"Common (can't speak in wolf form)","cr":"3","resist":"","immune":"bludgeoning, piercing, slashing from nonmagical attacks that aren't silvered","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Shapechanger","text":"Zuleika can use its action to polymorph into a wolf-humanoid hybrid or into a wolf, or back into its true form, which is humanoid. Its statistics, other than its AC, are the same in each form. Any equipment it is wearing or carrying isn't transformed. It reverts to its true form if it dies."},{"name":"Keen Hearing and Smell","text":"Zuleika has advantage on Wisdom (Perception) checks that rely on hearing or smell."}],"action":[{"name":"Multiattack (Humanoid or Hybrid Form Only)","text":"Zuleika makes two attacks: two with its spear (humanoid form) or one with its bite and one with its claws (hybrid form)."},{"name":"Bite (Wolf or Hybrid Form Only)","text":"Melee Weapon Attack: +4 to hit, reach 5 ft., one target. 6 (1d8 + 2) piercing damage. If the target is a humanoid, it must succeed on a DC 12 Constitution saving throw or be cursed with werewolf lycanthropy.","attack":"Bite (Wolf or Hybrid Form Only)|+4|1d8+2"},{"name":"Claws (Hybrid Form Only)","text":"Melee Weapon Attack: +4 to hit, reach 5 ft., one creature. 7 (2d4 + 2) slashing damage.","attack":"Claws (Hybrid Form Only)|+4|2d4+2"},{"name":"Spear (Humanoid Form Only)","text":"Melee or Ranged Weapon Attack: +4 to hit, reach 5 ft. or range 20/60 ft., one creature. 5 (1d6 + 2) piercing damage, or 6 (1d8 + 2) piercing damage if used with two hands to make a melee attack.","attack":"Spear (Humanoid Form Only)|+4|1d6+2"},{"name":"Variant: Nonhuman Lycanthropes","text":"The statistics presented in this section assume a base creature of human. However, you can also use the statistics to represent nonhuman lycanthropes, adding verisimilitude by allowing a nonhuman lycanthrope to retain one or more of its humanoid racial traits. For example, an elf werewolf might have the Fey Ancestry trait."}],"description":"Source: Curse of Strahd p. 204","environment":"forest, hill"},{"name":"Zygfrek Belview","size":"M","type":"humanoid (mongrelfolk)","alignment":"Any alignment","ac":"11 (natural armor)","hp":"26 (4d8+8)","speed":"walk 20 ft.","str":"12","dex":"9","con":"15","int":"9","wis":"10","cha":"6","save":"","skill":"Deception +2, Perception +2, Stealth +3","passive":"12","languages":"Common","cr":"1/4","resist":"","immune":"","vulnerable":"","conditionImmune":"","senses":"","trait":[{"name":"Darkvision","text":"The mongrelfolk has darkvision out to a range of 60 feet."},{"name":"Mimicry","text":"Zygfrek can mimic any sounds it has heard, including voices. A creature that hears the sounds can tell they are imitations with a successful DC 12 Wisdom (Insight) check."}],"action":[{"name":"Multiattack","text":"Zygfrek makes two attacks: one with its bite and one with its claw or dagger."},{"name":"Bite","text":"Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 3 (1d4 + 1) piercing damage.","attack":"Bite|+3|1d4+1"},{"name":"Claw","text":"Melee Weapon Attack: +3 to hit, reach 5 ft., one target. 3 (1d4 + 1) slashing damage.","attack":"Claw|+3|1d4+1"},{"name":"Dagger","text":"Melee or Ranged Weapon Attack: +3 to hit, reach 5 ft. or range 20/60 ft., one target. 3 (1d4 + 1) piercing damage.","attack":"Dagger|+3|1d4+1"}],"description":"Source: Curse of Strahd p. 148","environment":""}],"_version":"5","_auto_indent":"NO"}}