{
    "compendium": {
        "item": [
            {
                "name": "Blood Spear",
                "detail": "Melee Weapon",
                "type": "M",
                "weight": "3",
                "property": "T,V",
                "dmg1": "1d6",
                "dmg2": "1d8",
                "dmgType": "P",
                "range": "20/60",
                "text": "Kavan was a ruthless chieftain whose tribe lived in the Balinok Mountains centuries before the arrival of Strahd von Zarovich. Although he was very much alive, Kavan had some traits in common with vampires: he slept during the day and hunted at night, he drank the blood of his prey, and he lived underground. In battle, he wielded a spear stained with blood. His was the first blood spear, a weapon that drains life from those it kills and transfers that life to its wielder, imbuing that individual with the stamina to keep fighting.\nWhen you hit with a melee attack using this magic spear and reduce the target to 0 hit points, you gain 2d6 temporary hit points.\nAny creature can wield the spear, but only the character chosen by Kavan to wield it gains a +2 bonus to attack and damage rolls made with this magic weapon.\nSource: Curse of Strahd p. 221",
                "roll": "2d6"
            },
            {
                "name": "Green Copper Ewer",
                "detail": "Other",
                "type": "G",
                "weight": "",
                "property": "",
                "text": "Any poisonous liquid poured into the ewer is instantly transformed into an equal amount of sweet wine. Furthermore, a creature that grasps the ewer's handle can command the ewer to fill with 1 gallon of wine, and it can't produce more wine until the next dawn.\nSource: Curse of Strahd p. 188"
            },
            {
                "name": "Gulthias Staff",
                "detail": "Staff",
                "type": "ST",
                "weight": "4",
                "property": "V",
                "dmg1": "1d6",
                "dmg2": "1d8",
                "dmgType": "B",
                "text": "Made from the branch of a Gulthias tree (see the twig blight entry of the Monster Manual), a Gulthias staff is a spongy, black length of wood. Its evil makes beasts visibly uncomfortable while within 30 feet of it. The staff has 10 charges and regains 1d6 + 4 of its expended charges daily at dusk.\nIf the staff is broken or burned to ashes, its wood releases a terrible, inhuman scream that can be heard out to a range of 300 feet. All blights that can hear the scream immediately wither and die.\nVampiric Strike: The staff can be wielded as a magic quarterstaff. On a hit, it deals damage as a normal quarterstaff, and you can expend 1 charge to regain a number of hit points equal to the damage dealt by the weapon. Each time a charge is spent, red blood oozes from the staff's pores, and you must succeed on a DC 12 Wisdom saving throw or be afflicted with short term madness (see \"Madness\" in chapter 8 of the Dungeon Master's Guide).\nBlight Bane: While you are attuned to the staff, blights and other evil plant creatures don't regard you as hostile unless you harm them.\nSource: Curse of Strahd p. 221",
                "roll": "1d6+4"
            },
            {
                "name": "Holy Symbol of Ravenkind",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "",
                "property": "",
                "text": "The Holy Symbol of Ravenkind is a unique holy symbol sacred to the good-hearted faithful of Barovia. It predates the establishment of any church in Barovia. According to legend, it was delivered to a paladin named Lugdana by a giant raven—or an angel in the form of a giant raven. Lugdana used the holy symbol to root out and destroy nests of vampires until her death. The high priests of Ravenloft kept and wore the holy symbol after Lugdana's passing.\nThe holy symbol is a platinum amulet shaped like the sun, with a large crystal embedded in its center.\nThe holy symbol has 10 charges for the following properties. It regains 1d6 + 4 charges daily at dawn.\nHold Vampires: As an action, you can expend 1 charge and present the holy symbol to make it flare with holy power. Vampires and vampire spawn within 30 feet of the holy symbol when it flares must make a DC 15 Wisdom saving throw. On a failed save, a target is paralyzed for 1 minute. It can repeat the saving throw at the end of its turns to end the effect on itself.\nTurn Undead: If you have the Turn Undead or the Turn the Unholy feature, you can expend 3 charges when you present the holy symbol while using that feature. When you do so, undead have disadvantage on their saving throws against the effect.\nSunlight: As an action, you can expend 5 charges while presenting the holy symbol to make it shed bright light in a 30-foot radius and dim light for an additional 30 feet. The light is sunlight and lasts for 10 minutes or until you end the effect (no action required).\nSource: Curse of Strahd p. 222",
                "roll": "1d6+4"
            },
            {
                "name": "Icon of Ravenloft",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "10",
                "property": "",
                "text": "The Icon of Ravenloft is a 12-inch tall statuette made of the purest silver, weighing 10 pounds. It depicts a cleric kneeling in supplication.\nThe icon was given to Strahd by the archpriest Ciril Romulich, an old family friend, to consecrate the castle and its chapel.\nWhile within 30 feet of the icon, a creature is under the effect of a protection from evil and good spell against fiends and undead. Only a creature attuned to the icon can use its other properties.\nAugury: You can use an action to cast an augury spell from the icon, with no material components required. Once used, this property can't be used again until the next dawn.\nBane of the Undead: You can use the icon as a holy symbol while using the Turn Undead or Turn the Unholy feature. If you do so, increase the save DC by 2.\nCure Wounds: While holding the icon, you can take an action to heal one creature that you can see within 30 feet of you. The target regains 3d8 + 3 hit points, unless it is an undead, a construct, or a fiend. Once used, this property can't be used again until the next dawn.\nSource: Curse of Strahd p. 222",
                "roll": "3d8+3"
            },
            {
                "name": "Jakarion's Staff of Frost",
                "detail": "major, Staff",
                "type": "ST",
                "weight": "4",
                "property": "V",
                "dmg1": "1d6",
                "dmg2": "1d8",
                "dmgType": "B",
                "text": "You have resistance to cold damage while you hold this staff.\nThe staff has 10 charges. While holding it, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: cone of cold (5 charges), fog cloud (1 charge), ice storm (4 charges), or wall of ice (4 charges).\nThe staff regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1. the staff turns to water and is destroyed.\nImprinted on this staff is a fragment of a dead wizard's personality. The first character who touches the staff gains the following flaw: \"I crave power above all else, and will do anything to obtain more of it.\" This flaw trumps any conflicting personality trait.\nFound On: Magic Item Table H\nSource: Curse of Strahd p. 187",
                "roll": "1d6+4"
            },
            {
                "name": "Lost Sword",
                "detail": "Melee Weapon",
                "type": "M",
                "weight": "2",
                "property": "F,L",
                "dmg1": "1d6",
                "dmgType": "P",
                "text": "The Lost Sword is a sentient lawful good +1 shortsword (Intelligence 11, Wisdom 13, Charisma 13). It has hearing and normal vision out to a range of 120 feet. It communicates by transmitting emotion to the creature carrying or wielding it.\nThe sword's purpose is to fight evil. The sword has the following additional properties:\n• The sword continually sheds bright light in a 15-foot radius and dim light for an additional 15 feet. Only by destroying the sword can this light be extinguished.\n• A lawful good creature can attune itself to the sword in 1 minute.\n• While attuned to the weapon, the sword's wielder can use the sword to cast the crusader's mantle spell. Once used, this property of the sword can't be used again until the next dawn.\nSource: Curse of Strahd p. 81"
            },
            {
                "name": "Monster Hunter's Pack",
                "detail": "Adventuring Gear",
                "type": "G",
                "weight": "48.5",
                "value": "33.0",
                "property": "",
                "text": "Includes:\n• a chest\n• a crowbar\n• a hammer\n• three wooden stakes\n• a holy symbol\n• a holy water (flask)\n• a set of manacles\n• a steel mirror\n• a oil (flask)\n• a tinderbox\n• 3 torch\nSource: Curse of Strahd p. 209"
            },
            {
                "name": "Order of the Silver Dragon +2 Shield",
                "detail": "major, Shield",
                "type": "S",
                "weight": "6",
                "property": "",
                "ac": "2",
                "text": "While holding this shield, you have a +2 bonus to AC. This bonus is in addition to the shield's normal bonus to AC.\nThe shield is emblazoned with a stylized silver dragon that is the emblem of the Order of the Silver Dragon (see Curse of Strahd, chapter 7). The shield whispers warnings to its bearer, granting a +2 bonus to initiative if the bearer isn't incapacitated.\nA shield is made from wood or metal and is carried in one hand. Wielding a shield increases your Armor Class by 2. You can benefit from only one shield at a time.\nSource: Curse of Strahd p. 68"
            },
            {
                "name": "Saint Markovia's Thighbone",
                "detail": "Melee Weapon",
                "type": "M",
                "weight": "4",
                "property": "",
                "dmg1": "1d6",
                "dmgType": "B",
                "text": "Saint Markovia's thighbone has the properties of a mace of disruption. If it scores one or more hits against a vampire or a vampire spawn in the course of a single battle, the thighbone crumbles into dust once the battle concludes.\nAs a youth, Markovia followed her heart and became a priest of the Morninglord soon after her eighteenth birthday. She proved to be a charismatic proselytizer and, before the age of thirty, had gained a reputation for allowing no evil to stand before her.\nMarkovia had long considered Strahd a mad tyrant, but only after his transformation into a vampire did she dare to challenge him. As she rallied her followers and prepared to march on Castle Ravenloft, Strahd sent a group of vampire spawn to her abbey. They confronted Markovia and were destroyed to a one.\nSuffused with confidence born of a righteous victory, Markovia advanced on Castle Ravenloft. A great battle raged from the catacombs to the parapets. In the end, Markovia never returned to Barovia, and Strahd long afterward walked with a limp and a grimace of pain. It is said that he trapped Markovia in a crypt beneath his castle, and her remains linger there yet.\nThe essence of Markovia's saintliness passed partly into her bones as the rest of her body decomposed. Her remaining thighbone is imbued with power that inflicts grievous injury on the undead.\nMace of Disruption. When you hit a fiend or an undead with this magic weapon, that creature takes an extra 2d6 radiant damage. If the target has 25 hit points or fewer after taking this damage, it must succeed on a DC 15 Wisdom saving throw or be destroyed. On a successful save, the creature becomes frightened of you until the end of your next turn.\nWhile you hold this weapon, it sheds bright light in a 20-foot radius and dim light for an additional 20 feet.\nSource: Curse of Strahd p. 222",
                "roll": "2d6"
            },
            {
                "name": "Statuette of Saint Markovia",
                "detail": "Other",
                "type": "G",
                "weight": "",
                "value": "250.0",
                "property": "",
                "text": "This golden statuette grants any good-aligned creature that carries it a +1 bonus to saving throws.\nSource: Curse of Strahd p. 152"
            },
            {
                "name": "Sunsword",
                "detail": "Melee Weapon",
                "type": "M",
                "weight": "3",
                "property": "F,V",
                "dmg1": "1d8",
                "dmg2": "1d10",
                "dmgType": "R",
                "text": "The Sunsword is a unique blade once possessed by Strahd's brother, Sergei von Zarovich. In its original form, it had a platinum hilt and guard, and a thin crystal blade as strong as steel.\nStrahd employed a powerful wizard named Khazan to destroy the weapon after Sergei's death. The first part of the process required the hilt and the blade to be separated, which Khazan accomplished. While Khazan was busying himself destroying the blade, his apprentice stole the hilt and fled. Khazan later located his apprentice's mutilated corpse in the Svalich Woods, but the hilt was nowhere to be found. To avoid the vampire's wrath, Khazan told Strahd that the entire weapon had been destroyed.\nThe hilt, which is sentient, knows that it can never be reunited with its original crystal blade. It has, however, gained the properties of a sun blade.\nSentience: The Sunsword is a sentient chaotic good weapon with an Intelligence of 11, a Wisdom of 17, and a Charisma of 16. It has hearing and normal vision out to a range of 60 feet. The weapon communicates by transmitting emotions to the creature carrying it or wielding it.\nPersonality: The Sunsword's special purpose is to destroy Strahd, not so much because it wants to free the land of Barovia from evil but because it wants revenge for the loss of its crystal blade. The weapon secretly fears its own destruction.\nSun blade. This item appears to be a longsword hilt. While grasping the hilt, you can use a bonus action to cause a blade of pure radiance to spring into existence, or make the blade disappear. While the blade exists, this magic longsword has the finesse property. If you are proficient with shortsword or longsword, you are proficient with the sun blade.\nYou gain a +2 bonus to attack and damage rolls made with this weapon, which deals radiant damage instead of slashing damage. When you hit an undead with it, that target takes an extra 1d8 radiant damage.\nThe sword's luminous blade emits bright light in a 15-foot radius and dim light for an additional 15 feet. The light is sunlight. While the blade persists, you can use an action to expand or reduce its radius of bright and dim light by 5 feet each, to a maximum of 30 feet each or a minimum of 10 feet each.\nSource: Curse of Strahd p. 223",
                "roll": "1d8"
            },
            {
                "name": "Tome of Strahd",
                "detail": "Adventuring Gear",
                "type": "G",
                "weight": "5",
                "property": "",
                "text": "The Tome of Strahd is an ancient work penned by Strahd, a tragic tale of how he came to his fallen state. The book is bound in a thick leather cover with steel hinges and fastenings. The pages are of parchment and very brittle. Most of the book is written in the curious shorthand that only Strahd employs. Stains and age have made most of the work illegible, but several paragraphs remain intact.\nSource: Curse of Strahd p. 221"
            },
            {
                "name": "Treebane",
                "detail": "Melee Weapon",
                "type": "M",
                "weight": "2",
                "property": "V",
                "dmg1": "1d8",
                "dmg2": "1d10",
                "dmgType": "S",
                "text": "The axe's handle is carved with leaves and vines, and it weighs half as much as a normal battleaxe. When the axe hits a plant, whether an ordinary plant or a plant creature, the target takes an extra 1d8 slashing damage. When a creature of non-good alignment wields the axe, it sprouts thorns whenever its wielder makes an attack with it. These thorns prick the wielder for 1 piercing damage after the attack is made, and this damage is considered magical.\nSource: Curse of Strahd p. 198",
                "roll": "1d8"
            },
            {
                "name": "Trinket (Gothic)",
                "detail": "Adventuring Gear",
                "type": "G",
                "weight": "",
                "property": "",
                "text": "When you make your character, you can roll once on the Trinkets table to gain a trinket, a simple item lightly touched by mystery. The DM might also use this table. It can help stock a room in a dungeon or fill a creatures pockets.\nCurse of Strahd. Character Options, Gothic Trinket Table\nd100 | Trinket\n01-02 | A picture you drew as a child of your imaginary friend\n03-04 | A lock that opens when blood is dripped in its keyhole\n05-06 | Clothes stolen from a scarecrow\n07-08 | A spinning top carved with four faces: happy, sad, wrathful, and dead\n09-10 | The necklace of a sibling who died on the day you were born\n11-12 | A wig from someone executed by beheading\n13-14 | The unopened letter to you from your dying father\n15-16 | A pocket watch that runs backward for an hour every midnight\n17-18 | A winter coat stolen from a dying soldier\n19-20 | A bottle of invisible ink that can only be read at sunset\n21-22 | A wineskin that refills when interred with a dead person for a night\n23-24 | A set of silverware used by a king for his last meal\n25-26 | A spyglass that always shows the world suffering a terrible storm\n27-28 | A cameo with the profile's face scratched away\n29-30 | A lantern with a black candle that never runs out and that burns with green flame\n31-32 | A teacup from a child's tea set, stained with blood\n33-34 | A little black book that records your dreams, and yours alone, when you sleep\n35-36 | A necklace formed of the interlinked holy symbols of a dozen deities\n37-38 | A hangman's noose that feels heavier than it should\n39-40 | A birdcage into which small birds fly but once inside never eat or leave\n41-42 | A lepidopterist's box filled dead moths with skulllike patterns on their wings\n43-44 | A jar of pickled ghouls' tongues\n45-46 | The wooden hand of a notorious pirate\n47-48 | An urn with the ashes of a dead relative\n49-50 | A hand mirror backed with a bronze depiction of a medusa\n51-52 | Pallid leather gloves crafted with ivory fingernails\n53-54 | Dice made from the knuckles of a notorious charlatan\n55-56 | A ring of keys for forgotten locks\n57-58 | Nails from the coffin of a murderer\n59-60 | A key to the family crypt\n61-62 | A bouquet of funerary flowers that always looks and smells fresh\n63-64 | A switch used to discipline you as a child\n65-66 | A music box that plays by itself whenever someone holding it dances\n67-68 | A walking cane with an iron ferrule that strikes sparks on stone\n69-70 | A flag from a ship lost at sea\n71-72 | Porcelain doll's head that always seems to be looking at you\n73-74 | A wolf's head wrought in silver that is also a whistle\n75-76 | A small mirror that shows a much older version of the viewer\n77-78 | Small, worn book of children's nursery rhymes\n79-80 | A mummified raven claw\n81-82 | A broken pendent of a silver dragon that's always cold to the touch\n83-84 | A small locked box that quietly hums a lovely melody at night but you always forget it in the morning\n85-86 | An inkwell that makes one a little nauseous when staring at it\n87-88 | An old little doll made from a dark, dense wood and missing a hand and a foot\n89-90 | A black executioner's hood\n91-92 | A pouch made of flesh, with a sinew drawstring\n93-94 | A tiny spool of black thread that never runs out\n95-96 | A tiny clockwork figurine of a dancer that's missing a gear and doesn't work\n97-98 | A black wooden pipe that creates puffs of smoke that look like skulls\n99-00 | A vial of perfume, the scent of which only certain creatures can detect\nSource: Curse of Strahd p. 2"
            }
        ],
        "_version": "5",
        "_auto_indent": "NO"
    }
}
