{
    "compendium": {
        "item": [
            {
                "name": "Abracadabrus",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "25",
                "property": "",
                "text": "An abracadabrus is an ornate, gemstone-studded wooden chest that weighs 25 pounds while empty. Its interior compartment is a cube measuring 1½ feet on a side.\nThe chest has 20 charges. A creature can use an action to touch the closed lid of the chest and expend 1 of the chest's charges while naming one or more nonmagical objects (including raw materials, foodstuffs, and liquids) worth a total of 1 gp or less. The named objects magically appear in the chest, provided they can all fit inside it and the chest doesn't contain anything else. For example, the chest can conjure a plate of strawberries, a bowl of hot soup, a flagon of water, a stuffed animal, or a bag of twenty caltrops. Food and drink conjured by the chest are delicious, and they spoil if not consumed after 24 hours. Gems and precious metals created by the chest disappear after 1 minute.\nThe chest regains 1d20 expended charges daily at dawn. If the item's last charge is expended, roll a d20. On a 1, the chest loses its magic (becoming an ordinary chest), and its gemstones turn to dust.\nSource: Icewind Dale: Rime of the Frostmaiden p. 314",
                "roll": "1d20"
            },
            {
                "name": "Axe Beak",
                "detail": "Mount",
                "type": "G",
                "weight": "",
                "value": "50.0",
                "property": "",
                "text": "An axe beak's splayed toes allow it to run across snow, and it can carry as much weight as a mule. A domesticated axe beak can be purchased in Ten-Towns for 50 gp.\nSource: Icewind Dale: Rime of the Frostmaiden p. 20"
            },
            {
                "name": "Cauldron of Plenty",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "50",
                "property": "",
                "text": "This cauldron is made of thick copper that has turned green with age. It is 4 feet wide, has a mouth 3½ feet in diameter, weighs 50 pounds, and can hold up to 30 gallons of liquid. Embossed on its bulging sides are images of satyrs and nymphs in repose, holding ladles. The cauldron comes with a lid and has side handles. It sits on five little clawed feet that keep it from tipping.\nIf water is poured into the cauldron and stirred for 1 minute, it transforms into a hearty, hot stew, which can provide one nourishing meal for up to four people per gallon. The stew remains hot while in the cauldron, then cools naturally after it is removed. The outside of the cauldron remains safe to touch despite the heat of the stew.\nThe cauldron can create stew three times. It then ceases to function until the next dawn, when it regains all its uses.\nSource: Icewind Dale: Rime of the Frostmaiden p. 314"
            },
            {
                "name": "Clothing, cold weather",
                "detail": "Adventuring Gear",
                "type": "G",
                "weight": "5",
                "value": "10.0",
                "property": "",
                "text": "This outfit consists of a heavy fur coat or cloak over layers of wool clothing, as well as a fur-lined hat or hood, goggles, and fur-lined leather boots and gloves.\nAs long as cold weather clothing remains dry, its wearer automatically succeeds on saving throws against the effects of extreme cold.\nSource: Icewind Dale: Rime of the Frostmaiden p. 20"
            },
            {
                "name": "Crampons",
                "detail": "Adventuring Gear",
                "type": "G",
                "weight": "0.25",
                "value": "2.0",
                "property": "",
                "text": "A crampon is a metal plate with spikes that is strapped to the sole of a boot. A creature wearing crampons can't fall prone while moving across slippery ice.\nSource: Icewind Dale: Rime of the Frostmaiden p. 20"
            },
            {
                "name": "Dogsled",
                "detail": "Vehicle (land)",
                "type": "G",
                "weight": "300",
                "value": "20.0",
                "property": "",
                "text": "An empty sled costs 20 gp, weighs 300 pounds, and has room at the back for one driver.\nSource: Icewind Dale: Rime of the Frostmaiden p. 20"
            },
            {
                "name": "Hook of Fisher's Delight",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "",
                "property": "",
                "text": "This tiny silver fishhook has a little gold feather attached to it. For it to function, the feathered hook must be tied to the end of a fishing line and immersed in enough water to fill at least a 10-foot cube. At the end of each uninterrupted hour of immersion, roll a d6. On a 6, a floppy, 6-inch-long magical fish appears on the end of the hook. The color and properties of the conjured fish are determined by rolling on the Hook of Fisher's Delight table. Once the hook conjures a fish, it can't do so again until the next dawn.\nHook of Fisher's Delight\nd20 | Fish Color | Result\n1-10 | Green with copper bands | This tasty fish provides a day's worth of nourishment to one creature that eats it. The fish loses this property and rots if it's not eaten within 24 hours of being caught.\n11-14 | Yellow with black stripes | Once removed from the hook, this awful-tasting fish can be thrown up to 120 feet, targeting a creature the thrower can see. The target must succeed on a DC 15 Strength saving throw or be knocked prone. The fish then disappears.\n15-18 | Blue with white bands | When released from the hook, this fish squirms free, sprouts wings, follows you around, and sings a beautiful tune in Aquan. It disappears after 2d4 hours or when reduced to 0 hit points. The fish uses the quipper stat block, except that it can breathe air and has a flying speed of 30 feet.\n19-20 | Gold with silver stripes | This tasty fish provides a day's worth of nourishment to one creature that eats it and grants 2d10 temporary hit points to that creature. The fish loses these properties and rots if it's not eaten within 24 hours of being caught.\nSource: Icewind Dale: Rime of the Frostmaiden p. 314",
                "roll": [
                    "2d4",
                    "2d10"
                ]
            },
            {
                "name": "Icewind Dale Trinket",
                "detail": "Adventuring Gear",
                "type": "G",
                "weight": "",
                "property": "",
                "text": "Icewind Dale Trinkets\nd100 | Trinket\n01–04 | A small wooden figurine of a yawning walrus, painted in red and black\n05–08 | A pair of scrimshaw cufflinks with an image of a fisherman on a boat engraved on them\n09–12 | A small iron key with a frayed blue and gold cord tied to it\n13–16 | A small illustrated book of Northlander myths that has pages missing\n17–20 | A damaged scrimshaw cameo depicting a merfolk\n21–24 | A stone from a burial cairn with a tiny Dwarvish rune carved into it\n25–28 | A ripped cloth sail with a symbol you don't recognize\n29–32 | An Ulu knife with a scrimshaw handle\n33–36 | A jar containing an unidentifiable, sweet, sticky substance\n37–40 | A delicate glass ball painted with snowflakes, capped by a metal loop with a tiny hook attached to it\n41–44 | An expedition log with missing pages and a pressed flower used as a bookmark\n45–48 | An owl figurine carved from whalebone\n49–52 | A sewing box that smells of old wood and has three spools of blue thread inside\n53–56 | A scrimshaw-handled ink pen with black runic designs along its length\n57–60 | A brooch made from a small insect encased in amber\n61–64 | A scrimshaw pepper shaker etched with the letter W\n65–68 | An old, wooden-handled ice pick stained with blood that won't wash off\n69–72 | A fabric doll bearing an angry expression\n73–76 | A set of wind chimes made from seashells\n77–80 | A beautiful silver tin that, when opened, emits the smell of rotting fish\n81–84 | A bloodstained dreamcatcher made from fishing line, gold wire, and snowy owlbear feathers\n85–88 | A figurine of a polar bear made of ice that never melts\n89–92 | A snow globe that doesn't need to be shaken\n93–96 | A piece of sea glass shaped like a unicorn's horn\n97–00 | A dark blue scarf that gets lighter in shade the higher the altitude of the wearer\nSource: Icewind Dale: Rime of the Frostmaiden p. 263"
            },
            {
                "name": "Lantern of Tracking",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "",
                "property": "",
                "text": "This hooded lantern burns for 6 hours on 1 pint of oil, shedding bright light in a 30-foot radius and dim light for an additional 30 feet.\nEach lantern of tracking is designed to track down a certain type of creature, which is determined by rolling on the Lantern of Tracking table. Once determined, this creature type can't be changed. While the lantern is within 300 feet of any creature of that type, its flame turns bright green. The lantern doesn't pinpoint the creature's exact location, however.\nLantern of Tracking\n1d10 | Creature Type\n1 | Aberrations\n2 | Celestials\n3 | Constructs\n4 | Dragons\n5 | Elementals\n6 | Fey\n7 | Fiends\n8 | Giants\n9 | Monstrosities\n10 | Undead\nSource: Icewind Dale: Rime of the Frostmaiden p. 314",
                "roll": "1d10"
            },
            {
                "name": "Orc Stone",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "",
                "property": "",
                "text": "I saved the life of an orc, who gave me a stone with the symbol of the Many-Arrows tribe (a humanoid skull pierced by three arrows) carved into it. The stone is an uncommon magic item that requires attunement, and only I can attune to it.\nAs an action, I can use the stone to summon the spirit of an orc warrior, which appears within 30 feet of me. The spirit uses the orc war chief stat block in the Monster Manual and disappears after 10 minutes or when reduced to 0 hit points. The spirit understands any language I speak and obeys my commands.\nAfter the stone is used three times, it turns to dust. (See Appendix B of Icewind Dale: Rime of the Frostmaiden)\nSource: Icewind Dale: Rime of the Frostmaiden p. 264"
            },
            {
                "name": "Professor Skant",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "",
                "property": "",
                "text": "The professor orb owned by Vellynne Harpell and stolen by Nass Lantomir calls itself Professor Skant. It is lawful good, and it has a Wisdom of 11 and a Charisma of 9. It speaks and reads Common, Draconic, Elvish, and Loross (the dead language of the Empire of Netheril). Professor Skant is a chatterbox and assumes all humanoids are dunderheads. When elaborating on its areas of expertise, it adopts an unintentionally patronizing tone. It has the following four areas of expertise:\n• The history of Netheril (see the \"Fate of Netheril\" sidebar)\n• Vampirism and the traits of vampires\n• Rituals surrounding the making, bottling, and drinking of Elverquisst (a rare, ruby-colored elven liquor distilled from sunshine and rare summer fruits)\n• The tarrasque (see the Monster Manual)\nSource: Icewind Dale: Rime of the Frostmaiden p. 315"
            },
            {
                "name": "Psi Crystal",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "",
                "property": "",
                "text": "This crystal grants you telepathy for as long as you remain attuned to it. See the introduction of the Monster Manual for rules on how this telepathy works.\nThe crystal also glows with a purplish inner light while you are attuned to it.\nThe higher your intelligence, the greater the light's intensity and the greater the range of the telepathy (see the Psi Crystal Properties table).\nPsi Crystal Properties\nIntelligence Score | Range of Telepathy | Light Intensity\n3-7 | 15 feet | Dim light out to a range of 5 feet\n8-11 | 30 feet | Bright light in a 5-foot radius and dim light for an additional 5 feet\n12-15 | 60 feet | Bright light in a 10-foot radius and dim light for an additional 10 feet\n16 or higher | 120 feet | Bright light in a 15-foot radius and dim light for an additional 15 feet\nSource: Icewind Dale: Rime of the Frostmaiden p. 315"
            },
            {
                "name": "Scroll of Tarrasque Summoning",
                "detail": "",
                "type": "SC",
                "weight": "",
                "property": "",
                "text": "Using an action to read the scroll causes the tarrasque (see the creature's entry in the Monster Manual) to appear in an unoccupied space you can see within 1 mile of you. The tarrasque disappears when it drops to 0 hit points and is hostile toward all creatures other than itself.\nSource: Icewind Dale: Rime of the Frostmaiden p. 315"
            },
            {
                "name": "Scroll of the Comet",
                "detail": "",
                "type": "SC",
                "weight": "",
                "property": "",
                "text": "By using an action to read the scroll, you cause a comet to fall from the sky and crash to the ground at a point you can see up to 1 mile away from you. You must be outdoors when you use the scroll, or nothing happens and the scroll is wasted.\nThe comet creates a 50-foot-deep, 500-foot-radius crater on impact. Any creature in that radius must make a DC 20 Dexterity saving throw, taking 30d10 force damage on a failed saving throw, or half as much damage on a successful one. All structures in the crater are destroyed, as are all nonmagical objects that aren't being worn or held.\nSource: Icewind Dale: Rime of the Frostmaiden p. 315",
                "roll": "30d10"
            },
            {
                "name": "Shield Guardian Amulet",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "",
                "property": "",
                "text": "The amulet is a 4-inch-wide disk composed of silver-framed wood, with a rune carved into its face. A detect magic spell reveals a magical aura of enchantment around the amulet.\nEvery shield guardian has an amulet magically linked to it. A shield guardian can have only one corresponding amulet, and if that amulet is destroyed, the shield guardian is incapacitated until a replacement amulet is created.\nA shield guardian's amulet is subject to direct attack if it isn't being worn or carried. It has AC 10, 10 hit points, and immunity to poison and psychic damage. Crafting an amulet requires 1 week and costs 1,000 gp in components.\nA shield guardian's solitary focus is to protect the amulet's wearer. The amulet's wearer can command the guardian to attack its enemies or to guard the wielder against attack. If an attack threatens to injure the wearer, the construct can magically absorb the blow into its own body, even at a distance.\nA humanoid that attunes to this amulet knows the distance and direction of the shield guardian, provided the amulet and the guardian are on the same plane of existence. As an action, the amulet's attuned wearer can try to reactivate the shield guardian, doing so with a successful DC 20 Intelligence (Arcana) check. Reactivation can only be attempted while the amulet and guardian are within 10 feet of each other.\nSource: Icewind Dale: Rime of the Frostmaiden p. 149"
            },
            {
                "name": "Sled Dog",
                "detail": "Mount",
                "type": "G",
                "weight": "",
                "value": "50.0",
                "property": "",
                "text": "A sled dog (use the wolf stat block in appendix A of the Monster Manual) costs 50 gp and can pull 360 pounds.\nSled dogs must take a short rest after pulling a sled for 1 hour; otherwise, they gain one level of exhaustion.\nSource: Icewind Dale: Rime of the Frostmaiden p. 20"
            },
            {
                "name": "Snowshoes",
                "detail": "Adventuring Gear",
                "type": "G",
                "weight": "4",
                "value": "2.0",
                "property": "",
                "text": "Snowshoes reduce the likelihood of their wearer getting stuck in the deep snow.\nSource: Icewind Dale: Rime of the Frostmaiden p. 20"
            },
            {
                "name": "The Codicil of White",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "",
                "property": "",
                "text": "The Codicil of White is a tall, thin volume bound in white ermine fur over seasoned boards of white pine and sealed with a clasp and lock of tarnished silver. The book is cold to the touch, and the fur is worn about the edges from use. The twenty-seven pages within are of vellum painted with silver gilt on the outer edges. The whole is sewn to a leather binding with strips of sinews, making it quite durable.\nA creature with the codicil in its possession has resistance to cold damage.\nThe codicil was written by followers of Auril as a primer on her worship. The first page is a title page with the snowflake symbol of Auril on it. The remaining pages describe various priestly rituals and ceremonies in chilling detail. Nestled among these descriptions is a spell that wizards can learn (frost fingers, and a poem called \"Rime of the Frostmaiden\" (see appendix E)). The poem is an incantation, the power of which can be used to split a glacier (see chapter 6). The poem might have other capabilities, at your discretion\nSource: Icewind Dale: Rime of the Frostmaiden p. 317"
            },
            {
                "name": "The Incantations of Iriolarthas",
                "detail": "Adventuring Gear",
                "type": "G",
                "weight": "3",
                "property": "",
                "text": "The Incantations of Iriolarthas is a weighty spellbook. Its black leather covers have dead, toothy worms glued to them, sheathed in glossy varnish. Set into this morbid display on the front cover is a gold rune that resembles a stylized eye with a pupil shaped like a candle flame—the sigil of Iriolarthas, a Netherese lich.\nThe book contains sixty pages of brittle yellow vellum. Written on these pages are the following wizard spells:\n• 1st level: alarm, detect magic, identify, magic missile, shield, Tasha's hideous laughter, thunderwave\n• 2nd level: arcane lock, continual flame, invisibility, knock, levitate, Melf's acid arrow, mirror image\n• 3rd level: animate dead, bestow curse, clairvoyance, counterspell, dispel magic, fireball, glyph of warding\n• 4th level: arcane eye, banishment, blight, dimension door, Evard's black tentacles, phantasmal killer\n• 5th level: Bigby's hand, cloudkill, dominate person, planar binding, scrying, telekinesis\n• 6th level: create undead, disintegrate, globe of invulnerability, move earth, Otto's irresistible dance\n• 7th level: create magen, finger of death, prismatic spray, teleport\n• 8th level: demiplane, dominate monster, mind blank, power word stun\n• 9th level: blade of disaster, power word kill\nSource: Icewind Dale: Rime of the Frostmaiden p. 317"
            },
            {
                "name": "Thermal Cube",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "",
                "property": "",
                "text": "This 3-inch cube of solid brimstone generates enough dry heat to keep the temperature within 15 feet of it at 95 degrees Fahrenheit (35 degrees Celsius).\nSource: Icewind Dale: Rime of the Frostmaiden p. 316"
            },
            {
                "name": "Ythryn Mythallar",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "",
                "property": "",
                "text": "A mythallar looks like an enormous crystal ball held in an ornate cradle. The globe sheds bright light in a 300-foot radius and dim light for an additional 300 feet. The globe draws magic from the Weave that can be harnessed for various purposes. For example, Netherese mages used mythallars to keep their cities aloft and empower their magic items. The bigger the mythallar, the more magic it can hold. The largest mythallars are 150 feet in diameter.\nThe Ythryn mythallar is a relatively small device—a mere 50 feet in diameter. To attune to this mythallar, a creature must finish a short rest within 30 feet of it, meditating on the mythallar. Up to eight creatures can be attuned to it at one time; otherwise, the Ythryn mythallar follows the attunement rules in the Dungeon Master's Guide. If a ninth creature tries to attune to the mythallar, nothing happens.\nAll creatures attuned to the Ythryn mythallar can sense when the device is being used. A creature attuned to the device can use any of its properties, but only if all other creatures attuned to the device agree to allow it. The Ythryn mythallar's properties are as follows:\n• While you're on the same plane of existence as the Ythryn mythallar, you can use an action to cause it to fly in any direction you choose at a speed of 30 feet. All matter within 500 feet of the device moves with it. The Ythryn mythallar and all structures held aloft by it hover in place when not in motion.\n• As an action, you can cause one magic item you are holding within 30 feet of the Ythryn mythallar to immediately regain all its expended charges or uses. A magic item recharged in this manner can't be recharged by the Ythryn mythallar again until after the item regains expended charges or uses on its own.\n• You can use the Ythryn mythallar to cast the control weather spell without requiring any components and without the need for you to be outdoors. This casting of the spell has a 50-mile radius. For the duration of the spell's casting time, you must be within 30 feet of the Ythryn mythallar or the spell fails.\nTouching the Mythallar: Any creature that touches the globe of the mythallar must make a DC 22 Constitution saving throw, taking 180 (20d10 + 70) radiant damage on a failed save, or half as much damage on a successful one. Undead have disadvantage on this saving throw. Any object that touches the globe, other than an artifact or the mythallar's cradle, is disintegrated instantly (no save).\nSource: Icewind Dale: Rime of the Frostmaiden p. 316",
                "roll": "20d10+70"
            }
        ],
        "_version": "5",
        "_auto_indent": "NO"
    }
}
