{
    "compendium": {
        "feat": [
            {
                "name": "Aberrant Dragonmark",
                "prerequisite": "",
                "text": "You have manifested an aberrant dragonmark. Determine its appearance and the flaw associated with it. You gain the following benefits:\n• You learn a cantrip of your choice from the sorcerer spell list. In addition, choose a 1st-level spell from the sorcerer spell list. You learn that spell and can cast it through your mark. Once you cast it, you must finish a short or long rest before you can cast it again through the mark. Constitution is your spellcasting ability for these spells.\n• When you cast the 1st-level spell through your mark, you can expend one of your Hit Dice and roll it. If you roll an even number, you gain a number of temporary hit points equal to the number rolled. If you roll an odd number, one random creature within 30 feet of you (not including you) takes force damage equal to the number rolled. If no other creatures are in range, you take the damage.\nYou also develop a random flaw from the Aberrant Dragonmark Flaws table.\nAberrant Dragonmark Flaws\nd8 | Flaw\n1 | Your mark is a source of constant physical pain.\n2 | Your mark whispers to you. Its meaning can be unclear.\n3 | When you're stressed, the mark hisses audibly.\n4 | The skin around the mark is burned, scaly, or withered.\n5 | Animals are uneasy around you.\n6 | You have a mood swing any time you use your mark.\n7 | Your looks change slightly whenever you use the mark.\n8 | You have horrific nightmares after you use your mark.\n\nSource: Eberron: Rising from the Last War p. 52, Wayfinder's Guide to Eberron p. 112",
                "modifier": {
                    "_category": "ability score",
                    "__text": "Constitution +1"
                }
            },
            {
                "name": "Revenant Blade",
                "prerequisite": "Elf",
                "text": "You are descended from a master of the double-bladed scimitar, and some of that mastery has passed on to you. You gain the following benefits:\n• Increase your Strength or Dexterity score by 1, to a maximum of 20\n• While you are holding a double-bladed scimitar with two hands, you gain a +1 bonus to Armor Class.\n• A double-bladed scimitar has the finesse property when you wield it.\nSource: Eberron: Rising from the Last War p. 22, Wayfinder's Guide to Eberron p. 74"
            }
        ],
        "_version": "5",
        "_auto_indent": "NO"
    }
}
