{
    "compendium": {
        "item": [
            {
                "name": "Black Dragon Mask",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "",
                "property": "",
                "text": "This horned mask of glossy ebony has horns and a skull-like mien. The mask reshapes to fit a wearer attuned to it. While you are wearing the mask and attuned to it, you can access the following properties.\nDamage Absorption: You have damage resistance to acid. If you already have damage resistance to acid from another source, you gain immunity to acid damage. If you already have immunity to acid damage from another source, you regain hit points equal to half of any acid damage you are dealt.\nDraconic Majesty: While you are wearing no armor, you can add your Charisma bonus to your Armor Class.\nDragon Breath: If you have a breath weapon that requires rest to recharge, it gains a recharge of 6.\nDragon Sight: You gain darkvision with a radius of 60 feet, or an additional 60 feet of darkvision if you already have that sense. Once per day, you can gain blindsight out to a range of 30 feet for 5 minutes.\nDragon Tongue: You can speak and understand Draconic. You also have advantage on any Charisma check you make against Black dragons.\nLegendary Resistance: (1/Day) If you fail a saving throw, you can choose to succeed instead.\nWater Breathing: You can breathe underwater.\nSource: Hoard of the Dragon Queen p. 94"
            },
            {
                "name": "Dragongleam",
                "detail": "simple Weapon, Melee Weapon",
                "type": "M",
                "weight": "3",
                "property": "T,V",
                "dmg1": "1d6",
                "dmg2": "1d8",
                "dmgType": "P",
                "range": "20/60",
                "text": "This spear is enchanted with 10 charges of a daylight spell for use in twilight or dark forest underbrush. The command phrase is \"Tiamat's eyes shine,\" written in Draconic runes on the spear's crossguard.\nSource: Hoard of the Dragon Queen p. 69"
            },
            {
                "name": "Hazirawn",
                "detail": "Melee Weapon",
                "type": "M",
                "weight": "6",
                "property": "H,2H",
                "dmg1": "2d6",
                "dmgType": "S",
                "text": "A sentient (neutral evil) greatsword, Hazirawn is capable of speech in Common and Netherese. Even if you aren't attuned to the sword, you gain a +1 bonus to attack and damage rolls made with this weapon. If you are not attuned to Hazirawn, you deal an extra 1d6 necrotic damage when you hit with the weapon.\nIncreased Potency: While you are attuned to this weapon, its bonus on attack and damage rolls increases to +2, and a hit deals an extra 2d6 necrotic damage (instead of 1d6).\nSpells: Hazirawn has 4 charges to cast spells. As long as the sword is attuned to you and you are holding it in your hand, you can cast detect magic (1 charge), detect evil and good (1 charge), or detect thoughts (2 charges). Each night at midnight, Hazirawn regains 1d4 expended charges.\nWounding: While you are attuned to the weapon, any creature that you hit with Hazirawn can't regain hit points for 1 minute. The target can make a DC 15 Constitution saving throw at the end of each of its turns, ending this effect early on a success.\nSource: Hoard of the Dragon Queen p. 94",
                "roll": [
                    "1d6",
                    "2d6",
                    "1d4"
                ]
            },
            {
                "name": "Insignia of Claws",
                "detail": "Wondrous item",
                "type": "W",
                "magic": "1",
                "weight": "",
                "property": "",
                "text": "The jewels in the insignia of the Cult of the Dragon flare with purple light when you enter combat, empowering your natural fists or natural weapons.\nWhile wearing the insignia you gain a +1 bonus to the attack rolls and the damage rolls you make with unarmed strikes and natural weapons. Such attacks are considered to be magical.\nSource: Hoard of the Dragon Queen p. 94"
            },
            {
                "name": "Tankard of Plenty",
                "detail": "Other",
                "type": "G",
                "weight": "",
                "property": "",
                "text": "This golden stein is decorated with dancing dwarves and grain patterns. Speaking the command word (\"Illefarn\") while grasping the handle fills the tankard with three pints of rich dwarven ale. This power can be used up to three times per day.\nSource: Hoard of the Dragon Queen p. 74"
            },
            {
                "name": "Wand of Winter",
                "detail": "",
                "type": "WD",
                "weight": "1",
                "property": "",
                "text": "This wand looks and feels like an icicle. You must be attuned to the wand to use it.\nThe wand has 7 charges, which are used to fuel the spells within it. With the wand in hand, you can use your action to cast one of the following spells from the wand, even if you are incapable of casting spells: ray of frost (no charges, or 1 charge to cast at 5th level; +5 to hit with ranged spell attack), sleet storm (3 charges; spell save DC 15), or ice storm (4 charges; spell save DC 15). No components are required. The wand regains 1d6 + 1 expended charges each day at dawn. If you expend the wand's last charge, roll a d20. On a 20, the wand melts away, forever destroyed.\nSource: Hoard of the Dragon Queen p. 94",
                "roll": "1d6+1"
            }
        ],
        "_version": "5",
        "_auto_indent": "NO"
    }
}
